cmsis-svd/cmsis-svd/data/NXP/LPC5410x_v0.4.svd
<?xml version="1.0" encoding="utf-8"?> 

<device schemaVersion="1.1" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance"
	xs:noNamespaceSchemaLocation="CMSIS-SVD_Schema_1_1.xsd">
	<name>LPC5410x</name>
	<version>0.4</version>
	<!--Content based on v1.0 of the LPC5410x user manual-->
	<description>LPC5410x Cortex-M4 MCU; Cortex-M0+ coprocessor</description>
	<cpu>
		<name>CM4</name>
		<!-- revision and core config (mpu, fpu,  systick are present) nvic prio = 3 -->
		<revision>r0p0</revision>
		<endian>little</endian>
		<mpuPresent>1</mpuPresent>
		<fpuPresent>1</fpuPresent>
		<nvicPrioBits>3</nvicPrioBits>
		<vendorSystickConfig>0</vendorSystickConfig>
	</cpu>
	<headerDefinitionsPrefix>LPC_</headerDefinitionsPrefix>
	<addressUnitBits>8</addressUnitBits>
	<width>32</width>
	<size>32</size>

	<!--
		Software that is described herein is for illustrative purposes only
		which provides customers with programming information regarding the
		products. This software is supplied "AS IS" without any warranties.
		NXP Semiconductors assumes no responsibility or liability for the
		use of the software, conveys no license or title under any patent,
		copyright, or mask work right to the product. NXP Semiconductors
		reserves the right to make changes in the software without
		notification. NXP Semiconductors also make no representation or
		warranty that such application will be suitable for the specified
		use without further testing or modification.	
		
	-->







	<peripherals>

		<peripheral>
			<name>GPIO</name>
			<description>General Purpose I/O </description>
			<groupName>GPIO</groupName>
			<baseAddress>0x1C000000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x2304</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<dim>50</dim>
					<dimIncrement>0x1</dimIncrement>
					<dimIndex>0-49</dimIndex>
					<name>B%s</name>
					<description>Byte pin registers port 0/1; pins PIO0_0 to PIO1_8</description>
					<addressOffset>0x000</addressOffset>
					<size>1</size>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>PBYTE</name>
							<description>Read: state of the pin PIOm_n, regardless of direction,
								masking, or alternate function, except that pins configured as
								analog I/O always read as 0. One register for each port pin.
								Supported pins depends on the specific device and package. Write:
								loads the pins output bit. One register for each port pin. Supported
								pins depends on the specific device and package.</description>
							<bitRange>[0:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<dim>50</dim>
					<dimIncrement>0x4</dimIncrement>
					<dimIndex>0-49</dimIndex>
					<name>W%s</name>
					<description>Word pin registers port 0/1; pins PIO0_0 to PIO1_8</description>
					<addressOffset>0x1000</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>PWORD</name>
							<description>Read 0: pin PIOm_n is LOW. Write 0: clear output bit. Read
								0xFFFF FFFF: pin PIOm_n is HIGH. Write any value 0x0000 0001 to
								0xFFFF FFFF: set output bit. Only 0 or 0xFFFF FFFF can be read.
								Writing any value other than 0 will set the output bit. One register
								for each port pin. Supported pins depends on the specific device and
								package.</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<dim>2</dim>
					<dimIncrement>0x4</dimIncrement>
					<dimIndex>0-1</dimIndex>
					<name>DIR%s</name>
					<description>Direction registers port 0/1</description>
					<addressOffset>0x2000</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DIRP</name>
							<description>Selects pin direction for pin PIOm_n. Supported pins
								depends on the specific device and package. 0 = input. 1 =
								output.</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<dim>2</dim>
					<dimIncrement>0x4</dimIncrement>
					<dimIndex>0-1</dimIndex>
					<name>MASK%s</name>
					<description>Mask register port 0/1</description>
					<addressOffset>0x2080</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>MASKP</name>
							<description>Controls which bits corresponding to PIOm_n are active in
								the MPORT register. Supported pins depends on the specific device
								and package. 0 = Read MPORT: pin state; write MPORT: load output
								bit. 1 = Read MPORT: 0; write MPORT: output bit not
								affected.</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<dim>2</dim>
					<dimIncrement>0x4</dimIncrement>
					<dimIndex>0-1</dimIndex>
					<name>PIN%s</name>
					<description>Port pin register port 0/1</description>
					<addressOffset>0x2100</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>PORT</name>
							<description>Reads pin states or loads output bits. Supported pins
								depends on the specific device and package. 0 = Read: pin is low;
								write: clear output bit. 1 = Read: pin is high; write: set output
								bit.</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<dim>2</dim>
					<dimIncrement>0x4</dimIncrement>
					<dimIndex>0-1</dimIndex>
					<name>MPIN%s</name>
					<description>Masked port register port 0/1</description>
					<addressOffset>0x2180</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>MPORTP</name>
							<description>Masked port register. Supported pins depends on the
								specific device and package. 0 = Read: pin is LOW and/or the
								corresponding bit in the MASK register is 1; write: clear output bit
								if the corresponding bit in the MASK register is 0. 1 = Read: pin is
								HIGH and the corresponding bit in the MASK register is 0; write: set
								output bit if the corresponding bit in the MASK register is
								0.</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<dim>2</dim>
					<dimIncrement>0x4</dimIncrement>
					<dimIndex>0-1</dimIndex>
					<name>SET%s</name>
					<description>Write: Set register for port 0/1 Read: output bits for port
						0/1</description>
					<addressOffset>0x2200</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SETP</name>
							<description>Read or set output bits. Supported pins depends on the
								specific device and package. 0 = Read: output bit: write: no
								operation. 1 = Read: output bit; write: set output
								bit.</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<dim>2</dim>
					<dimIncrement>0x4</dimIncrement>
					<dimIndex>0-1</dimIndex>
					<name>CLR%s</name>
					<description>Clear port 0/1</description>
					<addressOffset>0x2280</addressOffset>
					<access>write-only</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>CLRP</name>
							<description>Clear output bits. Supported pins depends on the specific
								device and package. 0 = No operation. 1 = Clear output
								bit.</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<dim>2</dim>
					<dimIncrement>0x4</dimIncrement>
					<dimIndex>0-1</dimIndex>
					<name>NOT%s</name>
					<description>Toggle port 0/1</description>
					<addressOffset>0x2300</addressOffset>
					<access>write-only</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>NOTP</name>
							<description>Toggle output bits. Supported pins depends on the specific
								device and package. 0 = no operation. 1 = Toggle output
								bit.</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
