cmsis-svd/cmsis-svd/data/NXP/LPC5410x_v0.4.svd
						</field>
						<field>
							<name>TRIGPOL</name>
							<description>Trigger Polarity. Selects the polarity of a hardware
								trigger for this channel.</description>
							<bitRange>[4:4]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>ACTIVE_LOW__FALLING</name>
									<description>Active low - falling edge. Hardware trigger is
										active low or falling edge triggered, based on
										TRIGTYPE.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE_HIGH__RISING</name>
									<description>Active high - rising edge. Hardware trigger is
										active high or rising edge triggered, based on
										TRIGTYPE.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TRIGTYPE</name>
							<description>Trigger Type. Selects hardware trigger as edge triggered or
								level triggered.</description>
							<bitRange>[5:5]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>EDGE</name>
									<description>Edge. Hardware trigger is edge triggered. Transfers
										will be initiated and completed, as specified for a single
										trigger.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LEVEL</name>
									<description>Level. Hardware trigger is level triggered. Note
										that when level triggering without burst (BURSTPOWER = 0) is
										selected, only hardware triggers should be used on that
										channel. Transfers continue as long as the trigger level is
										asserted. Once the trigger is de-asserted, the transfer will
										be paused until the trigger is, again, asserted. However,
										the transfer will not be paused until any remaining
										transfers within the current BURSTPOWER length are
										completed.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TRIGBURST</name>
							<description>Trigger Burst. Selects whether hardware triggers cause a
								single or burst transfer.</description>
							<bitRange>[6:6]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>SINGLE_TRANSFER</name>
									<description>Single transfer. Hardware trigger causes a single
										transfer.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>BURST_TRANSFER</name>
									<description>Burst transfer. When the trigger for this channel
										is set to edge triggered, a hardware trigger causes a burst
										transfer, as defined by BURSTPOWER. When the trigger for
										this channel is set to level triggered, a hardware trigger
										causes transfers to continue as long as the trigger is
										asserted, unless the transfer is complete.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[7:7]</bitRange>

						</field>
						<field>
							<name>BURSTPOWER</name>
							<description>Burst Power is used in two ways. It always selects the
								address wrap size when SRCBURSTWRAP and/or DSTBURSTWRAP modes are
								selected (see descriptions elsewhere in this register). When the
								TRIGBURST field elsewhere in this register = 1, Burst Power selects
								how many transfers are performed for each DMA trigger. This can be
								used, for example, with peripherals that contain a FIFO that can
								initiate a DMA operation when the FIFO reaches a certain level.
								0000: Burst size = 1 (20). 0001: Burst size = 2 (21). 0010: Burst
								size = 4 (22). ... 1010: Burst size = 1024 (210). This corresponds
								to the maximum supported transfer count. others: not supported. The
								total transfer length as defined in the XFERCOUNT bits in the
								XFERCFG register must be an even multiple of the burst
								size.</description>
							<bitRange>[11:8]</bitRange>

						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[13:12]</bitRange>

						</field>
						<field>
							<name>SRCBURSTWRAP</name>
							<description>Source Burst Wrap. When enabled, the source data address
								for the DMA is wrapped, meaning that the source address range for
								each burst will be the same. As an example, this could be used to
								read several sequential registers from a peripheral for each DMA
								burst, reading the same registers again for each
								burst.</description>
							<bitRange>[14:14]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled. Source burst wrapping is not enabled for
										this DMA channel.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enabled. Source burst wrapping is enabled for this
										DMA channel.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DSTBURSTWRAP</name>
							<description>Destination Burst Wrap. When enabled, the destination data
								address for the DMA is wrapped, meaning that the destination address
								range for each burst will be the same. As an example, this could be
								used to write several sequential registers to a peripheral for each
								DMA burst, writing the same registers again for each
								burst.</description>
							<bitRange>[15:15]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled. Destination burst wrapping is not enabled
										for this DMA channel.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enabled. Destination burst wrapping is enabled for
										this DMA channel.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CHPRIORITY</name>
							<description>Priority of this channel when multiple DMA requests are
								pending. Eight priority levels are supported. 0x0 = highest
								priority. 0x7 = lowest priority.</description>
							<bitRange>[18:16]</bitRange>

