cmsis-svd/cmsis-svd/data/NXP/LPC5410x_v0.4.svd
						</field>
						<field>
							<name>WIDTH</name>
							<description>Transfer width used for this DMA channel.</description>
							<bitRange>[9:8]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>8_BIT</name>
									<description>8-bit. 8-bit transfers are performed (8-bit source
										reads and destination writes).</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>16_BIT</name>
									<description>16-bit. 6-bit transfers are performed (16-bit
										source reads and destination writes).</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>32_BIT</name>
									<description>32-bit. 32-bit transfers are performed (32-bit
										source reads and destination writes).</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RESERVED</name>
									<description>Reserved. Reserved setting, do not
										use.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[11:10]</bitRange>

						</field>
						<field>
							<name>SRCINC</name>
							<description>Determines whether the source address is incremented for
								each DMA transfer.</description>
							<bitRange>[13:12]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NO_INCREMENT</name>
									<description>No increment. The source address is not incremented
										for each transfer. This is the usual case when the source is
										a peripheral device.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1_X_WIDTH</name>
									<description>1 x width. The source address is incremented by the
										amount specified by Width for each transfer. This is the
										usual case when the source is memory.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>2_X_WIDTH</name>
									<description>2 x width. The source address is incremented by 2
										times the amount specified by Width for each
										transfer.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>4_X_WIDTH</name>
									<description>4 x width. The source address is incremented by 4
										times the amount specified by Width for each
										transfer.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DSTINC</name>
							<description>Determines whether the destination address is incremented
								for each DMA transfer.</description>
							<bitRange>[15:14]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NO_INCREMENT</name>
									<description>No increment. The destination address is not
										incremented for each transfer. This is the usual case when
										the destination is a peripheral device.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1_X_WIDTH</name>
									<description>1 x width. The destination address is incremented
										by the amount specified by Width for each transfer. This is
										the usual case when the destination is memory.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>2_X_WIDTH</name>
									<description>2 x width. The destination address is incremented
										by 2 times the amount specified by Width for each
										transfer.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>4_X_WIDTH</name>
									<description>4 x width. The destination address is incremented
										by 4 times the amount specified by Width for each
										transfer.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>XFERCOUNT</name>
							<description>Total number of transfers to be performed, minus 1 encoded.
								The number of bytes transferred is: (XFERCOUNT + 1) x data width (as
								defined by the WIDTH field). The DMA controller uses this bit field
								during transfer to count down. Hence, it cannot be used by software
								to read back the size of the transfer, for instance, in an interrupt
								handler. 0x0 = a total of 1 transfer will be performed. 0x1 = a
								total of 2 transfers will be performed. ... 0x3FF = a total of 1,024
								transfers will be performed.</description>
							<bitRange>[25:16]</bitRange>

						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:26]</bitRange>

						</field>
					</fields>
				</register>
			</registers>

		</peripheral>
		<peripheral>
			<name>CRC</name>
			<description>CRC engine</description>
			<groupName>CRC</groupName>
			<baseAddress>0x1C010000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x1000</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>MODE</name>
					<description>CRC mode register</description>
					<addressOffset>0x000</addressOffset>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CRC_POLY</name>
							<description>CRC polynom: 1X= CRC-32 polynomial 01= CRC-16 polynomial
								00= CRC-CCITT polynomial</description>
							<bitRange>[1:0]</bitRange>
						</field>
						<field>
							<name>BIT_RVS_WR</name>
							<description>Data bit order: 1= Bit order reverse for CRC_WR_DATA (per
								byte) 0= No bit order reverse for CRC_WR_DATA (per
								byte)</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>CMPL_WR</name>
							<description>Data complement: 1= 1s complement for CRC_WR_DATA 0= No 1s
								complement for CRC_WR_DATA</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>BIT_RVS_SUM</name>
							<description>CRC sum bit order: 1= Bit order reverse for CRC_SUM 0= No
								bit order reverse for CRC_SUM</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>CMPL_SUM</name>
							<description>CRC sum complement: 1= 1s complement for CRC_SUM 0=No 1s
								complement for CRC_SUM</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>Reserved</name>
							<description>Always 0 when read</description>
							<bitRange>[31:6]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>SEED</name>
					<description>CRC seed register</description>
					<addressOffset>0x004</addressOffset>
					<access>read-write</access>
					<resetValue>0x0000FFFF</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CRC_SEED</name>
							<description>A write access to this register will load CRC seed value to
								CRC_SUM register with selected bit order and 1s complement
								pre-processes. A write access to this register will overrule the CRC
								calculation in progresses.</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>SUM</name>
					<description>CRC checksum register</description>
					<addressOffset>0x008</addressOffset>
					<access>read-only</access>
					<resetValue>0x0000FFFF</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CRC_SUM</name>
							<description>The most recent CRC sum can be read through this register
								with selected bit order and 1s complement
								post-processes.</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>WR_DATA</name>
					<description>CRC data register</description>
					<addressOffset>0x008</addressOffset>
					<access>write-only</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>CRC_WR_DATA</name>
							<description>Data written to this register will be taken to perform CRC
								calculation with selected bit order and 1s complement pre-process.
								Any write size 8, 16 or 32-bit are allowed and accept back-to-back
								transactions.</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
