cmsis-svd/cmsis-svd/data/NXP/LPC5410x_v0.4.svd
						</field>
					</fields>
				</register>
				<register>
					<dim>8</dim>
					<dimIncrement>0x8</dimIncrement>
					<dimIndex>0-7</dimIndex>
					<name>OUT%s_SET</name>
					<description>SCT output 0 set register</description>
					<addressOffset>0x500</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SET</name>
							<description>A 1 in bit m selects event m to set output n (or clear it
								if SETCLRn = 0x1 or 0x2) event 0 = bit 0, event 1 = bit 1, etc. The
								number of bits = number of events in this SCT.</description>
							<bitRange>[15:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:16]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<dim>8</dim>
					<dimIncrement>0x8</dimIncrement>
					<dimIndex>0-7</dimIndex>
					<name>OUT%s_CLR</name>
					<description>SCT output 0 clear register</description>
					<addressOffset>0x504</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CLR</name>
							<description>A 1 in bit m selects event m to clear output n (or set it
								if SETCLRn = 0x1 or 0x2) event 0 = bit 0, event 1 = bit 1, etc. The
								number of bits = number of events in this SCT.</description>
							<bitRange>[15:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:16]</bitRange>
						</field>
					</fields>
				</register>
			</registers>

		</peripheral>
		<peripheral>
			<name>MAILBOX</name>
			<description>Mailbox</description>
			<groupName>MAILBOX</groupName>
			<baseAddress>0x1C02C000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x1000</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>MAILBOX</name>
				<value>31</value>
			</interrupt>
			<registers>
				<register>
					<name>IRQ0</name>
					<description>Interrupt request register for the Cortex-M0+ CPU.</description>
					<addressOffset>0x000</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>INTREQ</name>
							<description>If any bit is set, an interrupt request is sent to the
								Cortex-M0+ interrupt controller.</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>IRQ0SET</name>
					<description>Set bits in IRQ0</description>
					<addressOffset>0x004</addressOffset>
					<access>write-only</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>INTREQSET</name>
							<description>Writing 1 sets the corresponding bit in the IRQ0
								register.</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>IRQ0CLR</name>
					<description>Clear bits in IRQ0</description>
					<addressOffset>0x008</addressOffset>
					<access>write-only</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>INTREQCLR</name>
							<description>Writing 1 clears the corresponding bit in the IRQ0
								register.</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>IRQ1</name>
					<description>Interrupt request register for the Cortex M4 CPU.</description>
					<addressOffset>0x010</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>INTREQ</name>
							<description>If any bit is set, an interrupt request is sent to the
								Cortex-M0+ interrupt controller.</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>IRQ1SET</name>
					<description>Set bits in IRQ1</description>
					<addressOffset>0x014</addressOffset>
					<access>write-only</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>INTREQSET</name>
							<description>Writing 1 sets the corresponding bit in the IRQ1
								register.</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>IRQ1CLR</name>
					<description>Clear bits in IRQ1</description>
					<addressOffset>0x018</addressOffset>
					<access>write-only</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>INTREQCLR</name>
							<description>Writing 1 clears the corresponding bit in the IRQ1
								register.</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>MUTEX</name>
					<description>Mutual exclusion register</description>
					<addressOffset>0x0F8</addressOffset>
					<access>read-write</access>
					<resetValue>0x1</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>EX</name>
							<description>Cleared when read, set when written. See usage description
								above.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:1]</bitRange>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
		<peripheral>
			<name>ADC0</name>
			<description>12-bit ADC controller 0</description>
			<groupName>ADC0</groupName>
			<baseAddress>0x1C034000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x1000</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>ADC_SEQA</name>
				<value>26</value>
			</interrupt>
			<interrupt>
				<name>ADC_SEQB</name>
				<value>27</value>
			</interrupt>
			<interrupt>
				<name>ADC_THCMP</name>
				<value>28</value>
			</interrupt>
			<registers>
				<register>
					<name>CTRL</name>
					<description>ADC Control Register. Contains the clock divide value, enable bits
						for each sequence and the ADC power-down bit.</description>
					<addressOffset>0x000</addressOffset>
					<access>read-write</access>
					<resetValue>0x600</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CLKDIV</name>
							<description>In synchronous mode only, the system clock is divided by
								this value plus one to produce the clock for the ADC converter,
								which should be less than or equal to 80 MHz. Typically, software
								should program the smallest value in this field that yields this
								maximum clock rate or slightly less, but in certain cases (such as a
								high-impedance analog source) a slower clock may be desirable. This
								field is ignored in the asynchronous operating mode.</description>
							<bitRange>[7:0]</bitRange>

