cmsis-svd/cmsis-svd/data/NXP/LPC5410x_v0.4.svd
			</registers>
		</peripheral>

		<peripheral>
			<name>VFIFO</name>
			<description>System FIFO for Serial Peripherals </description>
			<groupName>VFIFO</groupName>
			<baseAddress>0x1C038000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x4000</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>FIFOCTLUSART</name>
					<description>USART FIFO global control register. These registers are byte,
						halfword, and word addressable.The upper 16 bits of these registers provide
						information about the System FIFO configuration, and are specific to each
						device type.</description>
					<addressOffset>0x0100</addressOffset>
					<access>read-write</access>
					<resetValue>0x707</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RXPAUSE</name>
							<description>Pause all USARTs receive FIFO operations. This can be used
								to prepare the System FIFO to reconfigure FIFO allocations among the
								USART receivers.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>RXPAUSED</name>
							<description>All USART receive FIFOs are paused.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>RXEMPTY</name>
							<description>All USART receive FIFOs are empty.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[7:3]</bitRange>
						</field>
						<field>
							<name>TXPAUSE</name>
							<description>Pause all USARTs transmit FIFO operations. This can be used
								to prepare the System FIFO to reconfigure FIFO allocations among the
								USART transmitters.</description>
							<bitRange>[8:8]</bitRange>
						</field>
						<field>
							<name>TXPAUSED</name>
							<description>All USART transmit FIFOs are paused.</description>
							<bitRange>[9:9]</bitRange>
						</field>
						<field>
							<name>TXEMPTY</name>
							<description>All USART transmit FIFOs are empty.</description>
							<bitRange>[10:10]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[15:11]</bitRange>
						</field>
						<field>
							<name>RXFIFOTOTAL</name>
							<description>Reports the receive FIFO space available for USARTs on this
								FIFO. The reset value is device specific.</description>
							<bitRange>[23:16]</bitRange>
						</field>
						<field>
							<name>TXFIFOTOTAL</name>
							<description>Reports the transmit FIFO space available for USARTs on
								this FIFO. The reset value is device specific.</description>
							<bitRange>[31:24]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>FIFOUPDATEUSART</name>
					<description>USART FIFO global update register</description>
					<addressOffset>0x0104</addressOffset>
					<access>write-only</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>USART0RXUPDATESIZE</name>
							<description>Writing 1 updates USART0 Rx FIFO size to match the USART0
								RXSIZE. Must be done for all USARTs when any USART RXSIZE is
								changed.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>USART1RXUPDATESIZE</name>
							<description>Writing 1 updates USART1 Rx FIFO size to match the USART1
								RXSIZE. Must be done for all USARTs when any USART RXSIZE is
								changed.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>USART2RXUPDATESIZE</name>
							<description>Writing 1 updates USART2 Rx FIFO size to match the USART2
								RXSIZE. Must be done for all USARTs when any USART RXSIZE is
								changed.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>USART3RXUPDATESIZE</name>
							<description>Writing 1 updates USART3 Rx FIFO size to match the USART3
								RXSIZE. Must be done for all USARTs when any USART RXSIZE is
								changed.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[15:4]</bitRange>
						</field>
						<field>
							<name>USART0TXUPDATESIZE</name>
							<description>Writing 1 updates USART0 Tx FIFO size to match the USART0
								TXSIZE. Must be done for all USARTs when any USART TXSIZE is
								changed.</description>
							<bitRange>[16:16]</bitRange>
						</field>
						<field>
							<name>USART1TXUPDATESIZE</name>
							<description>Writing 1 updates USART1 Tx FIFO size to match the USART1
								TXSIZE. Must be done for all USARTs when any USART TXSIZE is
								changed.</description>
							<bitRange>[17:17]</bitRange>
						</field>
						<field>
							<name>USART2TXUPDATESIZE</name>
							<description>Writing 1 updates USART2 Tx FIFO size to match the USART2
								TXSIZE. Must be done for all USARTs when any USART TXSIZE is
								changed.</description>
							<bitRange>[18:18]</bitRange>
						</field>
						<field>
							<name>USART3TXUPDATESIZE</name>
							<description>Writing 1 updates USART3 Tx FIFO size to match the USART3
								TXSIZE. Must be done for all USARTs when any USART TXSIZE is
								changed.</description>
							<bitRange>[19:19]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:20]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<dim>4</dim>
					<dimIncrement>0x4</dimIncrement>
					<dimIndex>0-3</dimIndex>
					<name>FIFOCFGUSART%s</name>
					<description>FIFO configuration register for USART0</description>
					<addressOffset>0x0110</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RXSIZE</name>
							<description>Configures the USART receive FIFO size. A zero values
								provides no System FIFO service for the related USART
								receiver.</description>
							<bitRange>[7:0]</bitRange>
						</field>
						<field>
							<name>TXSIZE</name>
							<description>Configures the USART transmit FIFO size. A zero values
								provides no System FIFO service for the related USART
								transmitter.</description>
							<bitRange>[15:8]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:16]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>FIFOCTLSPI</name>
					<description>SPI FIFO global control register. These registers are byte,
						halfword, and word addressable. The upper 16 bits of these registers provide
						information about the System FIFO configuration, and are specific to each
						device type.</description>
					<addressOffset>0x0200</addressOffset>
					<access>read-write</access>
					<resetValue>0x707</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RXPAUSE</name>
							<description>Pause all SPIs receive FIFO operations. This can be used to
								prepare the System FIFO to reconfigure FIFO allocations among the
								SPI receivers.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>RXPAUSED</name>
							<description>All SPI receive FIFOs are paused.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>RXEMPTY</name>
							<description>All SPI receive FIFOs are empty.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[7:3]</bitRange>
						</field>
						<field>
							<name>TXPAUSE</name>
							<description>Pause all SPIs transmit FIFO operations. This can be used
								to prepare the System FIFO to reconfigure FIFO allocations among the
								SPI transmitters.</description>
							<bitRange>[8:8]</bitRange>
						</field>
						<field>
							<name>TXPAUSED</name>
							<description>All SPI transmit FIFOs are paused.</description>
							<bitRange>[9:9]</bitRange>
						</field>
						<field>
							<name>TXEMPTY</name>
							<description>All SPI transmit FIFOs are empty.</description>
							<bitRange>[10:10]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[15:11]</bitRange>
						</field>
						<field>
							<name>RXFIFOTOTAL</name>
							<description>Reports the receive FIFO space available for SPIs on the
								System FIFO. The reset value is device specific.</description>
							<bitRange>[23:16]</bitRange>
						</field>
						<field>
							<name>TXFIFOTOTAL</name>
							<description>Reports the transmit FIFO space available for SPIs on the
								System FIFO. The reset value is device specific.</description>
							<bitRange>[31:24]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>FIFOUPDATESPI</name>
					<description>SPI FIFO global update register</description>
					<addressOffset>0x0204</addressOffset>
					<access>write-only</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>SPI0RXUPDATESIZE</name>
							<description>Writing 1 updates SPI0 Rx FIFO size to match the SPI0
								RXSIZE. Must be done for all SPIs when any SPI RXSIZE is
								changed.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>SPI1RXUPDATESIZE</name>
							<description>Writing 1 updates SPI1 Rx FIFO size to match the SPI1
								RXSIZE. Must be done for all SPIs when any SPI RXSIZE is
								changed.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[15:3]</bitRange>
						</field>
						<field>
							<name>SPI0TXUPDATESIZE</name>
							<description>Writing 1 updates SPI0 Tx FIFO size to match the SPI0
								TXSIZE. Must be done for all SPIs when any SPI TXSIZE is
								changed.</description>
							<bitRange>[16:16]</bitRange>
						</field>
						<field>
							<name>SPI1TXUPDATESIZE</name>
							<description>Writing 1 updates SPI1 Tx FIFO size to match the SPI1
								TXSIZE. Must be done for all SPIs when any SPI TXSIZE is
								changed.</description>
							<bitRange>[17:17]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:18]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<dim>2</dim>
					<dimIncrement>0x4</dimIncrement>
					<dimIndex>0-1</dimIndex>
					<name>FIFOCFGSPI%s</name>
					<description>FIFO configuration register for SPI0</description>
					<addressOffset>0x0210</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RXSIZE</name>
							<description>Configures the SPI receive FIFO size. A zero values
								provides no System FIFO service for the related SPI
								receiver.</description>
							<bitRange>[7:0]</bitRange>
						</field>
						<field>
							<name>TXSIZE</name>
							<description>Configures the SPI transmit FIFO size. A zero values
								provides no System FIFO service for the related SPI
								transmitter.</description>
							<bitRange>[15:8]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:16]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<dim>4</dim>
					<dimIncrement>0x100</dimIncrement>
					<dimIndex>0-3</dimIndex>
					<name>CFGUSART%s</name>
					<description>USART0 configuration</description>
					<addressOffset>0x1000</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[3:0]</bitRange>
						</field>
						<field>
							<name>TIMEOUTCONTONWRITE</name>
							<description>Timeout Continue On Write. When 0, the timeout for the
								related peripheral is reset every time data is transferred from the
								peripheral into the receive FIFO. When 1, the timeout for the
								related peripheral is not reset every time data is transferred into
								the receive FIFO. This allows the timeout to be applied to
								accumulated data, perhaps related to the FIFO
								threshold.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>TIMEOUTCONTONEMPTY</name>
							<description>Timeout Continue On Empty. When 0, the timeout for the
								related peripheral is reset when the receive FIFO becomes empty.
								When 1, the timeout for the related peripheral is not reset when the
								receive FIFO becomes empty. This allows the timeout to be used to
								flag idle peripherals, and could potentially be used to indicate the
								end of a transmission of indeterminate length.</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[7:6]</bitRange>
						</field>
						<field>
							<name>TIMEOUTBASE</name>
							<description>Specifies the least significant timer bit to compare to
								TimeoutValue. See Section 24.5.7.1 below. Value can be 0 through
								15.</description>
							<bitRange>[11:8]</bitRange>
						</field>
						<field>
							<name>TIMEOUTVALUE</name>
							<description>Specifies the maximum time value for timeout at the timer
								position identified by TimeoutBase. Minimum time TimeoutValue - 1.
								is See Section 24.5.7.1 below. TimeoutValue should not be 0 or 1
								when timeout is enabled.</description>
							<bitRange>[15:12]</bitRange>
						</field>
						<field>
							<name>RXTHRESHOLD</name>
							<description>Receive FIFO Threshold. The System FIFO indicates that the
								threshold has been reached when the number of entries in the receive
								FIFO is greater than this value. For example, when RxThreshold = 0,
								the threshold is exceeded when there is at least one entry in the
								receive FIFO. An interrupt can be generated when the RxThreshold has
								been reached (see Section 24.5.10), but has no effect on DMA
								requests, which are generated whenever the receiver FIFO is not
								empty.</description>
							<bitRange>[23:16]</bitRange>
						</field>
						<field>
							<name>TXTHRESHOLD</name>
							<description>Transmit FIFO Threshold. The System FIFO indicates that the
								threshold has been reached when the number of free entries in the
								transmit FIFO is less than or equal to this value. For example, when
								TxThreshold = 0, the threshold is exceeded when there is at least
								one free entry in the transmit FIFO. An interrupt can be generated
								when the TxThreshold has been reached (see Section 24.5.10), but has
								no effect on DMA requests, which are generated whenever the transmit
								FIFO has any free entries.</description>
							<bitRange>[31:24]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<dim>4</dim>
					<dimIncrement>0x100</dimIncrement>
					<dimIndex>0-3</dimIndex>
					<name>STATUSART%s</name>
					<description>USART0 status</description>
					<addressOffset>0x1004</addressOffset>
					<access>read-write</access>
					<resetValue>0x300</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RXTH</name>
							<description>Receive FIFO Threshold. When 1, the receive FIFO threshold
								has been reached. This is a read-only bit.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>TXTH</name>
							<description>Transmit FIFO Threshold. When 1, the transmit FIFO
								threshold has been reached. This is a read-only bit.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[3:2]</bitRange>
						</field>
						<field>
							<name>RXTIMEOUT</name>
							<description>Receive FIFO Timeout. When 1, the receive FIFO has timed
								out, based on the timeout configuration in the CFGUSART register.
								The timeout condition can be cleared by writing a 1 to this bit, by
								enabling or disabling the timeout interrupt, or by writing a 1 to
								the timeout interrupt enable.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[6:5]</bitRange>
						</field>
						<field>
							<name>BUSERR</name>
							<description>Bus Error. When 1, a bus error has occurred while
								processing data for USARTn. The bus error flag can be cleared by
								writing a 1 to this bit.</description>
							<bitRange>[7:7]</bitRange>
						</field>
						<field>
							<name>RXEMPTY</name>
							<description>Receive FIFO Empty. When 1, the receive FIFO is currently
								empty. This is a read-only bit.</description>
							<bitRange>[8:8]</bitRange>
						</field>
						<field>
							<name>TXEMPTY</name>
							<description>Transmit FIFO Empty. When 1, the transmit FIFO is currently
								empty. This is a read-only bit.</description>
							<bitRange>[9:9]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[15:10]</bitRange>
						</field>
						<field>
							<name>RXCOUNT</name>
							<description>Receive FIFO Count. Indicates how many entries may be read
								from the receive FIFO. 0 = FIFO empty. This is a read-only
								field.</description>
							<bitRange>[23:16]</bitRange>
						</field>
						<field>
							<name>TXCOUNT</name>
							<description>Transmit FIFO Count. Indicates how many entries may be
								written to the transmit FIFO. 0 = FIFO full. This is a read-only
								field that is valid only when the TxFIFO is fully configured and
								enabled.</description>
							<bitRange>[31:24]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<dim>4</dim>
					<dimIncrement>0x100</dimIncrement>
					<dimIndex>0-3</dimIndex>
					<name>INTSTATUSART%s</name>
					<description>USART0 interrupt status</description>
					<addressOffset>0x1008</addressOffset>
					<access>read-only</access>
					<resetValue>0x300</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RXTH</name>
							<description>Receive FIFO Threshold. When 1, the receive FIFO threshold
								has been reached, and the related interrupt is
								enabled.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>TXTH</name>
							<description>Transmit FIFO Threshold. When 1, the transmit FIFO
								threshold has been reached, and the related interrupt is
								enabled.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[3:2]</bitRange>
						</field>
						<field>
							<name>RXTIMEOUT</name>
							<description>Receive Timeout. When 1, the receive FIFO has timed out,
								based on the timeout configuration in the CFGUSART register, and the
								related interrupt is enabled.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[6:5]</bitRange>
						</field>
						<field>
							<name>BUSERR</name>
							<description>Bus Error. This is simply a copy of the same bit in the
								STATUSART register. The bus error interrupt is always
								enabled.</description>
							<bitRange>[7:7]</bitRange>
						</field>
						<field>
							<name>RXEMPTY</name>
							<description>Receive FIFO Empty. This is simply a copy of the same bit
								in the STATUSART register.</description>
							<bitRange>[8:8]</bitRange>
						</field>
						<field>
							<name>TXEMPTY</name>
							<description>Transmit FIFO Empty. This is simply a copy of the same bit
								in the STATUSART register.</description>
							<bitRange>[9:9]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[15:10]</bitRange>
						</field>
						<field>
							<name>RXCOUNT</name>
							<description>Receive FIFO Count. This is simply a copy of the same field
								in the STATUSART register, included here so an ISR can read all
								needed status information in one read.</description>
							<bitRange>[23:16]</bitRange>
						</field>
						<field>
							<name>TXCOUNT</name>
							<description>Transmit FIFO Available. This is simply a copy of the same
								field in the STATUSART register, included here so an ISR can read
								all needed status information in one read.</description>
							<bitRange>[31:24]</bitRange>
						</field>
					</fields>
				</register>
