cmsis-svd/cmsis-svd/data/NXP/LPC5410x_v0.4.svd
				<register>
					<dim>4</dim>
					<dimIncrement>0x100</dimIncrement>
					<dimIndex>0-3</dimIndex>
					<name>CTLSETUSART%s</name>
					<description>USART0 control read and set register. A complete value may be read
						from this register. Writing a 1 to any implemented bit position causes that
						bit to be set.</description>
					<addressOffset>0x100C</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RXTHINTEN</name>
							<description>Receive FIFO Threshold Interrupt Enable.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>TXTHINTEN</name>
							<description>Transmit FIFO Threshold Interrupt Enable.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[3:2]</bitRange>
						</field>
						<field>
							<name>RXTIMEOUTINTEN</name>
							<description>Receive FIFO Timeout Interrupt Enable. When enabled, this
								also enables the timeout for this USART. Writing a 1 to this bit
								resets the USART timeout logic.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[7:5]</bitRange>
						</field>
						<field>
							<name>RXFLUSH</name>
							<description>Receive FIFO flush. Writing a 1 to this bit forces the
								receive FIFO to be empty.</description>
							<bitRange>[8:8]</bitRange>
						</field>
						<field>
							<name>TXFLUSH</name>
							<description>Transmit FIFO flush. Writing a 1 to this bit forces the
								transmit FIFO to be empty.</description>
							<bitRange>[9:9]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:10]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<dim>4</dim>
					<dimIncrement>0x100</dimIncrement>
					<dimIndex>0-3</dimIndex>
					<name>CTLCLRUSART%s</name>
					<description>USART0 control clear register. Writing a 1 to any implemented bit
						position causes the corresponding bit in the related CTLSET register to be
						cleared.</description>
					<addressOffset>0x1010</addressOffset>
					<access>write-only</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>RXTHINTCLR</name>
							<description>Receive FIFO Threshold Interrupt clear.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>TXTHINTCLR</name>
							<description>Transmit FIFO Threshold Interrupt clear.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[3:2]</bitRange>
						</field>
						<field>
							<name>RXTIMEOUTINTCLR</name>
							<description>Receive FIFO Time-out Interrupt clear.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[7:5]</bitRange>
						</field>
						<field>
							<name>RXFLUSHCLR</name>
							<description>Receive FIFO flush clear.</description>
							<bitRange>[8:8]</bitRange>
						</field>
						<field>
							<name>TXFLUSHCLR</name>
							<description>Transmit FIFO flush clear.</description>
							<bitRange>[9:9]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:10]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<dim>4</dim>
					<dimIncrement>0x100</dimIncrement>
					<dimIndex>0-3</dimIndex>
					<name>RXDATUSART%s</name>
					<description>USART0 received data</description>
					<addressOffset>0x1014</addressOffset>
					<access>read-only</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>RXDAT</name>
							<description>The UART Receiver Data register contains the next received
								character. The number of bits that are relevant depends on the UART
								configuration settings.</description>
							<bitRange>[8:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, the value read from a reserved bit is not
								defined.</description>
							<bitRange>[31:9]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<dim>4</dim>
					<dimIncrement>0x100</dimIncrement>
					<dimIndex>0-3</dimIndex>
					<name>RXDATSTATUSART%s</name>
					<description>USART0 received data with status</description>
					<addressOffset>0x1018</addressOffset>
					<access>read-only</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>RXDAT</name>
							<description>The UART Receiver Data register contains the next received
								character. The number of bits that are relevant depends on the UART
								configuration settings.</description>
							<bitRange>[8:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, the value read from a reserved bit is not
								defined.</description>
							<bitRange>[12:9]</bitRange>
						</field>
						<field>
							<name>FRAMERR</name>
							<description>Framing Error status flag. This bit is valid when there is
								a character to be read in the RXDAT register and reflects the status
								of that character. This bit will set when the character in RXDAT was
								received with a missing stop bit at the expected location. This
								could be an indication of a baud rate or configuration mismatch with
								the transmitting source.</description>
							<bitRange>[13:13]</bitRange>
						</field>
						<field>
							<name>PARITYERR</name>
							<description>Parity Error status flag. This bit is valid when there is a
								character to be read in the RXDAT register and reflects the status
								of that character. This bit will be set when a parity error is
								detected in a received character.</description>
							<bitRange>[14:14]</bitRange>
						</field>
						<field>
							<name>RXNOISE</name>
							<description>Received Noise flag.</description>
							<bitRange>[15:15]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, the value read from a reserved bit is not
								defined.</description>
							<bitRange>[31:16]</bitRange>
						</field>
					</fields>
				</register>

				<register>
					<dim>4</dim>
					<dimIncrement>0x100</dimIncrement>
					<dimIndex>0-3</dimIndex>
					<name>TXDATUSART%s</name>
					<description>USART0 transmit data</description>
					<addressOffset>0x101C</addressOffset>
					<access>write-only</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>TXDAT</name>
							<description>Writing to the UART Transmit Data Register causes the data
								to be transmitted as soon as the transmit shift register is
								available and the condition for transmitting data is met: TXDIS bit
								= 0.</description>
							<bitRange>[8:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Only zero should be written.</description>
							<bitRange>[31:9]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<dim>2</dim>
					<dimIncrement>0x100</dimIncrement>
					<dimIndex>0-1</dimIndex>
					<name>CFGSPI%s</name>
					<description>SPI0 configuration</description>
					<addressOffset>0x2000</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[3:0]</bitRange>
						</field>
						<field>
							<name>TIMEOUTCONTONWRITE</name>
							<description>Timeout Continue On Write. When 0, the timeout for the
								related peripheral is reset every time data is transferred from the
								peripheral into the receive FIFO. When 1, the timeout for the
								related peripheral is not reset every time data is transferred into
								the receive FIFO. This allows the timeout to be applied to
								accumulated data, perhaps related to the FIFO
								threshold.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>TIMEOUTCONTONEMPTY</name>
							<description>Timeout Continue On Empty. When 0, the timeout for the
								related peripheral is reset when the receive FIFO becomes empty.
								When 1, the timeout for the related peripheral is not reset when the
								receive FIFO becomes empty. This allows the timeout to be used to
								flag idle peripherals, and could potentially be used to indicate the
								end of a transmission of indeterminate length.</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[7:6]</bitRange>
						</field>
						<field>
							<name>TIMEOUTBASE</name>
							<description>Specifies the least significant timer bit to compare to
								TimeoutValue. Value can be 0 through 15.</description>
							<bitRange>[11:8]</bitRange>
						</field>
						<field>
							<name>TIMEOUTVALUE</name>
							<description>Specifies the maximum time value for timeout at the timer
								position identified by TimeoutBase. Minimum time TimeoutValue - 1.
								TimeoutValue should not be 0 or 1 when timeout is
								enabled.</description>
							<bitRange>[15:12]</bitRange>
						</field>
						<field>
							<name>RXTHRESHOLD</name>
							<description>Receive FIFO Threshold. The System FIFO indicates that the
								threshold has been reached when the number of entries in the receive
								FIFO is greater than this value. For example, when RxThreshold = 0,
								the threshold is exceeded when there is at least one entry in the
								receive FIFO. An interrupt can be generated when the RxThreshold has
								been reached, but has no effect on DMA requests, which are generated
								whenever the receiver FIFO is not empty.</description>
							<bitRange>[23:16]</bitRange>
						</field>
						<field>
							<name>TXTHRESHOLD</name>
							<description>Transmit FIFO Threshold. The System FIFO indicates that the
								threshold has been reached when the number of free entries in the
								transmit FIFO is less than or equal to this value. For example, when
								TxThreshold = 0, the threshold is exceeded when there is at least
								one free entry in the transmit FIFO. An interrupt can be generated
								when the TxThreshold has been reached, but has no effect on DMA
								requests, which are generated whenever the transmit FIFO has any
								free entries.</description>
							<bitRange>[31:24]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<dim>2</dim>
					<dimIncrement>0x100</dimIncrement>
					<dimIndex>0-1</dimIndex>
					<name>STATSPI%s</name>
					<description>SPI0 status</description>
					<addressOffset>0x2004</addressOffset>
					<access>read-write</access>
					<resetValue>0x300</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RXTH</name>
							<description>Receive FIFO Threshold. When 1, the receive FIFO threshold
								has been reached. This is a read-only bit.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>TXTH</name>
							<description>Transmit FIFO Threshold. When 1, the transmit FIFO
								threshold has been reached. This is a read-only bit.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[3:2]</bitRange>
						</field>
						<field>
							<name>RXTIMEOUT</name>
							<description>Receive FIFO Timeout. When 1, the receive FIFO has timed
								out, based on the timeout configuration in the CFGSPI register. The
								timeout condition can be cleared by writing a 1 to this bit, by
								enabling or disabling the timeout interrupt, or by writing a 1 to
								the timeout interrupt enable.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[6:5]</bitRange>
						</field>
						<field>
							<name>BUSERR</name>
							<description>Bus Error. When 1, a bus error has occurred while
								processing data for SPI. The bus error flag can be cleared by
								writing a 1 to this bit.</description>
							<bitRange>[7:7]</bitRange>
						</field>
						<field>
							<name>RXEMPTY</name>
							<description>Receive FIFO Empty. When 1, the receive FIFO is currently
								empty. This is a read-only bit.</description>
							<bitRange>[8:8]</bitRange>
						</field>
						<field>
							<name>TXEMPTY</name>
							<description>Transmit FIFO Empty. When 1, the transmit FIFO is currently
								empty. This is a read-only bit.</description>
							<bitRange>[9:9]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[15:10]</bitRange>
						</field>
						<field>
							<name>RXCOUNT</name>
							<description>Receive FIFO Count. Indicates how many entries may be read
								from the receive FIFO. 0 = FIFO empty. This is a read-only
								field.</description>
							<bitRange>[23:16]</bitRange>
						</field>
						<field>
							<name>TXCOUNT</name>
							<description>Transmit FIFO Count. Indicates how many entries may be
								written to the transmit FIFO. 0 = FIFO full. This is a read-only
								field that is valid only when the TxFIFO is fully configured and
								enabled.</description>
							<bitRange>[31:24]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<dim>2</dim>
					<dimIncrement>0x100</dimIncrement>
					<dimIndex>0-1</dimIndex>
					<name>INTSTATSPI%s</name>
					<description>SPI0 interrupt status</description>
					<addressOffset>0x2008</addressOffset>
					<access>read-only</access>
					<resetValue>0x300</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RXTH</name>
							<description>Receive FIFO Threshold. When 1, the receive FIFO threshold
								has been reached, and the related interrupt is
								enabled.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>TXTH</name>
							<description>Transmit FIFO Threshold. When 1, the transmit FIFO
								threshold has been reached, and the related interrupt is
								enabled.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[3:2]</bitRange>
						</field>
						<field>
							<name>RXTIMEOUT</name>
							<description>Receive Timeout. When 1, the receive FIFO has timed out,
								based on the timeout configuration in the CFGSPI register, and the
								related interrupt is enabled.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[6:5]</bitRange>
						</field>
						<field>
							<name>BUSERR</name>
							<description>Bus Error. This is simply a copy of the same bit in the
								STATSPI register. The bus error interrupt is always
								enabled.</description>
							<bitRange>[7:7]</bitRange>
						</field>
						<field>
							<name>RXEMPTY</name>
							<description>Receive FIFO Empty. This is simply a copy of the same bit
								in the STATSPI register.</description>
							<bitRange>[8:8]</bitRange>
						</field>
						<field>
							<name>TXEMPTY</name>
							<description>Transmit FIFO Empty. This is simply a copy of the same bit
								in the STATSPI register.</description>
							<bitRange>[9:9]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[15:10]</bitRange>
						</field>
						<field>
							<name>RXCOUNT</name>
							<description>Receive FIFO Count. This is simply a copy of the same field
								in the STATSPI register, included here so an ISR can read all needed
								status information in one read.</description>
							<bitRange>[23:16]</bitRange>
						</field>
						<field>
							<name>TXCOUNT</name>
							<description>Transmit FIFO Available. This is simply a copy of the same
								field in the STATSPI register, included here so an ISR can read all
								needed status information in one read.</description>
							<bitRange>[31:24]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<dim>2</dim>
					<dimIncrement>0x100</dimIncrement>
					<dimIndex>0-1</dimIndex>
					<name>CTLSETSPI%s</name>
					<description>SPI0 control read and set register. A complete value may be read
						from this register. Writing a 1 to any implemented bit position causes that
						bit to be set.</description>
					<addressOffset>0x200C</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RXTHINTEN</name>
							<description>Receive FIFO Threshold Interrupt Enable.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>TXTHINTEN</name>
							<description>Transmit FIFO Threshold Interrupt Enable.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[3:2]</bitRange>
						</field>
						<field>
							<name>RXTIMEOUTINTEN</name>
							<description>Receive FIFO Timeout Interrupt Enable. When enabled, this
								also enables the timeout for this SPI. Writing a 1 to this bit
								resets the SPI timeout logic.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[7:5]</bitRange>
						</field>
						<field>
							<name>RXFLUSH</name>
							<description>Receive FIFO flush. Writing a 1 to this bit forces the
								receive FIFO to be empty.</description>
							<bitRange>[8:8]</bitRange>
						</field>
						<field>
							<name>TXFLUSH</name>
							<description>Transmit FIFO flush. Writing a 1 to this bit forces the
								transmit FIFO to be empty.</description>
							<bitRange>[9:9]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:10]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<dim>2</dim>
					<dimIncrement>0x100</dimIncrement>
					<dimIndex>0-1</dimIndex>
					<name>CTLCLRSPI%s</name>
					<description>SPI0 control clear register. Writing a 1 to any implemented bit
						position causes the corresponding bit in the related CTLSET register to be
						cleared.</description>
					<addressOffset>0x2010</addressOffset>
					<access>write-only</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Writing ones to this register clears the corresponding bit
								or bits in the CTLSETSPI register, if they are implemented. Bits
								that do not correspond to defined bits in CTLSETSPI are reserved and
								only zeroes should be written to them.</description>
							<bitRange>[31:0]</bitRange>
						</field>
						<field>
							<name>RXTHINTCLR</name>
							<description>Receive FIFO Threshold Interrupt clear.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>TXTHINTCLR</name>
							<description>Transmit FIFO Threshold Interrupt clear.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[3:2]</bitRange>
						</field>
						<field>
							<name>RXTIMEOUTINTCLR</name>
							<description>Receive FIFO Timeout Interrupt clear.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[7:5]</bitRange>
						</field>
						<field>
							<name>RXFLUSHCLR</name>
							<description>Receive FIFO flush clear. do the clear bits 8 and 9 do
								anything?</description>
							<bitRange>[8:8]</bitRange>
						</field>
						<field>
							<name>TXFLUSHCLR</name>
							<description>Transmit FIFO flush clear.</description>
							<bitRange>[9:9]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:10]</bitRange>
						</field>
					</fields>
				</register>
