cmsis-svd/cmsis-svd/data/NXP/LPC5410x_v0.4.svd
				<register>
					<dim>2</dim>
					<dimIncrement>0x100</dimIncrement>
					<dimIndex>0-1</dimIndex>
					<name>RXDATSPI%s</name>
					<description>SPI0 received data. These registers are half word
						addressable.</description>
					<addressOffset>0x2014</addressOffset>
					<access>read-only</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>RXDAT</name>
							<description>Receiver Data. This contains the next piece of received
								data. The number of bits that are used depends on the LEN setting in
								TXCTL / TXDATCTL.</description>
							<bitRange>[15:0]</bitRange>
						</field>
						<field>
							<name>RXSSEL0_N</name>
							<description>Slave Select for receive. This field allows the state of
								the SSEL0 pin to be saved along with received data. The value will
								reflect the SSEL0 pin for both master and slave operation. A zero
								indicates that a slave select is active. The actual polarity of each
								slave select pin is configured by the related SPOL bit in
								CFG.</description>
							<bitRange>[16:16]</bitRange>
						</field>
						<field>
							<name>RXSSEL1_N</name>
							<description>Slave Select for receive. This field allows the state of
								the SSEL1 pin to be saved along with received data. The value will
								reflect the SSEL1 pin for both master and slave operation. A zero
								indicates that a slave select is active. The actual polarity of each
								slave select pin is configured by the related SPOL bit in
								CFG.</description>
							<bitRange>[17:17]</bitRange>
						</field>
						<field>
							<name>RXSSEL2_N</name>
							<description>Slave Select for receive. This field allows the state of
								the SSEL2 pin to be saved along with received data. The value will
								reflect the SSEL2 pin for both master and slave operation. A zero
								indicates that a slave select is active. The actual polarity of each
								slave select pin is configured by the related SPOL bit in
								CFG.</description>
							<bitRange>[18:18]</bitRange>
						</field>
						<field>
							<name>RXSSEL3_N</name>
							<description>Slave Select for receive. This field allows the state of
								the SSEL3 pin to be saved along with received data. The value will
								reflect the SSEL3 pin for both master and slave operation. A zero
								indicates that a slave select is active. The actual polarity of each
								slave select pin is configured by the related SPOL bit in
								CFG.</description>
							<bitRange>[19:19]</bitRange>
						</field>
						<field>
							<name>SOT</name>
							<description>Start of Transfer flag. This flag will be 1 if this is the
								first data after the SSELs went from deasserted to asserted (i.e.,
								any previous transfer has ended). This information can be used to
								identify the first piece of data in cases where the transfer length
								is greater than 16 bit.</description>
							<bitRange>[20:20]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, the value read from a reserved bit is not
								defined.</description>
							<bitRange>[31:21]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<dim>2</dim>
					<dimIncrement>0x100</dimIncrement>
					<dimIndex>0-1</dimIndex>
					<name>TXDATSPI%s</name>
					<description>SPI0 transmit data. These registers are half word
						addressable.</description>
					<addressOffset>0x2018</addressOffset>
					<access>write-only</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>TXDAT</name>
							<description>Transmit Data. This field provides from 1 to 16 bits of
								data to be transmitted.</description>
							<bitRange>[15:0]</bitRange>

						</field>
						<field>
							<name>TXSSEL0_N</name>
							<description>Transmit Slave Select. This field asserts SSEL0 in master
								mode. The output on the pin is active LOW by default. The active
								state of the SSEL0 pin is configured by bits in the CFG
								register.</description>
							<bitRange>[16:16]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>ASSERTED</name>
									<description>Asserted. SSEL0 asserted.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>NOT_ASSERTED</name>
									<description>Not asserted. SSEL0 not asserted.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TXSSEL1_N</name>
							<description>Transmit Slave Select. This field asserts SSEL1 in master
								mode. The output on the pin is active LOW by default. The active
								state of the SSEL1 pin is configured by bits in the CFG
								register.</description>
							<bitRange>[17:17]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>ASSERTED</name>
									<description>Asserted. SSEL1 asserted.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>NOT_ASSERTED</name>
									<description>Not asserted. SSEL1 not asserted.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TXSSEL2_N</name>
							<description>Transmit Slave Select. This field asserts SSEL2 in master
								mode. The output on the pin is active LOW by default. The active
								state of the SSEL2 pin is configured by bits in the CFG
								register.</description>
							<bitRange>[18:18]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>ASSERTED</name>
									<description>Asserted. SSEL2 asserted.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>NOT_ASSERTED</name>
									<description>Not asserted. SSEL2 not asserted.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TXSSEL3_N</name>
							<description>Transmit Slave Select. This field asserts SSEL3 in master
								mode. The output on the pin is active LOW by default. The active
								state of the SSEL3 pin is configured by bits in the CFG
								register.</description>
							<bitRange>[19:19]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>ASSERTED</name>
									<description>Asserted. SSEL3 asserted.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>NOT_ASSERTED</name>
									<description>Not asserted. SSEL3 not asserted.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EOT</name>
							<description>End of Transfer. The asserted SSEL will be deasserted at
								the end of a transfer, and remain so for at least the time specified
								by the Transfer_delay value in the DLY register.</description>
							<bitRange>[20:20]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NOT_DEASSERTED</name>
									<description>Not deasserted. SSEL not deasserted. This piece of
										data is not treated as the end of a transfer. SSEL will not
										be deasserted at the end of this data.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DEASSERTED</name>
									<description>Deasserted. SSEL deasserted. This piece of data is
										treated as the end of a transfer. SSEL will be deasserted at
										the end of this piece of data.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EOF</name>
							<description>End of Frame. Between frames, a delay may be inserted, as
								defined by the FRAME_DELAY value in the DLY register. The end of a
								frame may not be particularly meaningful if the FRAME_DELAY value =
								0. This control can be used as part of the support for frame lengths
								greater than 16 bits.</description>
							<bitRange>[21:21]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DATA_NOT_EOF</name>
									<description>Data not EOF. This piece of data transmitted is not
										treated as the end of a frame.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DATA_EOF</name>
									<description>Data EOF. This piece of data is treated as the end
										of a frame, causing the FRAME_DELAY time to be inserted
										before subsequent data is transmitted.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RXIGNORE</name>
							<description>Receive Ignore. This allows data to be transmitted using
								the SPI without the need to read unneeded data from the receiver to
								simplify the transmit process and can be used with the
								DMA.</description>
							<bitRange>[22:22]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>READ_RECEIVED_DATA</name>
									<description>Read received data. Received data must be read in
										order to allow transmission to progress. In slave mode, an
										overrun error will occur if received data is not read before
										new data is received.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>IGNORE_RECEIVED_DATA</name>
									<description>Ignore received data. Received data is ignored,
										allowing transmission without reading unneeded received
										data. No receiver flags are generated.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[23:23]</bitRange>

