cmsis-svd/cmsis-svd/data/NXP/LPC5410x_v0.4.svd
						</field>
						<field>
							<name>LEN</name>
							<description>Data Length. Specifies the data length from 1 to 16 bits.
								Note that transfer lengths greater than 16 bits are supported by
								implementing multiple sequential data transmits. 0x0 = Data transfer
								is 1 bit in length. 0x1 = Data transfer is 2 bits in length. 0x2 =
								Data transfer is 3 bits in length. ... 0xF = Data transfer is 16
								bits in length.</description>
							<bitRange>[27:24]</bitRange>

						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:28]</bitRange>

						</field>
					</fields>
				</register>
			</registers>


		</peripheral>


		<peripheral>
			<name>SYSCON</name>
			<description>System configuration</description>
			<groupName>SYSCON</groupName>
			<baseAddress>0x40000000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x1000</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>SYSMEMREMAP</name>
					<description>System memory remap</description>
					<addressOffset>0x000</addressOffset>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>MAP</name>
							<description>System memory remap. Value 0x3 is reserved.</description>
							<bitRange>[1:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>BOOT_LOADER_MODE</name>
									<description>Boot Loader Mode. Interrupt vectors are re-mapped
										to Boot ROM.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>USER_RAM_MODE</name>
									<description>User RAM Mode. Interrupt vectors are re-mapped to
										Static RAM.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>USER_FLASH_MODE</name>
									<description>User Flash Mode. Interrupt vectors are not
										re-mapped and reside in Flash.</description>
									<value>0x2</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:2]</bitRange>

						</field>
					</fields>
				</register>
				<register>
					<name>AHBMATPRIO</name>
					<description>AHB multilayer matrix priority control</description>
					<addressOffset>0x004</addressOffset>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>PRI_ICODE</name>
							<description>I-Code bus priority. Should be lower than PRI_DCODE for
								proper operation.</description>
							<bitRange>[1:0]</bitRange>
						</field>
						<field>
							<name>PRI_DCODE</name>
							<description>D-Code bus priority.</description>
							<bitRange>[3:2]</bitRange>
						</field>
						<field>
							<name>PRI_SYS</name>
							<description>System bus priority.</description>
							<bitRange>[5:4]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written..</description>
							<bitRange>[7:6]</bitRange>
						</field>
						<field>
							<name>PRI_DMA</name>
							<description>DMA controller priority.</description>
							<bitRange>[9:8]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written..</description>
							<bitRange>[13:10]</bitRange>
						</field>
						<field>
							<name>PRI_FIFO</name>
							<description>System FIFO bus priority</description>
							<bitRange>[15:14]</bitRange>
						</field>
						<field>
							<name>PRI_M0</name>
							<description>Cortex-M0+ bus priority.</description>
							<bitRange>[17:16]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written..</description>
							<bitRange>[31:18]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>SYSTCKCAL</name>
					<description>System tick counter calibration</description>
					<addressOffset>0x014</addressOffset>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CAL</name>
							<description>System tick timer calibration value.</description>
							<bitRange>[23:0]</bitRange>
						</field>
						<field>
							<name>SKEW</name>
							<description>Initial value for the Systick timer.</description>
							<bitRange>[24:24]</bitRange>
						</field>
						<field>
							<name>NOREF</name>
							<description>Initial value for the Systick timer.</description>
							<bitRange>[25:25]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[31:26]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>NMISRC</name>
					<description>NMI Source Select</description>
					<addressOffset>0x01C</addressOffset>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>IRQM4</name>
							<description>The IRQ number of the interrupt that acts as the
								Non-Maskable Interrupt (NMI) for the Cortex-M4, if enabled by
								NMIENM4.</description>
							<bitRange>[5:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[7:6]</bitRange>
						</field>
						<field>
							<name>IRQM0</name>
							<description>The IRQ number of the interrupt that acts as the
								Non-Maskable Interrupt (NMI) for the Cortex-M0+, if enabled by
								NMIENM0.</description>
							<bitRange>[13:8]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[29:14]</bitRange>
						</field>
						<field>
							<name>NMIENM0</name>
							<description>Write a 1 to this bit to enable the Non-Maskable Interrupt
								(NMI) source selected by IRQM0.</description>
							<bitRange>[30:30]</bitRange>
						</field>
						<field>
							<name>NMIENM4</name>
							<description>Write a 1 to this bit to enable the Non-Maskable Interrupt
								(NMI) source selected by IRQM4.</description>
							<bitRange>[31:31]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>ASYNCAPBCTRL</name>
					<description>Asynchronous APB Control</description>
					<addressOffset>0x020</addressOffset>
					<access>read-write</access>
					<resetValue>0x1</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>ENABLE</name>
							<description>Enables the asynchronous APB bridge and
								subsystem.</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled. Asynchronous APB bridge is
										disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enabled. Asynchronous APB bridge is
										enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written..</description>
							<bitRange>[31:1]</bitRange>

