cmsis-svd/cmsis-svd/data/NXP/LPC5410x_v0.4.svd
						</field>
					</fields>
				</register>
				<register>
					<name>SYSRSTSTAT</name>
					<description>System reset status register</description>
					<addressOffset>0x040</addressOffset>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>POR</name>
							<description>POR reset status</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NO_POR_DETECTED</name>
									<description>No POR detected</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>POR_DETECTED</name>
									<description>POR detected. Writing a one clears this
										reset.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EXTRST</name>
							<description>Status of the external RESET pin. External reset
								status.</description>
							<bitRange>[1:1]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NO_RESET_EVENT_DETEC</name>
									<description>No reset event detected.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RESET_DETECTED</name>
									<description>Reset detected. Writing a one clears this
										reset.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WDT</name>
							<description>Status of the Watchdog reset</description>
							<bitRange>[2:2]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NO_WDT_RESET_DETECTE</name>
									<description>No WDT reset detected</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>WDT_RESET_DETECTED</name>
									<description>WDT reset detected. Writing a one clears this
										reset.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BOD</name>
							<description>Status of the Brown-out detect reset</description>
							<bitRange>[3:3]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NO_BOD_RESET_DETECTE</name>
									<description>No BOD reset detected</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>BOD_RESET_DETECTED</name>
									<description>BOD reset detected. Writing a one clears this
										reset.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SYSRST</name>
							<description>Status of the software system reset</description>
							<bitRange>[4:4]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NO_SYSTEM_RESET_DETE</name>
									<description>No System reset detected</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SYSTEM_RESET_DETECTE</name>
									<description>System reset detected. Writing a one clears this
										reset.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:5]</bitRange>

						</field>
					</fields>
				</register>
				<register>
					<name>PRESETCTRL0</name>
					<description>Peripheral reset control 0</description>
					<addressOffset>0x044</addressOffset>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[6:0]</bitRange>
						</field>
						<field>
							<name>FLASH_RST</name>
							<description>Flash controller reset control. 0 = Clear reset to this
								function. 1 = Assert reset to this function.</description>
							<bitRange>[7:7]</bitRange>
						</field>
						<field>
							<name>FMC_RST</name>
							<description>Flash accelerator reset control. 0 = Clear reset to this
								function. 1 = Assert reset to this function.</description>
							<bitRange>[8:8]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[10:9]</bitRange>
						</field>
						<field>
							<name>MUX_RST</name>
							<description>Input mux reset control. 0 = Clear reset to this function.
								1 = Assert reset to this function.</description>
							<bitRange>[11:11]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[12:12]</bitRange>
						</field>
						<field>
							<name>IOCON_RST</name>
							<description>IOCON reset control. 0 = Clear reset to this function. 1 =
								Assert reset to this function.</description>
							<bitRange>[13:13]</bitRange>
						</field>
						<field>
							<name>GPIO0_RST</name>
							<description>GPIO0 reset control. 0 = Clear reset to this function. 1 =
								Assert reset to this function.</description>
							<bitRange>[14:14]</bitRange>
						</field>
						<field>
							<name>GPIO1_RST</name>
							<description>GPIO1 reset control. 0 = Clear reset to this function. 1 =
								Assert reset to this function.</description>
							<bitRange>[15:15]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[17:16]</bitRange>
						</field>
						<field>
							<name>PINT_RST</name>
							<description>Pin interrupt (PINT) reset control. 0 = Clear reset to this
								function. 1 = Assert reset to this function.</description>
							<bitRange>[18:18]</bitRange>
						</field>
						<field>
							<name>GINT_RST</name>
							<description>Grouped interrupt (GINT) reset control. 0 = Clear reset to
								this function. 1 = Assert reset to this function.</description>
							<bitRange>[19:19]</bitRange>
						</field>
						<field>
							<name>DMA_RST</name>
							<description>DMA reset control. 0 = Clear reset to this function. 1 =
								Assert reset to this function.</description>
							<bitRange>[20:20]</bitRange>
						</field>
						<field>
							<name>CRC_RST</name>
							<description>CRC generator reset control. 0 = Clear reset to this
								function. 1 = Assert reset to this function.</description>
							<bitRange>[21:21]</bitRange>
						</field>
						<field>
							<name>WWDT_RST</name>
							<description>Watchdog timer reset control. 0 = Clear reset to this
								function. 1 = Assert reset to this function.</description>
							<bitRange>[22:22]</bitRange>
						</field>
						<field>
							<name>RTC_RST</name>
							<description>RTC reset control. 0 = Clear reset to this function. 1 =
								Assert reset to this function.</description>
							<bitRange>[23:23]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[25:24]</bitRange>
						</field>
						<field>
							<name>MAILBOX_RST</name>
							<description>Mailbox reset control. 0 = Clear reset to this function. 1
								= Assert reset to this function.</description>
							<bitRange>[26:26]</bitRange>
						</field>
						<field>
							<name>ADC0_RST</name>
							<description>ADC0 reset control. 0 = Clear reset to this function. 1 =
								Assert reset to this function.</description>
							<bitRange>[27:27]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:28]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>PRESETCTRL1</name>
					<description>Peripheral reset control 1</description>
					<addressOffset>0x048</addressOffset>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>MRT_RST</name>
							<description>Multi-rate timer (MRT) reset control. 0 = Clear reset to
								this function. 1 = Assert reset to this function.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>RIT_RST</name>
							<description>Repetitive interrupt timer (RIT) reset control. 0 = Clear
								reset to this function. 1 = Assert reset to this
								function.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>SCT0_RST</name>
							<description>State configurable timer 0 (SCT0) reset control. 0 = Clear
								reset to this function. 1 = Assert reset to this
								function.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[8:3]</bitRange>
						</field>
						<field>
							<name>FIFO_RST</name>
							<description>System FIFO reset control. 0 = Clear reset to this
								function. 1 = Assert reset to this function.</description>
							<bitRange>[9:9]</bitRange>
						</field>
						<field>
							<name>UTICK_RST</name>
							<description>Micro-tick Timer reset control. 0 = Clear reset to this
								function. 1 = Assert reset to this function.</description>
							<bitRange>[10:10]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[21:11]</bitRange>
						</field>
						<field>
							<name>TIMER2_RST</name>
							<description>Timer 2 reset control. 0 = Clear reset to this function. 1
								= Assert reset to this function.</description>
							<bitRange>[22:22]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[25:23]</bitRange>
						</field>
						<field>
							<name>TIMER3_RST</name>
							<description>Timer 3 reset control. 0 = Clear reset to this function. 1
								= Assert reset to this function.</description>
							<bitRange>[26:26]</bitRange>
						</field>
						<field>
							<name>TIMER4_RST</name>
							<description>Timer 4 reset control. 0 = Clear reset to this function. 1
								= Assert reset to this function.</description>
							<bitRange>[27:27]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:28]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>PRESETCTRLSET0</name>
					<description>Set bits in PRESETCTRL0</description>
					<addressOffset>0x04C</addressOffset>
					<access>write-only</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>RST_SET0</name>
							<description>Writing ones to this register sets the corresponding bit or
								bits in the PRESETCTRL0 register, if they are implemented. Bits that
								do not correspond to defined bits in PRESETCTRL0 are reserved and
								only zeroes should be written to them.</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>PRESETCTRLSET1</name>
					<description>Set bits in PRESETCTRL1</description>
					<addressOffset>0x050</addressOffset>
					<access>write-only</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>RST_SET1</name>
							<description>Writing ones to this register sets the corresponding bit or
								bits in the PRESETCTRL1 register, if they are implemented. Bits that
								do not correspond to defined bits in PRESETCTRL1 are reserved and
								only zeroes should be written to them.</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>PRESETCTRLCLR0</name>
					<description>Clear bits in PRESETCTRL0</description>
					<addressOffset>0x054</addressOffset>
					<access>write-only</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>RST_CLR0</name>
							<description>Writing ones to this register clears the corresponding bit
								or bits in the PRESETCTRL0 register, if they are implemented. Bits
								that do not correspond to defined bits in PRESETCTRL0 are reserved
								and only zeroes should be written to them.</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>PRESETCTRLCLR1</name>
					<description>Clear bits in PRESETCTRL1</description>
					<addressOffset>0x058</addressOffset>
					<access>write-only</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>RST_CLR1</name>
							<description>Writing ones to this register clears the corresponding bit
								or bits in the PRESETCTRL1 register, if they are implemented. Bits
								that do not correspond to defined bits in PRESETCTRL1 are reserved
								and only zeroes should be written to them.</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>PIOPORCAP0</name>
					<description>POR captured PIO status 0</description>
					<addressOffset>0x05C</addressOffset>
					<access>read-only</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>PIOPORSTAT</name>
							<description>State of PIO0_31 through PIO0_0 at power-on
								reset</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>PIOPORCAP1</name>
					<description>POR captured PIO status 1</description>
					<addressOffset>0x060</addressOffset>
					<access>read-only</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>PIOPORSTAT</name>
							<description>State of PIO1_31 through PIO1_0 at power-on
								reset</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>PIORESCAP0</name>
					<description>Reset captured PIO status 0</description>
					<addressOffset>0x068</addressOffset>
					<access>read-only</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>PIORESSTAT</name>
							<description>State of PIO0_31 through PIO0_0 for resets other than
								power-on reset.</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>PIORESCAP1</name>
					<description>Reset captured PIO status 1</description>
					<addressOffset>0x06C</addressOffset>
					<access>read-only</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>PIORESSTAT</name>
							<description>State of PIO1_31 through PIO1_0 for resets other than
								power-on reset.</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>MAINCLKSELA</name>
					<description>Main clock source select A</description>
					<addressOffset>0x080</addressOffset>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SEL</name>
							<description>Clock source for main clock source selector A</description>
							<bitRange>[1:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>IRC_OSCILLATOR</name>
									<description>IRC Oscillator</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CLKIN</name>
									<description>CLKIN</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>WATCHDOG_OSCILLATOR</name>
									<description>Watchdog oscillator</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RESERVED</name>
									<description>Reserved</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:2]</bitRange>

