cmsis-svd/cmsis-svd/data/NXP/LPC5410x_v0.4.svd
						</field>
					</fields>
				</register>
				<register>
					<name>MAINCLKSELB</name>
					<description>Main clock source select B</description>
					<addressOffset>0x084</addressOffset>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SEL</name>
							<description>Clock source for main clock source selector B. Selects the
								clock source for the main clock.</description>
							<bitRange>[1:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>MAINCLKSELA</name>
									<description>MAINCLKSELA. Use the clock source selected in
										MAINCLKSELA register.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SYSTEM_PLL_INPUT</name>
									<description>System PLL input.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SYSTEM_PLL_OUTPUT</name>
									<description>System PLL output.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RTC_OSC_OUTPUT</name>
									<description>RTC osc output. RTC oscillator 32 kHz
										output.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:2]</bitRange>

						</field>
					</fields>
				</register>
				<register>
					<name>ADCCLKSEL</name>
					<description>ADC clock source select</description>
					<addressOffset>0x08C</addressOffset>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SEL</name>
							<description>ADC clock source.</description>
							<bitRange>[1:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>MAIN_CLOCK</name>
									<description>Main clock</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SYSTEM_PLL_OUTPUT</name>
									<description>System PLL output</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>IRC_OSCILLATOR</name>
									<description>IRC Oscillator</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RESERVED</name>
									<description>reserved</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:2]</bitRange>

						</field>
					</fields>
				</register>
				<register>
					<name>CLKOUTSELA</name>
					<description>CLKOUT clock source select A</description>
					<addressOffset>0x094</addressOffset>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SEL</name>
							<description>CLKOUT clock source</description>
							<bitRange>[1:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>MAIN_CLOCK</name>
									<description>Main clock</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CLKIN</name>
									<description>CLKIN</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>WATCHDOG_OSCILLATOR</name>
									<description>Watchdog oscillator</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>IRC_OSCILLATOR</name>
									<description>IRC oscillator</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:2]</bitRange>

						</field>
					</fields>
				</register>
				<register>
					<name>CLKOUTSELB</name>
					<description>CLKOUT clock source select B</description>
					<addressOffset>0x098</addressOffset>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SEL</name>
							<description>CLKOUT clock source</description>
							<bitRange>[1:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>CLKOUTSELA</name>
									<description>CLKOUTSELA. Clock source selected in the CLKOUTSELA
										register.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RESERVED</name>
									<description>reserved</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RESERVED</name>
									<description>reserved</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RTC_32_KHZ_CLOCK</name>
									<description>RTC 32 kHz clock</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:2]</bitRange>

						</field>
					</fields>
				</register>
				<register>
					<name>SYSPLLCLKSEL</name>
					<description>PLL clock source select</description>
					<addressOffset>0x0A0</addressOffset>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SEL</name>
							<description>System PLL clock source</description>
							<bitRange>[1:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>IRC_OSCILLATOR</name>
									<description>IRC Oscillator</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CLKIN</name>
									<description>CLKIN</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>WATCHDOG_OSCILLATOR</name>
									<description>Watchdog oscillator</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RTC_32_KHZ_CLOCK</name>
									<description>RTC 32 kHz clock</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:2]</bitRange>

