cmsis-svd/cmsis-svd/data/NXP/LPC5410x_v0.4.svd
						</field>
					</fields>
				</register>
				<register>
					<name>SYSPLLCTRL</name>
					<description>PLL control</description>
					<addressOffset>0x1B0</addressOffset>
					<access>read-write</access>
					<resetValue>0x8000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SELR</name>
							<description>Bandwidth select R value</description>
							<bitRange>[3:0]</bitRange>

						</field>
						<field>
							<name>SELI</name>
							<description>Bandwidth select I value</description>
							<bitRange>[9:4]</bitRange>

						</field>
						<field>
							<name>SELP</name>
							<description>Bandwidth select P value</description>
							<bitRange>[14:10]</bitRange>

						</field>
						<field>
							<name>BYPASS</name>
							<description>PLL bypass control</description>
							<bitRange>[15:15]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled. PLL CCO is used to create the PLL
										output.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enabled. PLL is bypassed, the PLL input clock is
										routed directly to the PLL output (default).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BYPASSCCODIV2</name>
							<description>Bypass feedback clock divide by 2.</description>
							<bitRange>[16:16]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DIVIDE_BY_2</name>
									<description>Divide by 2. The CCO feedback clock is divided by 2
										in addition to the programmed M divide.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>BYPASS</name>
									<description>Bypass. The CCO feedback clock is divided only by
										the programmed M divide.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>UPLIMOFF</name>
							<description>Enable spread spectrum/fractional mode</description>
							<bitRange>[17:17]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NORMAL_MODE</name>
									<description>Normal mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SSGC_MODE</name>
									<description>SSGC mode. Spread spectrum/fractional
										mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BANDSEL</name>
							<description>PLL filter control. Set this bit to one when the SSGC is
								disabled or at low frequencies.</description>
							<bitRange>[18:18]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>SSCG_CONTROL</name>
									<description>SSCG control. The PLL filter uses the parameters
										derived from the SSCG decoder.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MDEC_CONTROL</name>
									<description>MDEC control. The PLL filter uses the programmable
										fields SELP, SELR, and SELI in this register to control the
										filter constants.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DIRECTI</name>
							<description>PLL0 direct input enable</description>
							<bitRange>[19:19]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled. The PLL input divider (N divider) output
										is used to drive the PLL CCO.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enabled. The PLL input divider (N divider) is
										bypassed. the PLL input clock is used directly to drive the
										PLL CCO.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DIRECTO</name>
							<description>PLL0 direct output enable</description>
							<bitRange>[20:20]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled. The PLL output divider (P divider) is
										used to create the PLL output.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enabled. The PLL output divider (P divider) is
										bypassed, the PLL CCO output is used as the PLL
										output.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:21]</bitRange>

						</field>
					</fields>
				</register>
				<register>
					<name>SYSPLLSTAT</name>
					<description>PLL status</description>
					<addressOffset>0x1B4</addressOffset>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>LOCK</name>
							<description>PLL0 lock indicator</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:1]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>SYSPLLNDEC</name>
					<description>PLL N decoder</description>
					<addressOffset>0x1B8</addressOffset>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>NDEC</name>
							<description>Decoded N-divider coefficient value</description>
							<bitRange>[9:0]</bitRange>
						</field>
						<field>
							<name>NREQ</name>
							<description>NDEC reload request. When a 1 is written to this bit, the
								NDEC value is loaded into the PLL. Must be cleared by software for
								any subsequent load, or the PLL can be powered down and back up via
								the PDEN_SYS_PLL bit in the PDRUNCFG register if the NDEC value is
								changed.</description>
							<bitRange>[10:10]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:11]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>SYSPLLPDEC</name>
					<description>PLL P decoder</description>
					<addressOffset>0x1BC</addressOffset>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>PDEC</name>
							<description>Decoded P-divider coefficient value</description>
							<bitRange>[6:0]</bitRange>
						</field>
						<field>
							<name>PREQ</name>
							<description>PDEC reload request. When a 1 is written to this bit, the
								PDEC value is loaded into the PLL. Must be cleared by software for
								any subsequent load, or the PLL can be powered down and back up via
								the PDEN_SYS_PLL bit in the PDRUNCFG register if the PDEC value is
								changed.</description>
							<bitRange>[7:7]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:8]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>SYSPLLSSCTRL0</name>
					<description>PLL spread spectrum control 0</description>
					<addressOffset>0x1C0</addressOffset>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>MDEC</name>
							<description>Decoded M-divider coefficient value</description>
							<bitRange>[16:0]</bitRange>

