cmsis-svd/cmsis-svd/data/NXP/LPC5410x_v0.4.svd
						</field>
						<field>
							<name>MREQ</name>
							<description>MDEC reload request. When a 1 is written to this bit, the
								MDEC value is loaded into the PLL. Must be cleared by software for
								any subsequent load, or the PLL can be powered down and back up via
								the PDEN_SYS_PLL bit in the PDRUNCFG register if the MDEC value is
								changed.</description>
							<bitRange>[17:17]</bitRange>

						</field>
						<field>
							<name>SEL_EXT</name>
							<description>Select spread spectrum mode.</description>
							<bitRange>[18:18]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>SPREAD_SPECTRUM_MODE</name>
									<description>Spread spectrum mode. Spread spectrum mode
										enabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MDEC_ENABLED</name>
									<description>MDEC enabled. Spread spectrum clock generator not
										used.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:19]</bitRange>

						</field>
					</fields>
				</register>
				<register>
					<name>SYSPLLSSCTRL1</name>
					<description>PLL spread spectrum control 1</description>
					<addressOffset>0x1C4</addressOffset>
					<access>read-write</access>
					<resetValue>0x10000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>MD</name>
							<description>M- divider value with fraction. MD[18:11] : integer portion
								of the feedback divider value. MD[10:0] : fractional portion of the
								feedback divider value.</description>
							<bitRange>[18:0]</bitRange>

						</field>
						<field>
							<name>MDREQ</name>
							<description>MD reload request. When a 1 is written to this bit, the MD
								value is loaded into the PLL. This bit is cleared when the load is
								complete.</description>
							<bitRange>[19:19]</bitRange>

						</field>
						<field>
							<name>MF</name>
							<description>Programmable modulation frequency fm = Fref/Nss with Fref =
								Fin/N 0b000 => Nss = 512 (fm = 3.9 - 7.8 kHz) 0b001 => Nss = 384 (fm
								= 5.2 - 10.4 kHz) 0b010 => Nss = 256 (fm = 7.8 - 15.6 kHz) 0b011 =>
								Nss = 128 (fm = 15.6 - 31.3 kHz) 0b100 => Nss = 64 (fm = 32.3 - 64.5
								kHz) 0b101 => Nss = 32 (fm = 62.5- 125 kHz) 0b110 => Nss = 24 (fm =
								83.3- 166.6 kHz) 0b111 => Nss = 16 (fm = 125- 250 kHz)</description>
							<bitRange>[22:20]</bitRange>

						</field>
						<field>
							<name>MR</name>
							<description>Programmable frequency modulation depth deltafmodpk-pk =
								Fref x k/Fcco = k/MDdec 0 = no spread 0b000 => k = 0 (no spread
								spectrum) 0b001 => k = 1 0b010 => k = 1.5 0b011 => k = 2 0b100 => k
								= 3 0b101 => k = 4 0b110 => k = 6 0b111 => k = 8</description>
							<bitRange>[25:23]</bitRange>

						</field>
						<field>
							<name>MC</name>
							<description>Modulation waveform control 0 = no compensation
								Compensation for low pass filtering of the PLL to get a triangular
								modulation at the output of the PLL, giving a flat frequency
								spectrum. 0b00 => no compensation 0b10 => recommended setting 0b11
								=> max. compensation</description>
							<bitRange>[27:26]</bitRange>

						</field>
						<field>
							<name>PD</name>
							<description>Power down.</description>
							<bitRange>[28:28]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enabled. Spread spectrum controller is
										enabled</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled. Spread spectrum controller is
										disabled</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DITHER</name>
							<description>Select modulation frequency.</description>
							<bitRange>[29:29]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>FIXED</name>
									<description>Fixed. Fixed modulation frequency.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DITHER</name>
									<description>Dither. Randomly dither between two modulation
										frequencies.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:30]</bitRange>

						</field>
					</fields>
				</register>
				<register>
					<name>PDRUNCFG</name>
					<description>Power configuration register</description>
					<addressOffset>0x210</addressOffset>
					<access>read-write</access>
					<resetValue>0x500500</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>.</description>
							<bitRange>[2:0]</bitRange>
						</field>
						<field>
							<name>PDEN_IRC_OSC</name>
							<description>IRC oscillator output. 0 = Powered; 1 = Powered
								down.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>PDEN_IRC</name>
							<description>IRC oscillator. 0 = Powered; 1 = Powered
								down.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>PDEN_FLASH</name>
							<description>Flash memory. 0 = Powered; 1 = Powered down.</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>PDEN_BOD_RST</name>
							<description>Brown-out Detect reset. 0 = Powered; 1 = Powered
								down.</description>
							<bitRange>[7:7]</bitRange>
						</field>
						<field>
							<name>PDEN_BOD_INTR</name>
							<description>Brown-out Detect interrupt. 0 = Powered; 1 = Powered
								down.</description>
							<bitRange>[8:8]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[9:9]</bitRange>
						</field>
						<field>
							<name>PDEN_ADC0</name>
							<description>ADC0. 0 = Powered; 1 = Powered down.</description>
							<bitRange>[10:10]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[12:11]</bitRange>
						</field>
						<field>
							<name>PDEN_SRAM0A</name>
							<description>First 8 kB of SRAM0). 0 = Powered; 1 = Powered
								down.</description>
							<bitRange>[13:13]</bitRange>
						</field>
						<field>
							<name>PDEN_SRAM0B</name>
							<description>Remaining portion of SRAM0). 0 = Powered; 1 = Powered
								down.</description>
							<bitRange>[14:14]</bitRange>
						</field>
						<field>
							<name>PDEN_SRAM1</name>
							<description>SRAM1. 0 = Powered; 1 = Powered down.</description>
							<bitRange>[15:15]</bitRange>
						</field>
						<field>
							<name>PDEN_SRAM2</name>
							<description>SRAM2 (undedicated 8 kB RAM). 0 = Powered; 1 = Powered
								down.</description>
							<bitRange>[16:16]</bitRange>
						</field>
						<field>
							<name>PDEN_ROM</name>
							<description>ROM. 0 = Powered; 1 = Powered down.</description>
							<bitRange>[17:17]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[18:18]</bitRange>
						</field>
						<field>
							<name>PDEN_VDDA</name>
							<description>Vdda to the ADC, must be enabled for the ADC to work. Also
								see bit 23. 0 = Powered; 1 = Powered down.</description>
							<bitRange>[19:19]</bitRange>
						</field>
						<field>
							<name>PDEN_WDT_OSC</name>
							<description>Watchdog oscillator. 0 = Powered; 1 = Powered
								down.</description>
							<bitRange>[20:20]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[21:21]</bitRange>
						</field>
						<field>
							<name>PDEN_SYS_PLL</name>
							<description>PLL0. 0 = Powered; 1 = Powered down.</description>
							<bitRange>[22:22]</bitRange>
						</field>
						<field>
							<name>PDEN_VREFP</name>
							<description>Vrefp to the ADC, must be enabled for the ADC to work. Also
								see bit 19. 0 = Powered; 1 = Powered down.</description>
							<bitRange>[23:23]</bitRange>
						</field>
						<field>
							<name>PDEN_32K_OSC</name>
							<description>32 kHz RTC oscillator. 0 = Powered; 1 = Powered
								down.</description>
							<bitRange>[24:24]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[31:25]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>PDRUNCFGSET</name>
					<description>Set bits in PDRUNCFG</description>
					<addressOffset>0x214</addressOffset>
					<access>write-only</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>PD_SET</name>
							<description>Writing ones to this register sets the corresponding bit or
								bits in the PDRUNCFG register, if they are implemented. Bits that do
								not correspond to defined bits in PDRUNCFG are reserved and only
								zeroes should be written to them.</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>PDRUNCFGCLR</name>
					<description>Clear bits in PDRUNCFG</description>
					<addressOffset>0x218</addressOffset>
					<access>write-only</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>PD_CLR</name>
							<description>Writing ones to this register clears the corresponding bit
								or bits in the PDRUNCFG register, if they are implemented. Bits that
								do not correspond to defined bits in PDRUNCFG are reserved and only
								zeroes should be written to them.</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>STARTERP0</name>
					<description>Start logic 0 wake-up enable register</description>
					<addressOffset>0x240</addressOffset>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>WWDT</name>
							<description>WWDT interrupt wake-up. 0 = Wake-up disabled. 1 = Wake-up
								enabled.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>BOD</name>
							<description>BOD interrupt wake-up. 0 = Wake-up disabled. 1 = Wake-up
								enabled.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>DMA</name>
							<description>DMA wake-up. 0 = Wake-up disabled. 1 = Wake-up enabled.
								Typically used in sleep mode only.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>GINT0</name>
							<description>Group interrupt 0 wake-up. 0 = Wake-up disabled. 1 =
								Wake-up enabled.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>PINT0</name>
							<description>GPIO pin interrupt 0 wake-up. 0 = Wake-up disabled. 1 =
								Wake-up enabled. Not for pattern match.</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>PINT1</name>
							<description>GPIO pin interrupt 1 wake-up. 0 = Wake-up disabled. 1 =
								Wake-up enabled. Not for pattern match.</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>PINT2</name>
							<description>GPIO pin interrupt 2 wake-up. 0 = Wake-up disabled. 1 =
								Wake-up enabled. Not for pattern match.</description>
							<bitRange>[7:7]</bitRange>
						</field>
						<field>
							<name>PINT3</name>
							<description>GPIO pin interrupt 3 wake-up. 0 = Wake-up disabled. 1 =
								Wake-up enabled. Not for pattern match.</description>
							<bitRange>[8:8]</bitRange>
						</field>
						<field>
							<name>UTICK</name>
							<description>Micro-tick Timer wake-up. 0 = Wake-up disabled. 1 = Wake-up
								enabled.</description>
							<bitRange>[9:9]</bitRange>
						</field>
						<field>
							<name>MRT</name>
							<description>Multi-Rate Timer wake-up. 0 = Wake-up disabled. 1 = Wake-up
								enabled. Typically used in sleep mode only.</description>
							<bitRange>[10:10]</bitRange>
						</field>
						<field>
							<name>TIMER0</name>
							<description>Timer 0 wake-up. 0 = Wake-up disabled. 1 = Wake-up
								enabled.Typically used in sleep mode only.</description>
							<bitRange>[11:11]</bitRange>
						</field>
						<field>
							<name>TIMER1</name>
							<description>Timer 1 wake-up. 0 = Wake-up disabled. 1 = Wake-up
								enabled.Typically used in sleep mode only.</description>
							<bitRange>[12:12]</bitRange>
						</field>
						<field>
							<name>TIMER2</name>
							<description>Timer 2 wake-up. 0 = Wake-up disabled. 1 = Wake-up
								enabled.Typically used in sleep mode only.</description>
							<bitRange>[13:13]</bitRange>
						</field>
						<field>
							<name>TIMER3</name>
							<description>Timer 3 wake-up. 0 = Wake-up disabled. 1 = Wake-up
								enabled.Typically used in sleep mode only.</description>
							<bitRange>[14:14]</bitRange>
						</field>
						<field>
							<name>TIMER4</name>
							<description>Timer 4 wake-up. 0 = Wake-up disabled. 1 = Wake-up
								enabled.Typically used in sleep mode only.</description>
							<bitRange>[15:15]</bitRange>
						</field>
						<field>
							<name>SCT0</name>
							<description>SCT0 wake-up. 0 = Wake-up disabled. 1 = Wake-up
								enabled.Typically used in sleep mode only.</description>
							<bitRange>[16:16]</bitRange>
						</field>
						<field>
							<name>USART0</name>
							<description>USART0 interrupt wake-up. 0 = Wake-up disabled. 1 = Wake-up
								enabled. Peripheral interrupt.</description>
							<bitRange>[17:17]</bitRange>
						</field>
						<field>
							<name>USART1</name>
							<description>USART1 interrupt wake-up. 0 = Wake-up disabled. 1 = Wake-up
								enabled. Peripheral interrupt.</description>
							<bitRange>[18:18]</bitRange>
						</field>
						<field>
							<name>USART2</name>
							<description>USART2 interrupt wake-up. 0 = Wake-up disabled. 1 = Wake-up
								enabled. Peripheral interrupt.</description>
							<bitRange>[19:19]</bitRange>
						</field>
						<field>
							<name>USART3</name>
							<description>USART2 interrupt wake-up. 0 = Wake-up disabled. 1 = Wake-up
								enabled. Peripheral interrupt.</description>
							<bitRange>[20:20]</bitRange>
						</field>
						<field>
							<name>I2C0</name>
							<description>I2C0 interrupt wake-up. 0 = Wake-up disabled. 1 = Wake-up
								enabled. Peripheral interrupt.</description>
							<bitRange>[21:21]</bitRange>
						</field>
						<field>
							<name>I2C1</name>
							<description>I2C1 interrupt wake-up. 0 = Wake-up disabled. 1 = Wake-up
								enabled. Peripheral interrupt.</description>
							<bitRange>[22:22]</bitRange>
						</field>
						<field>
							<name>I2C2</name>
							<description>I2C2 interrupt wake-up. 0 = Wake-up disabled. 1 = Wake-up
								enabled. Peripheral interrupt.</description>
							<bitRange>[23:23]</bitRange>
						</field>
						<field>
							<name>SPI0</name>
							<description>SPI0 interrupt wake-up. 0 = Wake-up disabled. 1 = Wake-up
								enabled. Peripheral interrupt.</description>
							<bitRange>[24:24]</bitRange>
						</field>
						<field>
							<name>SPI1</name>
							<description>SPI1 interrupt wake-up. 0 = Wake-up disabled. 1 = Wake-up
								enabled. Peripheral interrupt.</description>
							<bitRange>[25:25]</bitRange>
						</field>
						<field>
							<name>ADC0_SEQA</name>
							<description>ADC0 sequence A interrupt wake-up. 0 = Wake-up disabled. 1
								= Wake-up enabled.Typically used in sleep mode only.</description>
							<bitRange>[26:26]</bitRange>
						</field>
						<field>
							<name>ADC0_SEQB</name>
							<description>ADC0 sequence B interrupt wake-up. 0 = Wake-up disabled. 1
								= Wake-up enabled.Typically used in sleep mode only.</description>
							<bitRange>[27:27]</bitRange>
						</field>
						<field>
							<name>ADC0_THCMP</name>
							<description>ADC0 threshold and error interrupt wake-up. 0 = Wake-up
								disabled. 1 = Wake-up enabled.Typically used in sleep mode
								only.</description>
							<bitRange>[28:28]</bitRange>
						</field>
						<field>
							<name>RTC</name>
							<description>RTC interrupt wake-up. 0 = Wake-up disabled. 1 = Wake-up
								enabled.</description>
							<bitRange>[29:29]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[30:30]</bitRange>
						</field>
						<field>
							<name>MAILBOX</name>
							<description>Mailbox interrupt wake-up. 0 = Wake-up disabled. 1 =
								Wake-up enabled.Typically used in sleep mode only.</description>
							<bitRange>[31:31]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>STARTERP1</name>
					<description>Start logic 1 wake-up enable register</description>
					<addressOffset>0x244</addressOffset>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>GINT1</name>
							<description>Group interrupt 0 wake-up. 0 = Wake-up disabled. 1 =
								Wake-up enabled.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>PINT4</name>
							<description>GPIO pin interrupt 4 wake-up. 0 = Wake-up disabled. 1 =
								Wake-up enabled. Not for pattern match.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>PINT5</name>
							<description>GPIO pin interrupt 5 wake-up. 0 = Wake-up disabled. 1 =
								Wake-up enabled. Not for pattern match.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>PINT6</name>
							<description>GPIO pin interrupt 6 wake-up. 0 = Wake-up disabled. 1 =
								Wake-up enabled. Not for pattern match.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>PINT7</name>
							<description>GPIO pin interrupt 7 wake-up. 0 = Wake-up disabled. 1 =
								Wake-up enabled. Not for pattern match.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written..</description>
							<bitRange>[7:5]</bitRange>
						</field>
						<field>
							<name>RIT</name>
							<description>Repetitive Interrupt Timer interrupt wake-up. 0 = Wake-up
								disabled. 1 = Wake-up enabled. Typically used in sleep mode
								only.</description>
							<bitRange>[8:8]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written..</description>
							<bitRange>[31:15]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>STARTERPSET0</name>
					<description>Set bits in STARTERP0</description>
					<addressOffset>0x248</addressOffset>
					<access>write-only</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>START_SET0</name>
							<description>Writing ones to this register sets the corresponding bit or
								bits in the STARTERP0 register, if they are implemented. Bits that
								do not correspond to defined bits in STARTERP0 are reserved and only
								zeroes should be written to them.</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>STARTERPSET1</name>
					<description>Set bits in STARTERP1</description>
					<addressOffset>0x24C</addressOffset>
					<access>write-only</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>START_SET1</name>
							<description>Writing ones to this register sets the corresponding bit or
								bits in the STARTERP1 register, if they are implemented. Bits that
								do not correspond to defined bits in STARTERP1 are reserved and only
								zeroes should be written to them.</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>STARTERPCLR0</name>
					<description>Clear bits in STARTERP0</description>
					<addressOffset>0x250</addressOffset>
					<access>write-only</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>START_CLR0</name>
							<description>Writing ones to this register clears the corresponding bit
								or bits in the STARTERP0 register, if they are implemented. Bits
								that do not correspond to defined bits in STARTERP0 are reserved and
								only zeroes should be written to them.</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>STARTERPCLR1</name>
					<description>Clear bits in STARTERP1</description>
					<addressOffset>0x254</addressOffset>
					<access>write-only</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>START_CLR1</name>
							<description>Writing ones to this register clears the corresponding bit
								or bits in the STARTERP1 register, if they are implemented. Bits
								that do not correspond to defined bits in STARTERP1 are reserved and
								only zeroes should be written to them.</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
