cmsis-svd/cmsis-svd/data/NXP/LPC5410x_v0.4.svd
			</registers>

		</peripheral>
		<peripheral>
			<name>CT32B2</name>
			<description>Standard counter/timer 2 </description>
			<baseAddress>0x40004000</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0x1000</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>CT32B2</name>
				<value>13</value>
			</interrupt>
			<registers>
				<register>
					<name>IR</name>
					<description>Interrupt Register. The IR can be written to clear interrupts. The
						IR can be read to identify which of eight possible interrupt sources are
						pending.</description>
					<addressOffset>0x00</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>MR0INT</name>
							<description>Interrupt flag for match channel 0.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>MR1INT</name>
							<description>Interrupt flag for match channel 1.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>MR2INT</name>
							<description>Interrupt flag for match channel 2.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>MR3INT</name>
							<description>Interrupt flag for match channel 3.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>CR0INT</name>
							<description>Interrupt flag for capture channel 0 event.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>CR1INT</name>
							<description>Interrupt flag for capture channel 1 event.</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>CR2INT</name>
							<description>Interrupt flag for capture channel 2 event.</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>CR3INT</name>
							<description>Interrupt flag for capture channel 3 event.</description>
							<bitRange>[7:7]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:6]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>TCR</name>
					<description>Timer Control Register. The TCR is used to control the Timer
						Counter functions. The Timer Counter can be disabled or reset through the
						TCR.</description>
					<addressOffset>0x04</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CEN</name>
							<description>Counter enable.</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled.The counters are disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enabled. The Timer Counter and Prescale Counter are
										enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CRST</name>
							<description>Counter reset.</description>
							<bitRange>[1:1]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled. Do nothing.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enabled. The Timer Counter and the Prescale Counter
										are synchronously reset on the next positive edge of PCLK.
										The counters remain reset until TCR[1] is returned to
										zero.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:2]</bitRange>

						</field>
					</fields>
				</register>
				<register>
					<name>TC</name>
					<description>Timer Counter. The 32 bit TC is incremented every PR+1 cycles of
						PCLK. The TC is controlled through the TCR.</description>
					<addressOffset>0x08</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>TCVAL</name>
							<description>Timer counter value.</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>PR</name>
					<description>Prescale Register. When the Prescale Counter (PC) is equal to this
						value, the next clock increments the TC and clears the PC.</description>
					<addressOffset>0x0C</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>PRVAL</name>
							<description>Prescale counter value.</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>PC</name>
					<description>Prescale Counter. The 32 bit PC is a counter which is incremented
						to the value stored in PR. When the value in PR is reached, the TC is
						incremented and the PC is cleared. The PC is observable and controllable
						through the bus interface.</description>
					<addressOffset>0x10</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>PCVAL</name>
							<description>Prescale counter value.</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>MCR</name>
					<description>Match Control Register. The MCR is used to control if an interrupt
						is generated and if the TC is reset when a Match occurs.</description>
					<addressOffset>0x14</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>MR0I</name>
							<description>Interrupt on MR0: an interrupt is generated when MR0
								matches the value in the TC. 0 = disabled. 1 =
								enabled.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>MR0R</name>
							<description>Reset on MR0: the TC will be reset if MR0 matches it. 0 =
								disabled. 1 = enabled.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>MR0S</name>
							<description>Stop on MR0: the TC and PC will be stopped and TCR[0] will
								be set to 0 if MR0 matches the TC. 0 = disabled. 1 =
								enabled.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>MR1I</name>
							<description>Interrupt on MR1: an interrupt is generated when MR1
								matches the value in the TC. 0 = disabled. 1 = enabled. 0 =
								disabled. 1 = enabled.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>MR1R</name>
							<description>Reset on MR1: the TC will be reset if MR1 matches it. 0 =
								disabled. 1 = enabled.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>MR1S</name>
							<description>Stop on MR1: the TC and PC will be stopped and TCR[0] will
								be set to 0 if MR1 matches the TC. 0 = disabled. 1 =
								enabled.</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>MR2I</name>
							<description>Interrupt on MR2: an interrupt is generated when MR2
								matches the value in the TC. 0 = disabled. 1 =
								enabled.</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>MR2R</name>
							<description>Reset on MR2: the TC will be reset if MR2 matches it. 0 =
								disabled. 1 = enabled.</description>
							<bitRange>[7:7]</bitRange>
						</field>
						<field>
							<name>MR2S</name>
							<description>Stop on MR2: the TC and PC will be stopped and TCR[0] will
								be set to 0 if MR2 matches the TC. 0 = disabled. 1 =
								enabled.</description>
							<bitRange>[8:8]</bitRange>
						</field>
						<field>
							<name>MR3I</name>
							<description>Interrupt on MR3: an interrupt is generated when MR3
								matches the value in the TC. 0 = disabled. 1 =
								enabled.</description>
							<bitRange>[9:9]</bitRange>
						</field>
						<field>
							<name>MR3R</name>
							<description>Reset on MR3: the TC will be reset if MR3 matches it. 0 =
								disabled. 1 = enabled.</description>
							<bitRange>[10:10]</bitRange>
						</field>
						<field>
							<name>MR3S</name>
							<description>Stop on MR3: the TC and PC will be stopped and TCR[0] will
								be set to 0 if MR3 matches the TC. 0 = disabled. 1 =
								enabled.</description>
							<bitRange>[11:11]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:12]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<dim>4</dim>
					<dimIncrement>0x4</dimIncrement>
					<dimIndex>0-3</dimIndex>
					<name>MR%s</name>
					<description>Match Register 0. MR0 can be enabled through the MCR to reset the
						TC, stop both the TC and PC, and/or generate an interrupt every time MR0
						matches the TC.</description>
					<addressOffset>0x18</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>MATCH</name>
							<description>Timer counter match value.</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>CCR</name>
					<description>Capture Control Register. The CCR controls which edges of the
						capture inputs are used to load the Capture Registers and whether or not an
						interrupt is generated when a capture takes place.</description>
					<addressOffset>0x28</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CAP0RE</name>
							<description>Rising edge of capture channel 0: a sequence of 0 then 1
								causes CR0 to be loaded with the contents of TC. 0 = disabled. 1 =
								enabled.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>CAP0FE</name>
							<description>Falling edge of capture channel 0: a sequence of 1 then 0
								causes CR0 to be loaded with the contents of TC. 0 = disabled. 1 =
								enabled.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>CAP0I</name>
							<description>Generate interrupt on channel 0 capture event: a CR0 load
								generates an interrupt.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>CAP1RE</name>
							<description>Rising edge of capture channel 1: a sequence of 0 then 1
								causes CR1 to be loaded with the contents of TC. 0 = disabled. 1 =
								enabled.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>CAP1FE</name>
							<description>Falling edge of capture channel 1: a sequence of 1 then 0
								causes CR1 to be loaded with the contents of TC. 0 = disabled. 1 =
								enabled.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>CAP1I</name>
							<description>Generate interrupt on channel 1 capture event: a CR1 load
								generates an interrupt.</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>CAP2RE</name>
							<description>Rising edge of capture channel 2: a sequence of 0 then 1
								causes CR2 to be loaded with the contents of TC. 0 = disabled. 1 =
								enabled.</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>CAP2FE</name>
							<description>Falling edge of capture channel 2: a sequence of 1 then 0
								causes CR2 to be loaded with the contents of TC. 0 = disabled. 1 =
								enabled.</description>
							<bitRange>[7:7]</bitRange>
						</field>
						<field>
							<name>CAP2I</name>
							<description>Generate interrupt on channel 2 capture event: a CR2 load
								generates an interrupt.</description>
							<bitRange>[8:8]</bitRange>
						</field>
						<field>
							<name>CAP3RE</name>
							<description>Rising edge of capture channel 3: a sequence of 0 then 1
								causes CR3 to be loaded with the contents of TC. 0 = disabled. 1 =
								enabled.</description>
							<bitRange>[9:9]</bitRange>
						</field>
						<field>
							<name>CAP3FE</name>
							<description>Falling edge of capture channel 3: a sequence of 1 then 0
								causes CR3 to be loaded with the contents of TC. 0 = disabled. 1 =
								enabled.</description>
							<bitRange>[10:10]</bitRange>
						</field>
						<field>
							<name>CAP3I</name>
							<description>Generate interrupt on channel 3 capture event: a CR3 load
								generates an interrupt.</description>
							<bitRange>[11:11]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:12]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<dim>4</dim>
					<dimIncrement>0x4</dimIncrement>
					<dimIndex>0-3</dimIndex>
					<name>CR%s</name>
					<description>Capture Register 0. CR0 is loaded with the value of TC when there
						is an event on the CAPn.0 input.</description>
					<addressOffset>0x2C</addressOffset>
					<access>read-only</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CAP</name>
							<description>Timer counter capture value.</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>EMR</name>
					<description>External Match Register. The EMR controls the match function and
						the external match pins.</description>
					<addressOffset>0x3C</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>EM0</name>
							<description>External Match 0. This bit reflects the state of output
								MAT0, whether or not this output is connected to a pin. When a match
								occurs between the TC and MR0, this bit can either toggle, go LOW,
								go HIGH, or do nothing, as selected by EMR[5:4]. This bit is driven
								to the MAT pins if the match function is selected via IOCON. 0 =
								LOW. 1 = HIGH.</description>
							<bitRange>[0:0]</bitRange>

