cmsis-svd/cmsis-svd/data/NXP/LPC5410x_v0.4.svd
						</field>
						<field>
							<name>EM1</name>
							<description>External Match 1. This bit reflects the state of output
								MAT1, whether or not this output is connected to a pin. When a match
								occurs between the TC and MR1, this bit can either toggle, go LOW,
								go HIGH, or do nothing, as selected by EMR[7:6]. This bit is driven
								to the MAT pins if the match function is selected via IOCON. 0 =
								LOW. 1 = HIGH.</description>
							<bitRange>[1:1]</bitRange>

						</field>
						<field>
							<name>EM2</name>
							<description>External Match 2. This bit reflects the state of output
								MAT2, whether or not this output is connected to a pin. When a match
								occurs between the TC and MR2, this bit can either toggle, go LOW,
								go HIGH, or do nothing, as selected by EMR[9:8]. This bit is driven
								to the MAT pins if the match function is selected via IOCON. 0 =
								LOW. 1 = HIGH.</description>
							<bitRange>[2:2]</bitRange>

						</field>
						<field>
							<name>EM3</name>
							<description>External Match 3. This bit reflects the state of output
								MAT3, whether or not this output is connected to a pin. When a match
								occurs between the TC and MR3, this bit can either toggle, go LOW,
								go HIGH, or do nothing, as selected by MR[11:10]. This bit is driven
								to the MAT pins if the match function is selected via IOCON. 0 =
								LOW. 1 = HIGH.</description>
							<bitRange>[3:3]</bitRange>

						</field>
						<field>
							<name>EMC0</name>
							<description>External Match Control 0. Determines the functionality of
								External Match 0.</description>
							<bitRange>[5:4]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DO_NOTHING</name>
									<description>Do Nothing.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CLEAR</name>
									<description>Clear. Clear the corresponding External Match
										bit/output to 0 (MAT0 pin is LOW if pinned
										out).</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>Set. Set the corresponding External Match
										bit/output to 1 (MAT0 pin is HIGH if pinned
										out).</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TOGGLE</name>
									<description>Toggle. Toggle the corresponding External Match
										bit/output.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EMC1</name>
							<description>External Match Control 1. Determines the functionality of
								External Match 1.</description>
							<bitRange>[7:6]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DO_NOTHING</name>
									<description>Do Nothing.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CLEAR</name>
									<description>Clear. Clear the corresponding External Match
										bit/output to 0 (MAT1 pin is LOW if pinned
										out).</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>Set. Set the corresponding External Match
										bit/output to 1 (MAT1 pin is HIGH if pinned
										out).</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TOGGLE</name>
									<description>Toggle. Toggle the corresponding External Match
										bit/output.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EMC2</name>
							<description>External Match Control 2. Determines the functionality of
								External Match 2.</description>
							<bitRange>[9:8]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DO_NOTHING</name>
									<description>Do Nothing.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CLEAR</name>
									<description>Clear. Clear the corresponding External Match
										bit/output to 0 (MAT2 pin is LOW if pinned
										out).</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>Set. Set the corresponding External Match
										bit/output to 1 (MAT2 pin is HIGH if pinned
										out).</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TOGGLE</name>
									<description>Toggle. Toggle the corresponding External Match
										bit/output.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EMC3</name>
							<description>External Match Control 3. Determines the functionality of
								External Match 3.</description>
							<bitRange>[11:10]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DO_NOTHING</name>
									<description>Do Nothing.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CLEAR</name>
									<description>Clear. Clear the corresponding External Match
										bit/output to 0 (MAT3 pin is LOW if pinned
										out).</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>Set. Set the corresponding External Match
										bit/output to 1 (MAT3 pin is HIGH if pinned
										out).</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TOGGLE</name>
									<description>Toggle. Toggle the corresponding External Match
										bit/output.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:12]</bitRange>

