cmsis-svd/cmsis-svd/data/NXP/LPC5410x_v0.4.svd
						</field>
					</fields>
				</register>
			</registers>

		</peripheral>
		<peripheral derivedFrom="CT32B2">
			<name>CT32B3</name>
			<description>Standard counter/timer 3 </description>
			<baseAddress>0x40008000</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0x1000</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>CT32B3</name>
				<value>14</value>
			</interrupt>

		</peripheral>
		<peripheral derivedFrom="CT32B2">
			<name>CT32B4</name>
			<description>Standard counter/timer 4 </description>
			<baseAddress>0x4000C000</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0x1000</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>CT32B4</name>
				<value>15</value>
			</interrupt>

		</peripheral>

		<peripheral>
			<name>GINT0</name>
			<description>Group GPIO input interrupt 0</description>
			<groupName>GINT0</groupName>
			<baseAddress>0x40010000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x1000</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>GINT0</name>
				<value>4</value>
			</interrupt>
			<registers>
				<register>
					<name>CTRL</name>
					<description>GPIO grouped interrupt control register</description>
					<addressOffset>0x000</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>INT</name>
							<description>Group interrupt status. This bit is cleared by writing a
								one to it. Writing zero has no effect.</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NO_REQUEST</name>
									<description>No request. No interrupt request is
										pending.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>REQUEST_ACTIVE</name>
									<description>Request active. Interrupt request is
										active.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>COMB</name>
							<description>Combine enabled inputs for group interrupt</description>
							<bitRange>[1:1]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>OR</name>
									<description>Or. OR functionality: A grouped interrupt is
										generated when any one of the enabled inputs is active
										(based on its programmed polarity).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AND</name>
									<description>And. AND functionality: An interrupt is generated
										when all enabled bits are active (based on their programmed
										polarity).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TRIG</name>
							<description>Group interrupt trigger</description>
							<bitRange>[2:2]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>EDGE_TRIGGERED</name>
									<description>Edge-triggered.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LEVEL_TRIGGERED</name>
									<description>Level-triggered.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:3]</bitRange>

						</field>
					</fields>
				</register>
				<register>
					<dim>3</dim>
					<dimIncrement>0x4</dimIncrement>
					<dimIndex>0-2</dimIndex>
					<name>PORT_POL%s</name>
					<description>GPIO grouped interrupt port 0 polarity register</description>
					<addressOffset>0x020</addressOffset>
					<access>read-write</access>
					<resetValue>0xFFFFFFFF</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>POL</name>
							<description>Configure pin polarity of port m pins for group interrupt.
								Bit n corresponds to pin PIOm_n of port m. 0 = the pin is active
								LOW. If the level on this pin is LOW, the pin contributes to the
								group interrupt. 1 = the pin is active HIGH. If the level on this
								pin is HIGH, the pin contributes to the group
								interrupt.</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<dim>3</dim>
					<dimIncrement>0x4</dimIncrement>
					<dimIndex>0-2</dimIndex>
					<name>PORT_ENA%s</name>
					<description>GPIO grouped interrupt port 0 enable register</description>
					<addressOffset>0x040</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>ENA</name>
							<description>Enable port 0 pin for group interrupt. Bit n corresponds to
								pin Pm_n of port m. 0 = the port 0 pin is disabled and does not
								contribute to the grouped interrupt. 1 = the port 0 pin is enabled
								and contributes to the grouped interrupt.</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
			</registers>

		</peripheral>
		<peripheral derivedFrom="GINT0">
			<name>GINT1</name>
			<description>Group GPIO input interrupt 1</description>
			<baseAddress>0x40014000</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0x1000</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>GINT1</name>
				<value>32</value>
			</interrupt>

		</peripheral>
		<peripheral>
			<name>PINT</name>
			<description>Pin interrupt and pattern match engine</description>
			<groupName>PINT</groupName>
			<baseAddress>0x40018000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x1000</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>PIN_INT0</name>
				<value>5</value>
			</interrupt>
			<interrupt>
				<name>PIN_INT1</name>
				<value>6</value>
			</interrupt>
			<interrupt>
				<name>PIN_INT2</name>
				<value>7</value>
			</interrupt>
			<interrupt>
				<name>PIN_INT3</name>
				<value>8</value>
			</interrupt>
			<interrupt>
				<name>PIN_INT4</name>
				<value>33</value>
			</interrupt>
			<interrupt>
				<name>PIN_INT5</name>
				<value>34</value>
			</interrupt>
			<interrupt>
				<name>PIN_INT6</name>
				<value>35</value>
			</interrupt>
			<interrupt>
				<name>PIN_INT7</name>
				<value>36</value>
			</interrupt>
			<registers>
				<register>
					<name>ISEL</name>
					<description>Pin Interrupt Mode register</description>
					<addressOffset>0x000</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>PMODE</name>
							<description>Selects the interrupt mode for each pin interrupt. Bit n
								configures the pin interrupt selected in PINTSELn. 0 = Edge
								sensitive 1 = Level sensitive</description>
							<bitRange>[7:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:8]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>IENR</name>
					<description>Pin interrupt level or rising edge interrupt enable
						register</description>
					<addressOffset>0x004</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>ENRL</name>
							<description>Enables the rising edge or level interrupt for each pin
								interrupt. Bit n configures the pin interrupt selected in PINTSELn.
								0 = Disable rising edge or level interrupt. 1 = Enable rising edge
								or level interrupt.</description>
							<bitRange>[7:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written..</description>
							<bitRange>[31:8]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>SIENR</name>
					<description>Pin interrupt level or rising edge interrupt set
						register</description>
					<addressOffset>0x008</addressOffset>
					<access>write-only</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>SETENRL</name>
							<description>Ones written to this address set bits in the IENR, thus
								enabling interrupts. Bit n sets bit n in the IENR register. 0 = No
								operation. 1 = Enable rising edge or level interrupt.</description>
							<bitRange>[7:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[31:8]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>CIENR</name>
					<description>Pin interrupt level (rising edge interrupt) clear
						register</description>
					<addressOffset>0x00C</addressOffset>
					<access>write-only</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>CENRL</name>
							<description>Ones written to this address clear bits in the IENR, thus
								disabling the interrupts. Bit n clears bit n in the IENR register. 0
								= No operation. 1 = Disable rising edge or level
								interrupt.</description>
							<bitRange>[7:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[31:8]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>IENF</name>
					<description>Pin interrupt active level or falling edge interrupt enable
						register</description>
					<addressOffset>0x010</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>ENAF</name>
							<description>Enables the falling edge or configures the active level
								interrupt for each pin interrupt. Bit n configures the pin interrupt
								selected in PINTSELn. 0 = Disable falling edge interrupt or set
								active interrupt level LOW. 1 = Enable falling edge interrupt
								enabled or set active interrupt level HIGH.</description>
							<bitRange>[7:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[31:8]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>SIENF</name>
					<description>Pin interrupt active level or falling edge interrupt set
						register</description>
					<addressOffset>0x014</addressOffset>
					<access>write-only</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>SETENAF</name>
							<description>Ones written to this address set bits in the IENF, thus
								enabling interrupts. Bit n sets bit n in the IENF register. 0 = No
								operation. 1 = Select HIGH-active interrupt or enable falling edge
								interrupt.</description>
							<bitRange>[7:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[31:8]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>CIENF</name>
					<description>Pin interrupt active level or falling edge interrupt clear
						register</description>
					<addressOffset>0x018</addressOffset>
					<access>write-only</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>CENAF</name>
							<description>Ones written to this address clears bits in the IENF, thus
								disabling interrupts. Bit n clears bit n in the IENF register. 0 =
								No operation. 1 = LOW-active interrupt selected or falling edge
								interrupt disabled.</description>
							<bitRange>[7:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[31:8]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>RISE</name>
					<description>Pin interrupt rising edge register</description>
					<addressOffset>0x01C</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RDET</name>
							<description>Rising edge detect. Bit n detects the rising edge of the
								pin selected in PINTSELn. Read 0: No rising edge has been detected
								on this pin since Reset or the last time a one was written to this
								bit. Write 0: no operation. Read 1: a rising edge has been detected
								since Reset or the last time a one was written to this bit. Write 1:
								clear rising edge detection for this pin.</description>
							<bitRange>[7:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[31:8]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>FALL</name>
					<description>Pin interrupt falling edge register</description>
					<addressOffset>0x020</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>FDET</name>
							<description>Falling edge detect. Bit n detects the falling edge of the
								pin selected in PINTSELn. Read 0: No falling edge has been detected
								on this pin since Reset or the last time a one was written to this
								bit. Write 0: no operation. Read 1: a falling edge has been detected
								since Reset or the last time a one was written to this bit. Write 1:
								clear falling edge detection for this pin.</description>
							<bitRange>[7:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[31:8]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>IST</name>
					<description>Pin interrupt status register</description>
					<addressOffset>0x024</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>PSTAT</name>
							<description>Pin interrupt status. Bit n returns the status, clears the
								edge interrupt, or inverts the active level of the pin selected in
								PINTSELn. Read 0: interrupt is not being requested for this
								interrupt pin. Write 0: no operation. Read 1: interrupt is being
								requested for this interrupt pin. Write 1 (edge-sensitive): clear
								rising- and falling-edge detection for this pin. Write 1
								(level-sensitive): switch the active level for this pin (in the IENF
								register).</description>
							<bitRange>[7:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[31:8]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>PMCTRL</name>
					<description>Pattern match interrupt control register</description>
					<addressOffset>0x028</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SEL_PMATCH</name>
							<description>Specifies whether the 8 pin interrupts are controlled by
								the pin interrupt function or by the pattern match
								function.</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>PIN_INTERRUPT</name>
									<description>Pin interrupt. Interrupts are driven in response to
										the standard pin interrupt function.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PATTERN_MATCH</name>
									<description>Pattern match. Interrupts are driven in response to
										pattern matches.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ENA_RXEV</name>
							<description>Enables the RXEV output to the CPU and/or to a GPIO output
								when the specified boolean expression evaluates to
								true.</description>
							<bitRange>[1:1]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled. RXEV output to the CPU is
										disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enabled. RXEV output to the CPU is
										enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not write 1s to unused bits.</description>
							<bitRange>[23:2]</bitRange>

