cmsis-svd/cmsis-svd/data/NXP/LPC5410x_v0.4.svd
						</field>
						<field>
							<name>PMAT</name>
							<description>This field displays the current state of pattern matches. A
								1 in any bit of this field indicates that the corresponding product
								term is matched by the current state of the appropriate
								inputs.</description>
							<bitRange>[31:24]</bitRange>

						</field>
					</fields>
				</register>
				<register>
					<name>PMSRC</name>
					<description>Pattern match interrupt bit-slice source register</description>
					<addressOffset>0x02C</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>Reserved</name>
							<description>Software should not write 1s to unused bits.</description>
							<bitRange>[7:0]</bitRange>

						</field>
						<field>
							<name>SRC0</name>
							<description>Selects the input source for bit slice 0</description>
							<bitRange>[10:8]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>INPUT_0</name>
									<description>Input 0. Selects the pin selected in the PINTSEL0
										register as the source to bit slice 0.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT_1</name>
									<description>Input 1. Selects the pin selected in the PINTSEL1
										register as the source to bit slice 0.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT_2</name>
									<description>Input 2. Selects the pin selected in the PINTSEL2
										register as the source to bit slice 0.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT_3</name>
									<description>Input 3. Selects the pin selected in the PINTSEL3
										register as the source to bit slice 0.</description>
									<value>0x3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT_4</name>
									<description>Input 4. Selects the pin selected in the PINTSEL4
										register as the source to bit slice 0.</description>
									<value>0x4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT_5</name>
									<description>Input 5. Selects the pin selected in the PINTSEL5
										register as the source to bit slice 0.</description>
									<value>0x5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT_6</name>
									<description>Input 6. Selects the pin selected in the PINTSEL6
										register as the source to bit slice 0.</description>
									<value>0x6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT_7</name>
									<description>Input 7. Selects the pin selected in the PINTSEL7
										register as the source to bit slice 0.</description>
									<value>0x7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SRC1</name>
							<description>Selects the input source for bit slice 1</description>
							<bitRange>[13:11]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>INPUT_0</name>
									<description>Input 0. Selects the pin selected in the PINTSEL0
										register as the source to bit slice 1.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT_1</name>
									<description>Input 1. Selects the pin selected in the PINTSEL1
										register as the source to bit slice 1.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT_2</name>
									<description>Input 2. Selects the pin selected in the PINTSEL2
										register as the source to bit slice 1.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT_3</name>
									<description>Input 3. Selects the pin selected in the PINTSEL3
										register as the source to bit slice 1.</description>
									<value>0x3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT_4</name>
									<description>Input 4. Selects the pin selected in the PINTSEL4
										register as the source to bit slice 1.</description>
									<value>0x4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT_5</name>
									<description>Input 5. Selects the pin selected in the PINTSEL5
										register as the source to bit slice 1.</description>
									<value>0x5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT_6</name>
									<description>Input 6. Selects the pin selected in the PINTSEL6
										register as the source to bit slice 1.</description>
									<value>0x6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT_7</name>
									<description>Input 7. Selects the pin selected in the PINTSEL7
										register as the source to bit slice 1.</description>
									<value>0x7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SRC2</name>
							<description>Selects the input source for bit slice 2</description>
							<bitRange>[16:14]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>INPUT_0</name>
									<description>Input 0. Selects the pin selected in the PINTSEL0
										register as the source to bit slice 2.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT_1</name>
									<description>Input 1. Selects the pin selected in the PINTSEL1
										register as the source to bit slice 2.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT_2</name>
									<description>Input 2. Selects the pin selected in the PINTSEL2
										register as the source to bit slice 2.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT_3</name>
									<description>Input 3. Selects the pin selected in the PINTSEL3
										register as the source to bit slice 2.</description>
									<value>0x3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT_4</name>
									<description>Input 4. Selects the pin selected in the PINTSEL4
										register as the source to bit slice 2.</description>
									<value>0x4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT_5</name>
									<description>Input 5. Selects the pin selected in the PINTSEL5
										register as the source to bit slice 2.</description>
									<value>0x5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT_6</name>
									<description>Input 6. Selects the pin selected in the PINTSEL6
										register as the source to bit slice 2.</description>
									<value>0x6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT_7</name>
									<description>Input 7. Selects the pin selected in the PINTSEL7
										register as the source to bit slice 2.</description>
									<value>0x7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SRC3</name>
							<description>Selects the input source for bit slice 3</description>
							<bitRange>[19:17]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>INPUT_0</name>
									<description>Input 0. Selects the pin selected in the PINTSEL0
										register as the source to bit slice 3.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT_1</name>
									<description>Input 1. Selects the pin selected in the PINTSEL1
										register as the source to bit slice 3.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT_2</name>
									<description>Input 2. Selects the pin selected in the PINTSEL2
										register as the source to bit slice 3.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT_3</name>
									<description>Input 3. Selects the pin selected in the PINTSEL3
										register as the source to bit slice 3.</description>
									<value>0x3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT_4</name>
									<description>Input 4. Selects the pin selected in the PINTSEL4
										register as the source to bit slice 3.</description>
									<value>0x4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT_5</name>
									<description>Input 5. Selects the pin selected in the PINTSEL5
										register as the source to bit slice 3.</description>
									<value>0x5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT_6</name>
									<description>Input 6. Selects the pin selected in the PINTSEL6
										register as the source to bit slice 3.</description>
									<value>0x6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT_7</name>
									<description>Input 7. Selects the pin selected in the PINTSEL7
										register as the source to bit slice 3.</description>
									<value>0x7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SRC4</name>
							<description>Selects the input source for bit slice 4</description>
							<bitRange>[22:20]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>INPUT_0</name>
									<description>Input 0. Selects the pin selected in the PINTSEL0
										register as the source to bit slice 4.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT_1</name>
									<description>Input 1. Selects the pin selected in the PINTSEL1
										register as the source to bit slice 4.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT_2</name>
									<description>Input 2. Selects the pin selected in the PINTSEL2
										register as the source to bit slice 4.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT_3</name>
									<description>Input 3. Selects the pin selected in the PINTSEL3
										register as the source to bit slice 4.</description>
									<value>0x3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT_4</name>
									<description>Input 4. Selects the pin selected in the PINTSEL4
										register as the source to bit slice 4.</description>
									<value>0x4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT_5</name>
									<description>Input 5. Selects the pin selected in the PINTSEL5
										register as the source to bit slice 4.</description>
									<value>0x5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT_6</name>
									<description>Input 6. Selects the pin selected in the PINTSEL6
										register as the source to bit slice 4.</description>
									<value>0x6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT_7</name>
									<description>Input 7. Selects the pin selected in the PINTSEL7
										register as the source to bit slice 4.</description>
									<value>0x7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SRC5</name>
							<description>Selects the input source for bit slice 5</description>
							<bitRange>[25:23]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>INPUT_0</name>
									<description>Input 0. Selects the pin selected in the PINTSEL0
										register as the source to bit slice 5.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT_1</name>
									<description>Input 1. Selects the pin selected in the PINTSEL1
										register as the source to bit slice 5.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT_2</name>
									<description>Input 2. Selects the pin selected in the PINTSEL2
										register as the source to bit slice 5.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT_3</name>
									<description>Input 3. Selects the pin selected in the PINTSEL3
										register as the source to bit slice 5.</description>
									<value>0x3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT_4</name>
									<description>Input 4. Selects the pin selected in the PINTSEL4
										register as the source to bit slice 5.</description>
									<value>0x4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT_5</name>
									<description>Input 5. Selects the pin selected in the PINTSEL5
										register as the source to bit slice 5.</description>
									<value>0x5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT_6</name>
									<description>Input 6. Selects the pin selected in the PINTSEL6
										register as the source to bit slice 5.</description>
									<value>0x6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT_7</name>
									<description>Input 7. Selects the pin selected in the PINTSEL7
										register as the source to bit slice 5.</description>
									<value>0x7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SRC6</name>
							<description>Selects the input source for bit slice 6</description>
							<bitRange>[28:26]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>INPUT_0</name>
									<description>Input 0. Selects the pin selected in the PINTSEL0
										register as the source to bit slice 6.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT_1</name>
									<description>Input 1. Selects the pin selected in the PINTSEL1
										register as the source to bit slice 6.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT_2</name>
									<description>Input 2. Selects the pin selected in the PINTSEL2
										register as the source to bit slice 6.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT_3</name>
									<description>Input 3. Selects the pin selected in the PINTSEL3
										register as the source to bit slice 6.</description>
									<value>0x3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT_4</name>
									<description>Input 4. Selects the pin selected in the PINTSEL4
										register as the source to bit slice 6.</description>
									<value>0x4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT_5</name>
									<description>Input 5. Selects the pin selected in the PINTSEL5
										register as the source to bit slice 6.</description>
									<value>0x5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT_6</name>
									<description>Input 6. Selects the pin selected in the PINTSEL6
										register as the source to bit slice 6.</description>
									<value>0x6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT_7</name>
									<description>Input 7. Selects the pin selected in the PINTSEL7
										register as the source to bit slice 6.</description>
									<value>0x7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SRC7</name>
							<description>Selects the input source for bit slice 7</description>
							<bitRange>[31:29]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>INPUT_0</name>
									<description>Input 0. Selects the pin selected in the PINTSEL0
										register as the source to bit slice 7.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT_1</name>
									<description>Input 1. Selects the pin selected in the PINTSEL1
										register as the source to bit slice 7.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT_2</name>
									<description>Input 2. Selects the pin selected in the PINTSEL2
										register as the source to bit slice 7.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT_3</name>
									<description>Input 3. Selects the pin selected in the PINTSEL3
										register as the source to bit slice 7.</description>
									<value>0x3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT_4</name>
									<description>Input 4. Selects the pin selected in the PINTSEL4
										register as the source to bit slice 7.</description>
									<value>0x4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT_5</name>
									<description>Input 5. Selects the pin selected in the PINTSEL5
										register as the source to bit slice 7.</description>
									<value>0x5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT_6</name>
									<description>Input 6. Selects the pin selected in the PINTSEL6
										register as the source to bit slice 7.</description>
									<value>0x6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT_7</name>
									<description>Input 7. Selects the pin selected in the PINTSEL7
										register as the source to bit slice 7.</description>
									<value>0x7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
