cmsis-svd/cmsis-svd/data/NXP/LPC5410x_v0.4.svd
										edge is first detected on the specified input (this is a
										non-sticky version of value 0x3) . This bit is cleared after
										one clock cycle.</description>
									<value>0x7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CFG6</name>
							<description>Specifies the match contribution condition for bit slice
								6.</description>
							<bitRange>[28:26]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>CONSTANT_HIGH</name>
									<description>Constant HIGH. This bit slice always contributes to
										a product term match.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>STICKY_RISING_EDGE</name>
									<description>Sticky rising edge. Match occurs if a rising edge
										on the specified input has occurred since the last time the
										edge detection for this bit slice was cleared. This bit is
										only cleared when the PMCFG or the PMSRC registers are
										written to.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>STICKY_FALLING_EDGE</name>
									<description>Sticky falling edge. Match occurs if a falling edge
										on the specified input has occurred since the last time the
										edge detection for this bit slice was cleared. This bit is
										only cleared when the PMCFG or the PMSRC registers are
										written to.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>STICKY_RISING_OR_FAL</name>
									<description>Sticky rising or falling edge. Match occurs if
										either a rising or falling edge on the specified input has
										occurred since the last time the edge detection for this bit
										slice was cleared. This bit is only cleared when the PMCFG
										or the PMSRC registers are written to.</description>
									<value>0x3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGH_LEVEL</name>
									<description>High level. Match (for this bit slice) occurs when
										there is a high level on the input specified for this bit
										slice in the PMSRC register.</description>
									<value>0x4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOW_LEVEL</name>
									<description>Low level. Match occurs when there is a low level
										on the specified input.</description>
									<value>0x5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CONSTANT_0</name>
									<description>Constant 0. This bit slice never contributes to a
										match (should be used to disable any unused bit
										slices).</description>
									<value>0x6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EVENT</name>
									<description>Event. Non-sticky rising or falling edge. Match
										occurs on an event - i.e. when either a rising or falling
										edge is first detected on the specified input (this is a
										non-sticky version of value 0x3) . This bit is cleared after
										one clock cycle.</description>
									<value>0x7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CFG7</name>
							<description>Specifies the match contribution condition for bit slice
								7.</description>
							<bitRange>[31:29]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>CONSTANT_HIGH</name>
									<description>Constant HIGH. This bit slice always contributes to
										a product term match.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>STICKY_RISING_EDGE</name>
									<description>Sticky rising edge. Match occurs if a rising edge
										on the specified input has occurred since the last time the
										edge detection for this bit slice was cleared. This bit is
										only cleared when the PMCFG or the PMSRC registers are
										written to.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>STICKY_FALLING_EDGE</name>
									<description>Sticky falling edge. Match occurs if a falling edge
										on the specified input has occurred since the last time the
										edge detection for this bit slice was cleared. This bit is
										only cleared when the PMCFG or the PMSRC registers are
										written to.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>STICKY_RISING_OR_FAL</name>
									<description>Sticky rising or falling edge. Match occurs if
										either a rising or falling edge on the specified input has
										occurred since the last time the edge detection for this bit
										slice was cleared. This bit is only cleared when the PMCFG
										or the PMSRC registers are written to.</description>
									<value>0x3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGH_LEVEL</name>
									<description>High level. Match (for this bit slice) occurs when
										there is a high level on the input specified for this bit
										slice in the PMSRC register.</description>
									<value>0x4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOW_LEVEL</name>
									<description>Low level. Match occurs when there is a low level
										on the specified input.</description>
									<value>0x5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CONSTANT_0</name>
									<description>Constant 0. This bit slice never contributes to a
										match (should be used to disable any unused bit
										slices).</description>
									<value>0x6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EVENT</name>
									<description>Event. Non-sticky rising or falling edge. Match
										occurs on an event - i.e. when either a rising or falling
										edge is first detected on the specified input (this is a
										non-sticky version of value 0x3) . This bit is cleared after
										one clock cycle.</description>
									<value>0x7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
