cmsis-svd/cmsis-svd/data/NXP/LPC5410x_v0.4.svd
						</field>
					</fields>
				</register>
			</registers>

		</peripheral>


		<peripheral>
			<name>UTICK</name>
			<description>Micro-tick timer</description>
			<groupName>UTICK</groupName>
			<baseAddress>0x40020000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x1000</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>UTICK</name>
				<value>9</value>
			</interrupt>
			<registers>
				<register>
					<name>CTRL</name>
					<description>Control register.</description>
					<addressOffset>0x00</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DELAYVAL</name>
							<description>Tick interval value. The delay will be equal to DELAYVAL +
								1 periods of the timer clock. The minimum usable value is 1, for a
								delay of 2 timer clocks. A value of 0 stops the timer.</description>
							<bitRange>[30:0]</bitRange>
						</field>
						<field>
							<name>REPEAT</name>
							<description>Repeat delay. 0 = One-time delay. 1 = Delay repeats
								continuously.</description>
							<bitRange>[31:31]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>STAT</name>
					<description>Status register.</description>
					<addressOffset>0x04</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>INTR</name>
							<description>Interrupt flag. 0 = No interrupt is pending. 1 = An
								interrupt is pending. A write of any value to this register clears
								this flag.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>ACTIVE</name>
							<description>Active flag. 0 = The Micro-Tick Timer is stopped. 1 = The
								Micro-Tick Timer is currently active.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:2]</bitRange>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>


		<peripheral>
			<name>ADVSYSCON</name>
			<description>Advanced System configuration </description>
			<groupName>ADVSYSCON</groupName>
			<baseAddress>0x4002C000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x1000</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>BOD</name>
				<value>1</value>
			</interrupt>
			<registers>
				<register>
					<name>BODCTRL</name>
					<description>Brown-Out Detect control</description>
					<addressOffset>0x44</addressOffset>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>BODRSTLEV</name>
							<description>BOD reset level</description>
							<bitRange>[1:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>LEVEL_0_1</name>
									<description>Level 0: 1.5 V</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LEVEL_1_1</name>
									<description>Level 1: 1.85 V</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LEVEL_2_2</name>
									<description>Level 2: 2.0 V</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LEVEL_3_2</name>
									<description>Level 3: 2.3 V</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BODINTVAL</name>
							<description>BOD interrupt level</description>
							<bitRange>[3:2]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>LEVEL_0_2</name>
									<description>Level 0: 2.05 V</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LEVEL_1_2</name>
									<description>Level 1: 2.45 V</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LEVEL_2_2</name>
									<description>Level 2: 2.75 V</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LEVEL_3_3</name>
									<description>Level 3: 3.05 V</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BODRSTENA</name>
							<description>BOD reset enable</description>
							<bitRange>[4:4]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLE_RESET_FUNCTI</name>
									<description>Disable reset function.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE_RESET_FUNCTIO</name>
									<description>Enable reset function.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:5]</bitRange>

						</field>
					</fields>
				</register>
			</registers>
		</peripheral>

		<peripheral>
			<name>WWDT</name>
			<description>Windowed Watchdog Timer</description>
			<groupName>WWDT</groupName>
			<baseAddress>0x40038000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x1000</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>WDT</name>
				<value>0</value>
			</interrupt>
			<registers>
				<register>
					<name>MOD</name>
					<description>Watchdog mode register. This register contains the basic mode and
						status of the Watchdog Timer.</description>
					<addressOffset>0x000</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>WDEN</name>
							<description>Watchdog enable bit. Once this bit is set to one and a
								watchdog feed is performed, the watchdog timer will run
								permanently.</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>STOP</name>
									<description>Stop. The watchdog timer is stopped.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RUN</name>
									<description>Run. The watchdog timer is running.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WDRESET</name>
							<description>Watchdog reset enable bit. Once this bit has been written
								with a 1 it cannot be re-written with a 0.</description>
							<bitRange>[1:1]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>INTERRUPT</name>
									<description>Interrupt. A watchdog time-out will not cause a
										chip reset.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RESET</name>
									<description>Reset. A watchdog time-out will cause a chip
										reset.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WDTOF</name>
							<description>Watchdog time-out flag. Set when the watchdog timer times
								out, by a feed error, or by events associated with WDPROTECT.
								Cleared by software. Causes a chip reset if WDRESET =
								1.</description>
							<bitRange>[2:2]</bitRange>

