cmsis-svd/cmsis-svd/data/NXP/LPC5410x_v0.4.svd
						</field>
						<field>
							<name>WDINT</name>
							<description>Warning interrupt flag. Set when the timer reaches the
								value in WDWARNINT. Cleared by software.</description>
							<bitRange>[3:3]</bitRange>

						</field>
						<field>
							<name>WDPROTECT</name>
							<description>Watchdog update mode. This bit can be set once by software
								and is only cleared by a reset.</description>
							<bitRange>[4:4]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>FLEXIBLE</name>
									<description>Flexible. The watchdog time-out value (TC) can be
										changed at any time.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>THRESHOLD</name>
									<description>Threshold. The watchdog time-out value (TC) can be
										changed only after the counter is below the value of
										WDWARNINT and WDWINDOW.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LOCK</name>
							<description>Once this bit is set to one and a watchdog feed is
								performed, disabling or powering down the watchdog oscillator is
								prevented by hardware. This bit can be set once by software and is
								only cleared by any reset.</description>
							<bitRange>[5:5]</bitRange>

						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:6]</bitRange>

						</field>
					</fields>
				</register>
				<register>
					<name>TC</name>
					<description>Watchdog timer constant register. This 24-bit register determines
						the time-out value.</description>
					<addressOffset>0x004</addressOffset>
					<access>read-write</access>
					<resetValue>0xFF</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>COUNT</name>
							<description>Watchdog time-out value.</description>
							<bitRange>[23:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:24]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>FEED</name>
					<description>Watchdog feed sequence register. Writing 0xAA followed by 0x55 to
						this register reloads the Watchdog timer with the value contained in
						WDTC.</description>
					<addressOffset>0x008</addressOffset>
					<access>write-only</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>FEED</name>
							<description>Feed value should be 0xAA followed by 0x55.</description>
							<bitRange>[7:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:8]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>TV</name>
					<description>Watchdog timer value register. This 24-bit register reads out the
						current value of the Watchdog timer.</description>
					<addressOffset>0x00C</addressOffset>
					<access>read-only</access>
					<resetValue>0xFF</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>COUNT</name>
							<description>Counter timer value.</description>
							<bitRange>[23:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:24]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>WARNINT</name>
					<description>Watchdog Warning Interrupt compare value.</description>
					<addressOffset>0x014</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>WARNINT</name>
							<description>Watchdog warning interrupt compare value.</description>
							<bitRange>[9:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, only zero should be written.</description>
							<bitRange>[31:10]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>WINDOW</name>
					<description>Watchdog Window compare value.</description>
					<addressOffset>0x018</addressOffset>
					<access>read-write</access>
					<resetValue>0xFFFFFF</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>WINDOW</name>
							<description>Watchdog window value.</description>
							<bitRange>[23:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, only zero should be written.</description>
							<bitRange>[31:24]</bitRange>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
		<peripheral>
			<name>RTC</name>
			<description>Real-Time Clock</description>
			<groupName>RTC</groupName>
			<baseAddress>0x4003C000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x1000</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>RTC</name>
				<value>29</value>
			</interrupt>
			<registers>
				<register>
					<name>CTRL</name>
					<description>RTC control register</description>
					<addressOffset>0x000</addressOffset>
					<access>read-write</access>
					<resetValue>0xF</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SWRESET</name>
							<description>Software reset control</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NOT_IN_RESET</name>
									<description>Not in reset. The RTC is not held in reset. This
										bit must be cleared prior to configuring or initiating any
										operation of the RTC.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>IN_RESET</name>
									<description>In reset. The RTC is held in reset. All register
										bits within the RTC will be forced to their reset value
										except the OFD bit. This bit must be cleared before writing
										to any register in the RTC - including writes to set any of
										the other bits within this register. Do not attempt to write
										to any bits of this register at the same time that the reset
										bit is being cleared.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OFD</name>
							<description>Oscillator fail detect status.</description>
							<bitRange>[1:1]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>RUN</name>
									<description>Run. The RTC oscillator is running properly.
										Writing a 0 has no effect.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FAIL</name>
									<description>Fail. RTC oscillator fail detected. Clear this flag
										after the following power-up. Writing a 1 clears this
										bit.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ALARM1HZ</name>
							<description>RTC 1 Hz timer alarm flag status.</description>
							<bitRange>[2:2]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NO_MATCH</name>
									<description>No match. No match has occurred on the 1 Hz RTC
										timer. Writing a 0 has no effect.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MATCH</name>
									<description>Match. A match condition has occurred on the 1 Hz
										RTC timer. This flag generates an RTC alarm interrupt
										request RTC_ALARM which can also wake up the part from any
										low power mode. Writing a 1 clears this bit.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WAKE1KHZ</name>
							<description>RTC 1 kHz timer wake-up flag status.</description>
							<bitRange>[3:3]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>RUN</name>
									<description>Run. The RTC 1 kHz timer is running. Writing a 0
										has no effect.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TIME_OUT</name>
									<description>Time-out. The 1 kHz high-resolution/wake-up timer
										has timed out. This flag generates an RTC wake-up interrupt
										request RTC-WAKE which can also wake up the part from any
										low power mode. Writing a 1 clears this bit.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ALARMDPD_EN</name>
							<description>RTC 1 Hz timer alarm enable for Deep
								power-down.</description>
							<bitRange>[4:4]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>Disable. A match on the 1 Hz RTC timer will not
										bring the part out of Deep power-down mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>Enable. A match on the 1 Hz RTC timer bring the
										part out of Deep power-down mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WAKEDPD_EN</name>
							<description>RTC 1 kHz timer wake-up enable for Deep
								power-down.</description>
							<bitRange>[5:5]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>Disable. A match on the 1 kHz RTC timer will not
										bring the part out of Deep power-down mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>Enable. A match on the 1 kHz RTC timer bring the
										part out of Deep power-down mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RTC1KHZ_EN</name>
							<description>RTC 1 kHz clock enable. This bit can be set to 0 to
								conserve power if the 1 kHz timer is not used. This bit has no
								effect when the RTC is disabled (bit 7 of this register is
								0).</description>
							<bitRange>[6:6]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>Disable. A match on the 1 kHz RTC timer will not
										bring the part out of Deep power-down mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>Enable. The 1 kHz RTC timer is
										enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RTC_EN</name>
							<description>RTC enable.</description>
							<bitRange>[7:7]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>Disable. The RTC 1 Hz and 1 kHz clocks are shut
										down and the RTC operation is disabled. This bit should be 0
										when writing to load a value in the RTC counter
										register.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>Enable. The 1 Hz RTC clock is running and RTC
										operation is enabled. This bit must be set to initiate
										operation of the RTC. The first clock to the RTC counter
										occurs 1 s after this bit is set. To also enable the
										high-resolution, 1 kHz clock, set bit 6 in this
										register.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:8]</bitRange>

