cmsis-svd/cmsis-svd/data/NXP/LPC5410x_v0.4.svd
						</field>
					</fields>
				</register>
				<register>
					<name>MODCFG</name>
					<description>Module Configuration register. This register provides information
						about this particular MRT instance, and allows choosing an overall mode for
						the idle channel feature.</description>
					<addressOffset>0xF0</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>NOC</name>
							<description>Identifies the number of channels in this
								MRT.</description>
							<bitRange>[3:0]</bitRange>

						</field>
						<field>
							<name>NOB</name>
							<description>Identifies the number of timer bits in this
								MRT.</description>
							<bitRange>[8:4]</bitRange>

						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[30:9]</bitRange>

						</field>
						<field>
							<name>MULTITASK</name>
							<description>Selects the operating mode for the INUSE flags and the
								IDLE_CH register. See Idle channel register (IDLE_CH) for
								details.</description>
							<bitRange>[31:31]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>HARDWARE_STATUS_MODE</name>
									<description>Hardware status mode. In this mode, the INUSE(n)
										flags for all channels are reset.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MULTI_TASK_MODE</name>
									<description>Multi-task mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>IDLE_CH</name>
					<description>Idle channel register. This register returns the number of the
						first idle channel.</description>
					<addressOffset>0xF4</addressOffset>
					<access>read-only</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[3:0]</bitRange>
						</field>
						<field>
							<name>CHAN</name>
							<description>Idle channel. Reading the CHAN bits, returns the lowest
								idle timer channel. The number is positioned such that it can be
								used as an offset from the MRT base address in order to access the
								registers for the allocated channel. If all timer channels are
								running, CHAN = 0xF. See text above for more details.</description>
							<bitRange>[7:4]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[31:8]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>IRQ_FLAG</name>
					<description>Global interrupt flag register</description>
					<addressOffset>0xF8</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>GFLAG0</name>
							<description>Monitors the interrupt flag of TIMER0.</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NO_PENDING_INTERRUPT</name>
									<description>No pending interrupt. Writing a zero is equivalent
										to no operation.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PENDING_INTERRUPT</name>
									<description>Pending interrupt. The interrupt is pending because
										TIMER0 has reached the end of the time interval. If the
										INTEN bit in the CONTROL0 register is also set to 1, the
										interrupt for timer channel 0 and the global interrupt are
										raised. Writing a 1 to this bit clears the interrupt
										request.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>GFLAG1</name>
							<description>Monitors the interrupt flag of TIMER1. See description of
								channel 0.</description>
							<bitRange>[1:1]</bitRange>

						</field>
						<field>
							<name>GFLAG2</name>
							<description>Monitors the interrupt flag of TIMER2. See description of
								channel 0.</description>
							<bitRange>[2:2]</bitRange>

						</field>
						<field>
							<name>GFLAG3</name>
							<description>Monitors the interrupt flag of TIMER3. See description of
								channel 0.</description>
							<bitRange>[3:3]</bitRange>

						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:4]</bitRange>

						</field>
					</fields>
				</register>
			</registers>
		</peripheral>



		<peripheral>
			<name>ASYNCSYSCON</name>
			<description>Asynchronous system configuration</description>
			<groupName>ASYNCSYSCON</groupName>
			<baseAddress>0x40080000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x1000</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>AYSNCPRESETCTRL</name>
					<description>Async peripheral reset control</description>
					<addressOffset>0x000</addressOffset>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>USART0</name>
							<description>USART0 reset control. 0 = Clear reset to this function. 1 =
								Assert reset to this function.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>USART1</name>
							<description>USART1 reset control. 0 = Clear reset to this function. 1 =
								Assert reset to this function.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>USART2</name>
							<description>USART2 reset control.0 = Clear reset to this function. 1 =
								Assert reset to this function.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>USART3</name>
							<description>USART3 reset control. 0 = Clear reset to this function. 1 =
								Assert reset to this function.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>I2C0</name>
							<description>I2C0 reset control. 0 = Clear reset to this function. 1 =
								Assert reset to this function.</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>I2C1</name>
							<description>I2C1 reset control. 0 = Clear reset to this function. 1 =
								Assert reset to this function.</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>I2C2</name>
							<description>I2C2 reset control. 0 = Clear reset to this function. 1 =
								Assert reset to this function.</description>
							<bitRange>[7:7]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[8:8]</bitRange>
						</field>
						<field>
							<name>SPI0</name>
							<description>SPI0 reset control. 0 = Clear reset to this function. 1 =
								Assert reset to this function.</description>
							<bitRange>[9:9]</bitRange>
						</field>
						<field>
							<name>SPI1</name>
							<description>SPI1 reset control. 0 = Clear reset to this function. 1 =
								Assert reset to this function.</description>
							<bitRange>[10:10]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[12:11]</bitRange>
						</field>
						<field>
							<name>TIMER0</name>
							<description>Timer 0 reset control. 0 = Clear reset to this function. 1
								= Assert reset to this function.</description>
							<bitRange>[13:13]</bitRange>
						</field>
						<field>
							<name>TIMER1</name>
							<description>Timer 1 reset control. 0 = Clear reset to this function. 1
								= Assert reset to this function.</description>
							<bitRange>[14:14]</bitRange>
						</field>
						<field>
							<name>FRG0</name>
							<description>FRG reset control. 0 = Clear reset to this function. 1 =
								Assert reset to this function.</description>
							<bitRange>[15:15]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:16]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>AYSNCPRESETCTRLSET</name>
					<description>Set bits in AYSNCPRESETCTRL</description>
					<addressOffset>0x004</addressOffset>
					<access>write-only</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>ARST_SET</name>
							<description>Writing ones to this register sets the corresponding bit or
								bits in the AYSNCPRESETCTRL register, if they are implemented. Bits
								that do not correspond to defined bits in AYSNCPRESETCTRL are
								reserved and only zeroes should be written to them.</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>AYSNCPRESETCTRLCLR</name>
					<description>Clear bits in AYSNCPRESETCTRL</description>
					<addressOffset>0x008</addressOffset>
					<access>write-only</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>ARST_CLR</name>
							<description>Writing ones to this register clears the corresponding bit
								or bits in the AYSNCPRESETCTRL register, if they are implemented.
								Bits that do not correspond to defined bits in AYSNCPRESETCTRL are
								reserved and only zeroes should be written to them.</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>ASYNCAPBCLKCTRL</name>
					<description>Async peripheral clock control</description>
					<addressOffset>0x010</addressOffset>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>USART0</name>
							<description>Controls the clock for USART0. 0 = Disable; 1 =
								Enable.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>USART1</name>
							<description>Controls the clock for USART1. 0 = Disable; 1 =
								Enable.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>USART2</name>
							<description>Controls the clock for USART2. 0 = Disable; 1 =
								Enable.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>USART3</name>
							<description>Controls the clock for USART3. 0 = Disable; 1 =
								Enable.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>I2C0</name>
							<description>Controls the clock for I2C0. 0 = Disable; 1 =
								Enable.</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>I2C1</name>
							<description>Controls the clock for I2C1. 0 = Disable; 1 =
								Enable.</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>I2C2</name>
							<description>Controls the clock for I2C2. 0 = Disable; 1 =
								Enable.</description>
							<bitRange>[7:7]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[8:8]</bitRange>
						</field>
						<field>
							<name>SPI0</name>
							<description>Controls the clock for SPI0. 0 = Disable; 1 =
								Enable.</description>
							<bitRange>[9:9]</bitRange>
						</field>
						<field>
							<name>SPI1</name>
							<description>Controls the clock for SPI1. 0 = Disable; 1 =
								Enable.</description>
							<bitRange>[10:10]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[12:11]</bitRange>
						</field>
						<field>
							<name>TIMER0</name>
							<description>Controls the clock for TIMER0. 0 = Disable; 1 =
								Enable.</description>
							<bitRange>[13:13]</bitRange>
						</field>
						<field>
							<name>TIMER1</name>
							<description>Controls the clock for TIMER1. 0 = Disable; 1 =
								Enable.</description>
							<bitRange>[14:14]</bitRange>
						</field>
						<field>
							<name>FRG0</name>
							<description>Controls the clock for the Fractional Rate Generator used
								with the USARTs. 0 = Disable; 1 = Enable.</description>
							<bitRange>[15:15]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:16]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>ASYNCAPBCLKCTRLSET</name>
					<description>Set bits in ASYNCAPBCLKCTRL</description>
					<addressOffset>0x014</addressOffset>
					<access>write-only</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>ACLK_SET</name>
							<description>Writing ones to this register sets the corresponding bit or
								bits in the ASYNCAPBCLKCTRL register, if they are implemented. Bits
								that do not correspond to defined bits in AYSNCPRESETCTRL are
								reserved and only zeroes should be written to them.</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>ASYNCAPBCLKCTRLCLR</name>
					<description>Clear bits in ASYNCAPBCLKCTRL</description>
					<addressOffset>0x018</addressOffset>
					<access>write-only</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>ACLK_CLR</name>
							<description>Writing ones to this register clears the corresponding bit
								or bits in the ASYNCAPBCLKCTRL register, if they are implemented.
								Bits that do not correspond to defined bits in ASYNCAPBCLKCTRL are
								reserved and only zeroes should be written to them.</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>ASYNCAPBCLKSELA</name>
					<description>Async APB clock source select A</description>
					<addressOffset>0x020</addressOffset>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SEL</name>
							<description>Clock source for asynchronous clock source selector
								A</description>
							<bitRange>[1:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>IRC_OSCILLATOR</name>
									<description>IRC Oscillator</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>WATCHDOG_OSCILLATOR</name>
									<description>Watchdog oscillator</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RESERVED</name>
									<description>Reserved</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RESERVED</name>
									<description>Reserved</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:2]</bitRange>

