cmsis-svd/cmsis-svd/data/NXP/LPC5410x_v0.4.svd
						</field>
					</fields>
				</register>
				<register>
					<name>ASYNCAPBCLKSELB</name>
					<description>Async APB clock source select B</description>
					<addressOffset>0x024</addressOffset>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SEL</name>
							<description>Clock source for asynchronous clock source selector
								B.</description>
							<bitRange>[1:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>MAIN_CLOCK</name>
									<description>Main clock</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CLKIN</name>
									<description>CLKIN</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SYSTEM_PLL_OUTPUT</name>
									<description>System PLL output.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ASYNCAPBCLKSELA</name>
									<description>ASYNCAPBCLKSELA. Clock selected by the
										ASYNCAPBCLKSELA register.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:2]</bitRange>

						</field>
					</fields>
				</register>
				<register>
					<name>ASYNCCLKDIV</name>
					<description>Async APB clock divider</description>
					<addressOffset>0x028</addressOffset>
					<access>read-write</access>
					<resetValue>0x1</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DIV</name>
							<description>Asynchronous APB clock divider value. 0: Clock disabled. 1:
								Divide by 1. to 255: Divide by 255.</description>
							<bitRange>[7:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:8]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>FRGCTRL</name>
					<description>USART fractional rate generator control</description>
					<addressOffset>0x030</addressOffset>
					<access>read-write</access>
					<resetValue>0xFF</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DIV</name>
							<description>Denominator of the fractional divider. DIV is equal to the
								programmed value +1. Always set to 0xFF to use with the fractional
								baud rate generator.</description>
							<bitRange>[7:0]</bitRange>
						</field>
						<field>
							<name>MULT</name>
							<description>Numerator of the fractional divider. MULT is equal to the
								programmed value.</description>
							<bitRange>[15:8]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:16]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>BODCTRL</name>
					<description>Brown-Out Detect control</description>
					<addressOffset>0x44</addressOffset>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>BODRSTLEV</name>
							<description>BOD reset level</description>
							<bitRange>[1:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>LEVEL_0_1</name>
									<description>Level 0: 1.5 V</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LEVEL_1_1</name>
									<description>Level 1: 1.85 V</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LEVEL_2_2</name>
									<description>Level 2: 2.0 V</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LEVEL_3_2</name>
									<description>Level 3: 2.3 V</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BODINTVAL</name>
							<description>BOD interrupt level</description>
							<bitRange>[3:2]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>LEVEL_0_2</name>
									<description>Level 0: 2.05 V</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LEVEL_1_2</name>
									<description>Level 1: 2.45 V</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LEVEL_2_2</name>
									<description>Level 2: 2.75 V</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LEVEL_3_3</name>
									<description>Level 3: 3.05 V</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BODRSTENA</name>
							<description>BOD reset enable</description>
							<bitRange>[4:4]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLE_RESET_FUNCTI</name>
									<description>Disable reset function.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE_RESET_FUNCTIO</name>
									<description>Enable reset function.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:5]</bitRange>

						</field>
					</fields>
				</register>
			</registers>
		</peripheral>

		<peripheral>
			<name>USART0</name>
			<description>USART0 </description>
			<groupName>USART0</groupName>
			<baseAddress>0x40084000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x1000</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>UART0</name>
				<value>17</value>
			</interrupt>
			<registers>
				<register>
					<name>CFG</name>
					<description>USART Configuration register. Basic USART configuration settings
						that typically are not changed during operation.</description>
					<addressOffset>0x00</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>ENABLE</name>
							<description>USART Enable.</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled. The USART is disabled and the internal
										state machine and counters are reset. While Enable = 0, all
										USART interrupts and DMA transfers are disabled. When Enable
										is set again, CFG and most other control bits remain
										unchanged. For instance, when re-enabled, the USART will
										immediately generate a TxRdy interrupt (if enabled in the
										INTENSET register) or a DMA transfer request because the
										transmitter has been reset and is therefore
										available.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enabled. The USART is enabled for
										operation.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[1:1]</bitRange>

