cmsis-svd/cmsis-svd/data/NXP/LPC5410x_v0.4.svd
						</field>
						<field>
							<name>DATALEN</name>
							<description>Selects the data size for the USART.</description>
							<bitRange>[3:2]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>7_BIT_DATA_LENGTH</name>
									<description>7 bit Data length.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>8_BIT_DATA_LENGTH</name>
									<description>8 bit Data length.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>9_BIT_DATA_LENGTH</name>
									<description>9 bit data length. The 9th bit is commonly used for
										addressing in multidrop mode. See the ADDRDET bit in the CTL
										register.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RESERVED</name>
									<description>Reserved.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PARITYSEL</name>
							<description>Selects what type of parity is used by the
								USART.</description>
							<bitRange>[5:4]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NO_PARITY</name>
									<description>No parity.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RESERVED</name>
									<description>Reserved.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EVEN_PARITY</name>
									<description>Even parity. Adds a bit to each character such that
										the number of 1s in a transmitted character is even, and the
										number of 1s in a received character is expected to be
										even.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ODD_PARITY</name>
									<description>Odd parity. Adds a bit to each character such that
										the number of 1s in a transmitted character is odd, and the
										number of 1s in a received character is expected to be
										odd.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>STOPLEN</name>
							<description>Number of stop bits appended to transmitted data. Only a
								single stop bit is required for received data.</description>
							<bitRange>[6:6]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>1_STOP_BIT</name>
									<description>1 stop bit.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>2_STOP_BITS</name>
									<description>2 stop bits. This setting should only be used for
										asynchronous communication.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MODE32K</name>
							<description>Selects standard or 32 kHz clocking mode.</description>
							<bitRange>[7:7]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled. USART uses standard
										clocking.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enabled. USART uses the 32 kHz clock from the RTC
										oscillator as the clock source to the BRG, and uses a
										special bit clocking scheme.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LINMODE</name>
							<description>LIN break mode enable.</description>
							<bitRange>[8:8]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled. Break detect and generate is configured
										for normal operation.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enabled. Break detect and generate is configured
										for LIN bus operation.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CTSEN</name>
							<description>CTS Enable. Determines whether CTS is used for flow
								control. CTS can be from the input pin, or from the USART's own RTS
								if loopback mode is enabled.</description>
							<bitRange>[9:9]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NO_FLOW_CONTROL</name>
									<description>No flow control. The transmitter does not receive
										any automatic flow control signal.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FLOW_CONTROL_ENABLED</name>
									<description>Flow control enabled. The transmitter uses the CTS
										input (or RTS output in loopback mode) for flow control
										purposes.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[10:10]</bitRange>

						</field>
						<field>
							<name>SYNCEN</name>
							<description>Selects synchronous or asynchronous
								operation.</description>
							<bitRange>[11:11]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>ASYNCHRONOUS_MODE</name>
									<description>Asynchronous mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SYNCHRONOUS_MODE</name>
									<description>Synchronous mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CLKPOL</name>
							<description>Selects the clock polarity and sampling edge of received
								data in synchronous mode.</description>
							<bitRange>[12:12]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>FALLING_EDGE</name>
									<description>Falling edge. Un_RXD is sampled on the falling edge
										of SCLK.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RISING_EDGE</name>
									<description>Rising edge. Un_RXD is sampled on the rising edge
										of SCLK.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[13:13]</bitRange>

