cmsis-svd/cmsis-svd/data/NXP/LPC5410x_v0.4.svd
						</field>
					</fields>
				</register>
				<register>
					<name>STAT</name>
					<description>Status register for Master, Slave, and Monitor
						functions.</description>
					<addressOffset>0x04</addressOffset>
					<access>read-write</access>
					<resetValue>0x0801</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>MSTPENDING</name>
							<description>Master Pending. Indicates that the Master is waiting to
								continue communication on the I2C-bus (pending) or is idle. When the
								master is pending, the MSTSTATE bits indicate what type of software
								service if any the master expects. This flag will cause an interrupt
								when set if, enabled via the INTENSET register. The MSTPENDING flag
								is not set when the DMA is handling an event (if the MSTDMA bit in
								the MSTCTL register is set). If the master is in the idle state, and
								no communication is needed, mask this interrupt.</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>IN_PROGRESS</name>
									<description>In progress. Communication is in progress and the
										Master function is busy and cannot currently accept a
										command.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PENDING</name>
									<description>Pending. The Master function needs software service
										or is in the idle state. If the master is not in the idle
										state, it is waiting to receive or transmit data or the NACK
										bit.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MSTSTATE</name>
							<description>Master State code. The master state code reflects the
								master state when the MSTPENDING bit is set, that is the master is
								pending or in the idle state. Each value of this field indicates a
								specific required service for the Master function. All other values
								are reserved. See Table 346 for details of state values and
								appropriate responses.</description>
							<bitRange>[3:1]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>IDLE</name>
									<description>Idle. The Master function is available to be used
										for a new transaction.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RECEIVE_READY</name>
									<description>Receive ready. Received data available (Master
										Receiver mode). Address plus Read was previously sent and
										Acknowledged by slave.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TRANSMIT_READY</name>
									<description>Transmit ready. Data can be transmitted (Master
										Transmitter mode). Address plus Write was previously sent
										and Acknowledged by slave.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>NACK_ADDRESS</name>
									<description>NACK Address. Slave NACKed address.</description>
									<value>0x3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>NACK_DATA</name>
									<description>NACK Data. Slave NACKed transmitted
										data.</description>
									<value>0x4</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MSTARBLOSS</name>
							<description>Master Arbitration Loss flag. This flag can be cleared by
								software writing a 1 to this bit. It is also cleared automatically a
								1 is written to MSTCONTINUE.</description>
							<bitRange>[4:4]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NO_ARBITRATION_LOSS</name>
									<description>No Arbitration Loss has occurred.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ARBITRATION_LOSS</name>
									<description>Arbitration loss. The Master function has
										experienced an Arbitration Loss. At this point, the Master
										function has already stopped driving the bus and gone to an
										idle state. Software can respond by doing nothing, or by
										sending a Start in order to attempt to gain control of the
										bus when it next becomes idle.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[5:5]</bitRange>

						</field>
						<field>
							<name>MSTSTSTPERR</name>
							<description>Master Start/Stop Error flag. This flag can be cleared by
								software writing a 1 to this bit. It is also cleared automatically a
								1 is written to MSTCONTINUE.</description>
							<bitRange>[6:6]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NO_STARTSTOP_ERROR</name>
									<description>No Start/Stop Error has occurred.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>THE_MASTER_FUNCTION</name>
									<description>The Master function has experienced a Start/Stop
										Error. A Start or Stop was detected at a time when it is not
										allowed by the I2C specification. The Master interface has
										stopped driving the bus and gone to an idle state, no action
										is required. A request for a Start could be made, or
										software could attempt to insure that the bus has not
										stalled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[7:7]</bitRange>

