cmsis-svd/cmsis-svd/data/NXP/LPC5410x_v0.4.svd
						</field>
						<field>
							<name>SLVPENDING</name>
							<description>Slave Pending. Indicates that the Slave function is waiting
								to continue communication on the I2C-bus and needs software service.
								This flag will cause an interrupt when set if enabled via INTENSET.
								The SLVPENDING flag is not set when the DMA is handling an event (if
								the SLVDMA bit in the SLVCTL register is set). The SLVPENDING flag
								is read-only and is automatically cleared when a 1 is written to the
								SLVCONTINUE bit in the MSTCTL register. The point in time when
								SlvPending is set depends on whether the I2C block is in HSCAPABLE
								mode. See Section 23.7.1.2.2. When the I2C block is configured to be
								HSCAPABLE, HS master codes are detected automatically. Due to the
								requirements of the HS I2C specification, slave addresses must also
								be detected automatically, since the address must be acknowledged
								before the clock can be stretched.</description>
							<bitRange>[8:8]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>IN_PROGRESS</name>
									<description>In progress. The Slave function does not currently
										need service.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PENDING</name>
									<description>Pending. The Slave function needs service.
										Information on what is needed can be found in the adjacent
										SLVSTATE field.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SLVSTATE</name>
							<description>Slave State code. Each value of this field indicates a
								specific required service for the Slave function. All other values
								are reserved. See Table 347 for state values and
								actions.</description>
							<bitRange>[10:9]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>SLAVE_ADDRESS</name>
									<description>Slave address. Address plus R/W received. At least
										one of the four slave addresses has been matched by
										hardware.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SLAVE_RECEIVE</name>
									<description>Slave receive. Received data is available (Slave
										Receiver mode).</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SLAVE_TRANSMIT</name>
									<description>Slave transmit. Data can be transmitted (Slave
										Transmitter mode).</description>
									<value>0x2</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SLVNOTSTR</name>
							<description>Slave Not Stretching. Indicates when the slave function is
								stretching the I2C clock. This is needed in order to gracefully
								invoke Deep Sleep or Power-down modes during slave operation. This
								read-only flag reflects the slave function status in real
								time.</description>
							<bitRange>[11:11]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>STRETCHING</name>
									<description>Stretching. The slave function is currently
										stretching the I2C bus clock. Deep-Sleep or Power-down mode
										cannot be entered at this time.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>NOT_STRETCHING</name>
									<description>Not stretching. The slave function is not currently
										stretching the I 2C bus clock. Deep-sleep or Power-down mode
										could be entered at this time.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SLVIDX</name>
							<description>Slave address match Index. This field is valid when the I2C
								slave function has been selected by receiving an address that
								matches one of the slave addresses defined by any enabled slave
								address registers, and provides an identification of the address
								that was matched. It is possible that more than one address could be
								matched, but only one match can be reported here.</description>
							<bitRange>[13:12]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>ADDRESS_0</name>
									<description>Address 0. Slave address 0 was
										matched.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADDRESS_1</name>
									<description>Address 1. Slave address 1 was
										matched.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADDRESS_2</name>
									<description>Address 2. Slave address 2 was
										matched.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADDRESS_3</name>
									<description>Address 3. Slave address 3 was
										matched.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SLVSEL</name>
							<description>Slave selected flag. SLVSEL is set after an address match
								when software tells the Slave function to acknowledge the address.
								It is cleared when another address cycle presents an address that
								does not match an enabled address on the Slave function, when slave
								software decides to NACK a matched address, or when there is a Stop
								detected on the bus. SLVSEL is not cleared if software NACKs
								data.</description>
							<bitRange>[14:14]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NOT_SELECTED</name>
									<description>Not selected. The Slave function is not currently
										selected.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SELECTED</name>
									<description>Selected. The Slave function is currently
										selected.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SLVDESEL</name>
							<description>Slave Deselected flag. This flag will cause an interrupt
								when set if enabled via INTENSET. This flag can be cleared by
								writing a 1 to this bit.</description>
							<bitRange>[15:15]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NOT_DESELECTED</name>
									<description>Not deselected. The Slave function has not become
										deselected. This does not mean that it is currently
										selected. That information can be found in the SLVSEL
										flag.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DESELECTED</name>
									<description>Deselected. The Slave function has become
										deselected. This is specifically caused by the SLVSEL flag
										changing from 1 to 0. See the description of SLVSEL for
										details on when that event occurs.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MONRDY</name>
							<description>Monitor Ready. This flag is cleared when the MONRXDAT
								register is read.</description>
							<bitRange>[16:16]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NO_DATA</name>
									<description>No data. The Monitor function does not currently
										have data available.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DATA_WAITING</name>
									<description>Data waiting. The Monitor function has data waiting
										to be read.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MONOV</name>
							<description>Monitor Overflow flag.</description>
							<bitRange>[17:17]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NO_OVERRUN</name>
									<description>No overrun. Monitor data has not
										overrun.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>OVERRUN</name>
									<description>Overrun. A Monitor data overrun has occurred. This
										can only happen when Monitor clock stretching not enabled
										via the MONCLKSTR bit in the CFG register. Writing 1 to this
										bit clears the flag.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MONACTIVE</name>
							<description>Monitor Active flag. Indicates when the Monitor function
								considers the I 2C bus to be active. Active is defined here as when
								some Master is on the bus: a bus Start has occurred more recently
								than a bus Stop.</description>
							<bitRange>[18:18]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>Inactive. The Monitor function considers the I2C
										bus to be inactive.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>Active. The Monitor function considers the I2C bus
										to be active.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MONIDLE</name>
							<description>Monitor Idle flag. This flag is set when the Monitor
								function sees the I2C bus change from active to inactive. This can
								be used by software to decide when to process data accumulated by
								the Monitor function. This flag will cause an interrupt when set if
								enabled via the INTENSET register. The flag can be cleared by
								writing a 1 to this bit.</description>
							<bitRange>[19:19]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NOT_IDLE</name>
									<description>Not idle. The I2C bus is not idle, or this flag has
										been cleared by software.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>IDLE</name>
									<description>Idle. The I2C bus has gone idle at least once since
										the last time this flag was cleared by
										software.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[23:20]</bitRange>

