cmsis-svd/cmsis-svd/data/NXP/LPC5410x_v0.4.svd
						</field>
						<field>
							<name>SLVDESELEN</name>
							<description>Slave Deselect interrupt Enable.</description>
							<bitRange>[15:15]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled. The SlvDeSel interrupt is
										disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enabled. The SlvDeSel interrupt is
										enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MONRDYEN</name>
							<description>Monitor data Ready interrupt Enable.</description>
							<bitRange>[16:16]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled. The MonRdy interrupt is
										disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enabled. The MonRdy interrupt is
										enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MONOVEN</name>
							<description>Monitor Overrun interrupt Enable.</description>
							<bitRange>[17:17]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled. The MonOv interrupt is
										disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enabled. The MonOv interrupt is
										enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[18:18]</bitRange>

						</field>
						<field>
							<name>MONIDLEEN</name>
							<description>Monitor Idle interrupt Enable.</description>
							<bitRange>[19:19]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled. The MonIdle interrupt is
										disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enabled. The MonIdle interrupt is
										enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[23:20]</bitRange>

						</field>
						<field>
							<name>EVENTTIMEOUTEN</name>
							<description>Event time-out interrupt Enable.</description>
							<bitRange>[24:24]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled. The Event time-out interrupt is
										disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enabled. The Event time-out interrupt is
										enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SCLTIMEOUTEN</name>
							<description>SCL time-out interrupt Enable.</description>
							<bitRange>[25:25]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled. The SCL time-out interrupt is
										disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enabled. The SCL time-out interrupt is
										enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:26]</bitRange>

						</field>
					</fields>
				</register>
				<register>
					<name>INTENCLR</name>
					<description>Interrupt Enable Clear register.</description>
					<addressOffset>0x0C</addressOffset>
					<access>write-only</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>MSTPENDINGCLR</name>
							<description>Master Pending interrupt clear. Writing 1 to this bit
								clears the corresponding bit in the INTENSET register if
								implemented.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[3:1]</bitRange>
						</field>
						<field>
							<name>MSTARBLOSSCLR</name>
							<description>Master Arbitration Loss interrupt clear.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>MSTSTSTPERRCLR</name>
							<description>Master Start/Stop Error interrupt clear.</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[7:7]</bitRange>
						</field>
						<field>
							<name>SLVPENDINGCLR</name>
							<description>Slave Pending interrupt clear.</description>
							<bitRange>[8:8]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[10:9]</bitRange>
						</field>
						<field>
							<name>SLVNOTSTRCLR</name>
							<description>Slave Not Stretching interrupt clear.</description>
							<bitRange>[11:11]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[14:12]</bitRange>
						</field>
						<field>
							<name>SLVDESELCLR</name>
							<description>Slave Deselect interrupt clear.</description>
							<bitRange>[15:15]</bitRange>
						</field>
						<field>
							<name>MONRDYCLR</name>
							<description>Monitor data Ready interrupt clear.</description>
							<bitRange>[16:16]</bitRange>
						</field>
						<field>
							<name>MONOVCLR</name>
							<description>Monitor Overrun interrupt clear.</description>
							<bitRange>[17:17]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[18:18]</bitRange>
						</field>
						<field>
							<name>MONIDLECLR</name>
							<description>Monitor Idle interrupt clear.</description>
							<bitRange>[19:19]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[23:20]</bitRange>
						</field>
						<field>
							<name>EVENTTIMEOUTCLR</name>
							<description>Event time-out interrupt clear.</description>
							<bitRange>[24:24]</bitRange>
						</field>
						<field>
							<name>SCLTIMEOUTCLR</name>
							<description>SCL time-out interrupt clear.</description>
							<bitRange>[25:25]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:26]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>TIMEOUT</name>
					<description>Time-out value register.</description>
					<addressOffset>0x10</addressOffset>
					<access>read-write</access>
					<resetValue>0xFFFF</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>TOMIN</name>
							<description>Time-out time value, bottom four bits. These are hard-wired
								to 0xF. This gives a minimum time-out of 16 I2C function clocks and
								also a time-out resolution of 16 I2C function clocks.</description>
							<bitRange>[3:0]</bitRange>
						</field>
						<field>
							<name>TO</name>
							<description>Time-out time value. Specifies the time-out interval value
								in increments of 16 I2C function clocks, as defined by the CLKDIV
								register. To change this value while I 2C is in operation, disable
								all time-outs, write a new value to TIMEOUT, then re-enable
								time-outs. 0x000 = A time-out will occur after 16 counts of the I2C
								function clock. 0x001 = A time-out will occur after 32 counts of the
								I2C function clock. ... 0xFFF = A time-out will occur after 65,536
								counts of the I2C function clock.</description>
							<bitRange>[15:4]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:16]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>CLKDIV</name>
					<description>Clock pre-divider for the entire I2C block. This determines what
						time increments are used for the MSTTIME register, and controls some timing
						of the Slave function.</description>
					<addressOffset>0x14</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DIVVAL</name>
							<description>This field controls how the clock (PCLK) is used by the I2C
								functions that need an internal clock in order to operate. 0x0000 =
								PCLK is used directly by the I2C. 0x0001 = PCLK is divided by 2
								before use. 0x0002 = PCLK is divided by 3 before use. ... 0xFFFF =
								PCLK is divided by 65,536 before use.</description>
							<bitRange>[15:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:16]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>INTSTAT</name>
					<description>Interrupt Status register for Master, Slave, and Monitor
						functions.</description>
					<addressOffset>0x18</addressOffset>
					<access>read-only</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>MSTPENDING</name>
							<description>Master Pending.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[3:1]</bitRange>
						</field>
						<field>
							<name>MSTARBLOSS</name>
							<description>Master Arbitration Loss flag.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>MSTSTSTPERR</name>
							<description>Master Start/Stop Error flag.</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[7:7]</bitRange>
						</field>
						<field>
							<name>SLVPENDING</name>
							<description>Slave Pending.</description>
							<bitRange>[8:8]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[10:9]</bitRange>
						</field>
						<field>
							<name>SLVNOTSTR</name>
							<description>Slave Not Stretching status.</description>
							<bitRange>[11:11]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[14:12]</bitRange>
						</field>
						<field>
							<name>SLVDESEL</name>
							<description>Slave Deselected flag.</description>
							<bitRange>[15:15]</bitRange>
						</field>
						<field>
							<name>MONRDY</name>
							<description>Monitor Ready.</description>
							<bitRange>[16:16]</bitRange>
						</field>
						<field>
							<name>MONOV</name>
							<description>Monitor Overflow flag.</description>
							<bitRange>[17:17]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[18:18]</bitRange>
						</field>
						<field>
							<name>MONIDLE</name>
							<description>Monitor Idle flag.</description>
							<bitRange>[19:19]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[23:20]</bitRange>
						</field>
						<field>
							<name>EVENTTIMEOUT</name>
							<description>Event time-out Interrupt flag.</description>
							<bitRange>[24:24]</bitRange>
						</field>
						<field>
							<name>SCLTIMEOUT</name>
							<description>SCL time-out Interrupt flag.</description>
							<bitRange>[25:25]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:26]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>MSTCTL</name>
					<description>Master control register.</description>
					<addressOffset>0x20</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>MSTCONTINUE</name>
							<description>Master Continue. This bit is write-only.</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NO_EFFECT</name>
									<description>No effect.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CONTINUE</name>
									<description>Continue. Informs the Master function to continue
										to the next operation. This must done after writing transmit
										data, reading received data, or any other housekeeping
										related to the next bus operation.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MSTSTART</name>
							<description>Master Start control. This bit is write-only.</description>
							<bitRange>[1:1]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NO_EFFECT</name>
									<description>No effect.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>START</name>
									<description>Start. A Start will be generated on the I2C bus at
										the next allowed time.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MSTSTOP</name>
							<description>Master Stop control. This bit is write-only.</description>
							<bitRange>[2:2]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NO_EFFECT</name>
									<description>No effect.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>STOP</name>
									<description>Stop. A Stop will be generated on the I2C bus at
										the next allowed time, preceded by a NACK to the slave if
										the master is receiving data from the slave (Master Receiver
										mode).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MSTDMA</name>
							<description>Master DMA enable. Data operations of the I2C can be
								performed with DMA. Protocol type operations such as Start, address,
								Stop, and address match must always be done with software, typically
								via an interrupt. When a DMA data transfer is complete, MSTDMA must
								be cleared prior to beginning the next operation, typically a Start
								or Stop.This bit is read/write.</description>
							<bitRange>[3:3]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>Disable. No DMA requests are generated for master
										operation.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>Enable. A DMA request is generated for I2C master
										data operations. When this I2C master is generating
										Acknowledge bits in Master Receiver mode, the acknowledge is
										generated automatically.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:4]</bitRange>

