cmsis-svd/cmsis-svd/data/NXP/LPC5410x_v0.4.svd
						</field>
					</fields>
				</register>
				<register>
					<name>MSTTIME</name>
					<description>Master timing configuration.</description>
					<addressOffset>0x24</addressOffset>
					<access>read-write</access>
					<resetValue>0x77</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>MSTSCLLOW</name>
							<description>Master SCL Low time. Specifies the minimum low time that
								will be asserted by this master on SCL. Other devices on the bus
								(masters or slaves) could lengthen this time. This corresponds to
								the parameter tLOW in the I2C bus specification. I2C bus
								specification parameters tBUF and t SU;STA have the same values and
								are also controlled by MSTSCLLOW.</description>
							<bitRange>[2:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>2_CLOCKS</name>
									<description>2 clocks. Minimum SCL low time is 2 clocks of the
										I2C clock pre-divider.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>3_CLOCKS</name>
									<description>3 clocks. Minimum SCL low time is 3 clocks of the
										I2C clock pre-divider.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>4_CLOCKS</name>
									<description>4 clocks. Minimum SCL low time is 4 clocks of the
										I2C clock pre-divider.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>5_CLOCKS</name>
									<description>5 clocks. Minimum SCL low time is 5 clocks of the
										I2C clock pre-divider.</description>
									<value>0x3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>6_CLOCKS</name>
									<description>6 clocks. Minimum SCL low time is 6 clocks of the
										I2C clock pre-divider.</description>
									<value>0x4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>7_CLOCKS</name>
									<description>7 clocks. Minimum SCL low time is 7 clocks of the
										I2C clock pre-divider.</description>
									<value>0x5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>8_CLOCKS</name>
									<description>8 clocks. Minimum SCL low time is 8 clocks of the
										I2C clock pre-divider.</description>
									<value>0x6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>9_CLOCKS</name>
									<description>9 clocks. Minimum SCL low time is 9 clocks of the
										I2C clock pre-divider.</description>
									<value>0x7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[3:3]</bitRange>

						</field>
						<field>
							<name>MSTSCLHIGH</name>
							<description>Master SCL High time. Specifies the minimum high time that
								will be asserted by this master on SCL. Other masters in a
								multi-master system could shorten this time. This corresponds to the
								parameter tHIGH in the I2C bus specification. I2C bus specification
								parameters tSU;STO and tHD;STA have the same values and are also
								controlled by MSTSCLHIGH.</description>
							<bitRange>[6:4]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>2_CLOCKS</name>
									<description>2 clocks. Minimum SCL high time is 2 clock of the
										I2C clock pre-divider.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>3_CLOCKS</name>
									<description>3 clocks. Minimum SCL high time is 3 clocks of the
										I2C clock pre-divider .</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>4_CLOCKS</name>
									<description>4 clocks. Minimum SCL high time is 4 clock of the
										I2C clock pre-divider.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>5_CLOCKS</name>
									<description>5 clocks. Minimum SCL high time is 5 clock of the
										I2C clock pre-divider.</description>
									<value>0x3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>6_CLOCKS</name>
									<description>6 clocks. Minimum SCL high time is 6 clock of the
										I2C clock pre-divider.</description>
									<value>0x4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>7_CLOCKS</name>
									<description>7 clocks. Minimum SCL high time is 7 clock of the
										I2C clock pre-divider.</description>
									<value>0x5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>8_CLOCKS</name>
									<description>8 clocks. Minimum SCL high time is 8 clock of the
										I2C clock pre-divider.</description>
									<value>0x6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>9_CLOCKS</name>
									<description>9 clocks. Minimum SCL high time is 9 clocks of the
										I2C clock pre-divider.</description>
									<value>0x7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:7]</bitRange>

						</field>
					</fields>
				</register>
				<register>
					<name>MSTDAT</name>
					<description>Combined Master receiver and transmitter data
						register.</description>
					<addressOffset>0x28</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>DATA</name>
							<description>Master function data register. Read: read the most recently
								received data for the Master function. Write: transmit data using
								the Master function.</description>
							<bitRange>[7:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:8]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>SLVCTL</name>
					<description>Slave control register.</description>
					<addressOffset>0x40</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SLVCONTINUE</name>
							<description>Slave Continue.</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NO_EFFECT</name>
									<description>No effect.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CONTINUE</name>
									<description>Continue. Informs the Slave function to continue to
										the next operation. This must be done after writing transmit
										data, reading received data, or any other housekeeping
										related to the next bus operation.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SLVNACK</name>
							<description>Slave NACK.</description>
							<bitRange>[1:1]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NO_EFFECT</name>
									<description>No effect.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>NACK</name>
									<description>NACK. Causes the Slave function to NACK the master
										when the slave is receiving data from the master (Slave
										Receiver mode).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SLVDMA</name>
							<description>Slave DMA enable.</description>
							<bitRange>[3:3]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled. No DMA requests are issued for Slave mode
										operation.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enabled. DMA requests are issued for I2C slave data
										transmission and reception.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:4]</bitRange>

