cmsis-svd/cmsis-svd/data/NXP/LPC5410x_v0.4.svd
						</field>
					</fields>
				</register>
				<register>
					<name>SLVDAT</name>
					<description>Combined Slave receiver and transmitter data
						register.</description>
					<addressOffset>0x44</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>DATA</name>
							<description>Slave function data register. Read: read the most recently
								received data for the Slave function. Write: transmit data using the
								Slave function.</description>
							<bitRange>[7:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:8]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<dim>4</dim>
					<dimIncrement>0x4</dimIncrement>
					<dimIndex>0-3</dimIndex>
					<name>SLVADR%s</name>
					<description>Slave address 0.</description>
					<addressOffset>0x48</addressOffset>
					<access>read-write</access>
					<resetValue>0x01</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SADISABLE</name>
							<description>Slave Address n Disable.</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enabled. Slave Address n is enabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>IGNORED_SLAVE_ADDRES</name>
									<description>Ignored Slave Address n is ignored.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SLVADR</name>
							<description>Slave Address. Seven bit slave address that is compared to
								received addresses if enabled.</description>
							<bitRange>[7:1]</bitRange>

						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:8]</bitRange>

						</field>
					</fields>
				</register>
				<register>
					<name>SLVQUAL0</name>
					<description>Slave Qualification for address 0.</description>
					<addressOffset>0x58</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>QUALMODE0</name>
							<description>Qualify mode for slave address 0.</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>MASK</name>
									<description>Mask. The SLVQUAL0 field is used as a logical mask
										for matching address 0.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EXTEND</name>
									<description>Extend. The SLVQUAL0 field is used to extend
										address 0 matching in a range of addresses.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SLVQUAL0</name>
							<description>Slave address Qualifier for address 0. A value of 0 causes
								the address in SLVADR0 to be used as-is, assuming that it is
								enabled. If QUALMODE0 = 0, any bit in this field which is set to 1
								will cause an automatic match of the corresponding bit of the
								received address when it is compared to the SLVADR0 register. If
								QUALMODE0 = 1, an address range is matched for address 0. This range
								extends from the value defined by SLVADR0 to the address defined by
								SLVQUAL0 (address matches when SLVADR0[7:1] &lt;= received address
								&lt;= SLVQUAL0[7:1]).</description>
							<bitRange>[7:1]</bitRange>

						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:8]</bitRange>

						</field>
					</fields>
				</register>
				<register>
					<name>MONRXDAT</name>
					<description>Monitor receiver data register.</description>
					<addressOffset>0x80</addressOffset>
					<access>read-only</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>MONRXDAT</name>
							<description>Monitor function Receiver Data. This reflects every data
								byte that passes on the I2C pins.</description>
							<bitRange>[7:0]</bitRange>

						</field>
						<field>
							<name>MONSTART</name>
							<description>Monitor Received Start.</description>
							<bitRange>[8:8]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NO_START_DETECTED</name>
									<description>No start detected. The monitor function has not
										detected a Start event on the I2C bus.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>START_DETECTED</name>
									<description>Start detected. The monitor function has detected a
										Start event on the I2C bus.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MONRESTART</name>
							<description>Monitor Received Repeated Start.</description>
							<bitRange>[9:9]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NO_REPEATED_START_DE</name>
									<description>No repeated start detected. The monitor function
										has not detected a Repeated Start event on the I2C
										bus.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>REPEATED_START_DETEC</name>
									<description>Repeated start detected. The monitor function has
										detected a Repeated Start event on the I2C
										bus.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MONNACK</name>
							<description>Monitor Received NACK.</description>
							<bitRange>[10:10]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>ACKNOWLEDGED</name>
									<description>Acknowledged. The data currently being provided by
										the monitor function was acknowledged by at least one master
										or slave receiver.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>NOT_ACKNOWLEDGED</name>
									<description>Not acknowledged. The data currently being provided
										by the monitor function was not acknowledged by any
										receiver.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:11]</bitRange>

