cmsis-svd/cmsis-svd/data/NXP/LPC5410x_v0.4.svd
						</field>
					</fields>
				</register>
			</registers>

		</peripheral>
		<peripheral derivedFrom="I2C0">
			<name>I2C1</name>
			<description>I2C-bus interface 1</description>
			<baseAddress>0x40098000</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0x1000</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>I2C1</name>
				<value>22</value>
			</interrupt>

		</peripheral>
		<peripheral derivedFrom="I2C0">
			<name>I2C2</name>
			<description>I2C-bus interface 2</description>
			<baseAddress>0x4009C000</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0x1000</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>I2C2</name>
				<value>23</value>
			</interrupt>

		</peripheral>

		<peripheral>
			<name>SPI0</name>
			<description>SPI0</description>
			<groupName>SPI0</groupName>
			<baseAddress>0x400A4000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x1000</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>SPI0</name>
				<value>24</value>
			</interrupt>


			<registers>
				<register>
					<name>CFG</name>
					<description>SPI Configuration register</description>
					<addressOffset>0x00</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>ENABLE</name>
							<description>SPI enable.</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled. The SPI is disabled and the internal
										state machine and counters are reset.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enabled. The SPI is enabled for
										operation.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[1:1]</bitRange>

						</field>
						<field>
							<name>MASTER</name>
							<description>Master mode select.</description>
							<bitRange>[2:2]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>SLAVE_MODE</name>
									<description>Slave mode. The SPI will operate in slave mode.
										SCK, MOSI, and the SSEL signals are inputs, MISO is an
										output.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MASTER_MODE</name>
									<description>Master mode. The SPI will operate in master mode.
										SCK, MOSI, and the SSEL signals are outputs, MISO is an
										input.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LSBF</name>
							<description>LSB First mode enable.</description>
							<bitRange>[3:3]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>STANDARD</name>
									<description>Standard. Data is transmitted and received in
										standard MSB first order.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>REVERSE</name>
									<description>Reverse. Data is transmitted and received in
										reverse order (LSB first).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CPHA</name>
							<description>Clock Phase select.</description>
							<bitRange>[4:4]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>CHANGE</name>
									<description>Change. The SPI captures serial data on the first
										clock transition of the transfer (when the clock changes
										away from the rest state). Data is changed on the following
										edge.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CAPTURE</name>
									<description>Capture. The SPI changes serial data on the first
										clock transition of the transfer (when the clock changes
										away from the rest state). Data is captured on the following
										edge.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CPOL</name>
							<description>Clock Polarity select.</description>
							<bitRange>[5:5]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>LOW</name>
									<description>Low. The rest state of the clock (between
										transfers) is low.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGH</name>
									<description>High. The rest state of the clock (between
										transfers) is high.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[6:6]</bitRange>

						</field>
						<field>
							<name>LOOP</name>
							<description>Loopback mode enable. Loopback mode applies only to Master
								mode, and connects transmit and receive data connected together to
								allow simple software testing.</description>
							<bitRange>[7:7]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SPOL0</name>
							<description>SSEL0 Polarity select.</description>
							<bitRange>[8:8]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>LOW</name>
									<description>Low. The SSEL0 pin is active low. The value in the
										SSEL0 fields of the RXDAT, TXDATCTL, and TXCTL registers
										related to SSEL0 is not inverted relative to the
										pins.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGH</name>
									<description>High. The SSEL0 pin is active high. The value in
										the SSEL0 fields of the RXDAT, TXDATCTL, and TXCTL registers
										related to SSEL0 is inverted relative to the
										pins.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SPOL1</name>
							<description>SSEL1 Polarity select.</description>
							<bitRange>[9:9]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>LOW</name>
									<description>Low. The SSEL1 pin is active low. The value in the
										SSEL1 fields of the RXDAT, TXDATCTL, and TXCTL registers
										related to SSEL1 is not inverted relative to the
										pins.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGH</name>
									<description>High. The SSEL1 pin is active high. The value in
										the SSEL1 fields of the RXDAT, TXDATCTL, and TXCTL registers
										related to SSEL1 is inverted relative to the
										pins.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SPOL2</name>
							<description>SSEL2 Polarity select.</description>
							<bitRange>[10:10]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>LOW</name>
									<description>Low. The SSEL2 pin is active low. The value in the
										SSEL2 fields of the RXDAT, TXDATCTL, and TXCTL registers
										related to SSEL2 is not inverted relative to the
										pins.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGH</name>
									<description>High. The SSEL2 pin is active high. The value in
										the SSEL2 fields of the RXDAT, TXDATCTL, and TXCTL registers
										related to SSEL2 is inverted relative to the
										pins.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SPOL3</name>
							<description>SSEL3 Polarity select.</description>
							<bitRange>[11:11]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>LOW</name>
									<description>Low. The SSEL3 pin is active low. The value in the
										SSEL3 fields of the RXDAT, TXDATCTL, and TXCTL registers
										related to SSEL3 is not inverted relative to the
										pins.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGH</name>
									<description>High. The SSEL3 pin is active high. The value in
										the SSEL3 fields of the RXDAT, TXDATCTL, and TXCTL registers
										related to SSEL3 is inverted relative to the
										pins.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:12]</bitRange>

