cmsis-svd/cmsis-svd/data/NXP/LPC5410x_v0.4.svd
						</field>

						<field>
							<name>MSTIDLEEN</name>
							<description>Master idle interrupt enable</description>
							<bitRange>[8:8]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled. No interrupt will be generated when the
										SPI master function is idle.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enabled. An interrupt will be generated when the
										SPI master function is idle.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:9]</bitRange>

						</field>
					</fields>
				</register>
				<register>
					<name>INTENCLR</name>
					<description>SPI Interrupt Enable Clear. Writing a 1 to any implemented bit
						position causes the corresponding bit in INTENSET to be
						cleared.</description>
					<addressOffset>0x10</addressOffset>
					<access>write-only</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>RXRDYEN</name>
							<description>Writing 1 clears the corresponding bits in the INTENSET
								register.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>TXRDYEN</name>
							<description>Writing 1 clears the corresponding bits in the INTENSET
								register.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>RXOVEN</name>
							<description>Writing 1 clears the corresponding bits in the INTENSET
								register.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>TXUREN</name>
							<description>Writing 1 clears the corresponding bits in the INTENSET
								register.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>SSAEN</name>
							<description>Writing 1 clears the corresponding bits in the INTENSET
								register.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>SSDEN</name>
							<description>Writing 1 clears the corresponding bits in the INTENSET
								register.</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[7:6]</bitRange>
						</field>
						<field>
							<name>MSTIDLE</name>
							<description>Writing 1 clears the corresponding bits in the MSTIDLE
								register.</description>
							<bitRange>[8:8]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:9]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>RXDAT</name>
					<description>SPI Receive Data</description>
					<addressOffset>0x14</addressOffset>
					<access>read-only</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<readAction>modify</readAction>
					<fields>
						<field>
							<name>RXDAT</name>
							<description>Receiver Data. This contains the next piece of received
								data. The number of bits that are used depends on the LEN setting in
								TXCTL / TXDATCTL.</description>
							<bitRange>[15:0]</bitRange>
						</field>
						<field>
							<name>RXSSEL0_N</name>
							<description>Slave Select for receive. This field allows the state of
								the SSEL0 pin to be saved along with received data. The value will
								reflect the SSEL0 pin for both master and slave operation. A zero
								indicates that a slave select is active. The actual polarity of each
								slave select pin is configured by the related SPOL bit in
								CFG.</description>
							<bitRange>[16:16]</bitRange>
						</field>
						<field>
							<name>RXSSEL1_N</name>
							<description>Slave Select for receive. This field allows the state of
								the SSEL1 pin to be saved along with received data. The value will
								reflect the SSEL1 pin for both master and slave operation. A zero
								indicates that a slave select is active. The actual polarity of each
								slave select pin is configured by the related SPOL bit in
								CFG.</description>
							<bitRange>[17:17]</bitRange>
						</field>
						<field>
							<name>RXSSEL2_N</name>
							<description>Slave Select for receive. This field allows the state of
								the SSEL2 pin to be saved along with received data. The value will
								reflect the SSEL2 pin for both master and slave operation. A zero
								indicates that a slave select is active. The actual polarity of each
								slave select pin is configured by the related SPOL bit in
								CFG.</description>
							<bitRange>[18:18]</bitRange>
						</field>
						<field>
							<name>RXSSEL3_N</name>
							<description>Slave Select for receive. This field allows the state of
								the SSEL3 pin to be saved along with received data. The value will
								reflect the SSEL3 pin for both master and slave operation. A zero
								indicates that a slave select is active. The actual polarity of each
								slave select pin is configured by the related SPOL bit in
								CFG.</description>
							<bitRange>[19:19]</bitRange>
						</field>
						<field>
							<name>SOT</name>
							<description>Start of Transfer flag. This flag will be 1 if this is the
								first data after the SSELs went from deasserted to asserted (i.e.,
								any previous transfer has ended). This information can be used to
								identify the first piece of data in cases where the transfer length
								is greater than 16 bit.</description>
							<bitRange>[20:20]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, the value read from a reserved bit is not
								defined.</description>
							<bitRange>[31:21]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>TXDATCTL</name>
					<description>SPI Transmit Data with Control</description>
					<addressOffset>0x18</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>TXDAT</name>
							<description>Transmit Data. This field provides from 1 to 16 bits of
								data to be transmitted.</description>
							<bitRange>[15:0]</bitRange>

