cmsis-svd/cmsis-svd/data/NXP/LPC5410x_v0.4.svd
						</field>
						<field>
							<name>TXSSEL0_N</name>
							<description>Transmit Slave Select. This field asserts SSEL0 in master
								mode. The output on the pin is active LOW by default. The active
								state of the SSEL0 pin is configured by bits in the CFG
								register.</description>
							<bitRange>[16:16]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>SSEL0_ASSERTED</name>
									<description>SSEL0 asserted.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SSEL0_NOT_ASSERTED</name>
									<description>SSEL0 not asserted.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TXSSEL1_N</name>
							<description>Transmit Slave Select. This field asserts SSEL1 in master
								mode. The output on the pin is active LOW by default. The active
								state of the SSEL1 pin is configured by bits in the CFG
								register.</description>
							<bitRange>[17:17]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>SSEL1_ASSERTED</name>
									<description>SSEL1 asserted.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SSEL1_NOT_ASSERTED</name>
									<description>SSEL1 not asserted.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TXSSEL2_N</name>
							<description>Transmit Slave Select. This field asserts SSEL2 in master
								mode. The output on the pin is active LOW by default. The active
								state of the SSEL2 pin is configured by bits in the CFG
								register.</description>
							<bitRange>[18:18]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>SSEL2_ASSERTED</name>
									<description>SSEL2 asserted.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SSEL2_NOT_ASSERTED</name>
									<description>SSEL2 not asserted.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TXSSEL3_N</name>
							<description>Transmit Slave Select. This field asserts SSEL3 in master
								mode. The output on the pin is active LOW by default. The active
								state of the SSEL3 pin is configured by bits in the CFG
								register.</description>
							<bitRange>[19:19]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>SSEL3_ASSERTED</name>
									<description>SSEL3 asserted.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SSEL3_NOT_ASSERTED</name>
									<description>SSEL3 not asserted.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EOT</name>
							<description>End of Transfer. The asserted SSEL will be deasserted at
								the end of a transfer, and remain so for at least the time specified
								by the Transfer_delay value in the DLY register.</description>
							<bitRange>[20:20]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>SSEL_NOT_DEASSERTED</name>
									<description>SSEL not deasserted. This piece of data is not
										treated as the end of a transfer. SSEL will not be
										deasserted at the end of this data.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SSEL_DEASSERTED</name>
									<description>SSEL deasserted. This piece of data is treated as
										the end of a transfer. SSEL will be deasserted at the end of
										this piece of data.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EOF</name>
							<description>End of Frame. Between frames, a delay may be inserted, as
								defined by the FRAME_DELAY value in the DLY register. The end of a
								frame may not be particularly meaningful if the FRAME_DELAY value =
								0. This control can be used as part of the support for frame lengths
								greater than 16 bits.</description>
							<bitRange>[21:21]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DATA_NOT_EOF</name>
									<description>Data not EOF. This piece of data transmitted is not
										treated as the end of a frame.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DATA_EOF</name>
									<description>Data EOF. This piece of data is treated as the end
										of a frame, causing the FRAME_DELAY time to be inserted
										before subsequent data is transmitted.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RXIGNORE</name>
							<description>Receive Ignore. This allows data to be transmitted using
								the SPI without the need to read unneeded data from the
								receiver.Setting this bit simplifies the transmit process and can be
								used with the DMA.</description>
							<bitRange>[22:22]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>READ_RECEIVED_DATA</name>
									<description>Read received data. Received data must be read in
										order to allow transmission to progress. In slave mode, an
										overrun error will occur if received data is not read before
										new data is received.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>IGNORE_RECEIVED_DATA</name>
									<description>Ignore received data. Received data is ignored,
										allowing transmission without reading unneeded received
										data. No receiver flags are generated.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[23:23]</bitRange>

