cmsis-svd/cmsis-svd/data/NXP/LPC5410x_v0.4.svd
						</field>
						<field>
							<name>LEN</name>
							<description>Data Length. Specifies the data length from 1 to 16 bits.
								Note that transfer lengths greater than 16 bits are supported by
								implementing multiple sequential transmits. 0x0 = Data transfer is 1
								bit in length. 0x1 = Data transfer is 2 bits in length. 0x2 = Data
								transfer is 3 bits in length. ... 0xF = Data transfer is 16 bits in
								length.</description>
							<bitRange>[27:24]</bitRange>

						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:28]</bitRange>

						</field>
					</fields>
				</register>
				<register>
					<name>TXDAT</name>
					<description>SPI Transmit Data</description>
					<addressOffset>0x1C</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DATA</name>
							<description>Transmit Data. This field provides from 4 to 16 bits of
								data to be transmitted.</description>
							<bitRange>[15:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Only zero should be written.</description>
							<bitRange>[31:16]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>TXCTL</name>
					<description>SPI Transmit Control</description>
					<addressOffset>0x20</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[15:0]</bitRange>
						</field>
						<field>
							<name>TXSSEL0_N</name>
							<description>Transmit Slave Select 0.</description>
							<bitRange>[16:16]</bitRange>
						</field>
						<field>
							<name>TXSSEL1_N</name>
							<description>Transmit Slave Select 1.</description>
							<bitRange>[17:17]</bitRange>
						</field>
						<field>
							<name>TXSSEL2_N</name>
							<description>Transmit Slave Select 2.</description>
							<bitRange>[18:18]</bitRange>
						</field>
						<field>
							<name>TXSSEL3_n</name>
							<description>Transmit Slave Select 3.</description>
							<bitRange>[19:19]</bitRange>
						</field>
						<field>
							<name>EOT</name>
							<description>End of Transfer.</description>
							<bitRange>[20:20]</bitRange>
						</field>
						<field>
							<name>EOF</name>
							<description>End of Frame.</description>
							<bitRange>[21:21]</bitRange>
						</field>
						<field>
							<name>RXIGNORE</name>
							<description>Receive Ignore.</description>
							<bitRange>[22:22]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[23:23]</bitRange>
						</field>
						<field>
							<name>LEN</name>
							<description>Data transfer Length.</description>
							<bitRange>[27:24]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:28]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>DIV</name>
					<description>SPI clock Divider</description>
					<addressOffset>0x24</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DIVVAL</name>
							<description>Rate divider value. Specifies how the PCLK for the SPI is
								divided to produce the SPI clock rate in master mode. DIVVAL is -1
								encoded such that the value 0 results in PCLK/1, the value 1 results
								in PCLK/2, up to the maximum possible divide value of 0xFFFF, which
								results in PCLK/65536.</description>
							<bitRange>[15:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:16]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>INTSTAT</name>
					<description>SPI Interrupt Status</description>
					<addressOffset>0x28</addressOffset>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RXRDY</name>
							<description>Receiver Ready flag.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>TXRDY</name>
							<description>Transmitter Ready flag.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>RXOV</name>
							<description>Receiver Overrun interrupt flag.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>TXUR</name>
							<description>Transmitter Underrun interrupt flag.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>SSA</name>
							<description>Slave Select Assert.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>SSD</name>
							<description>Slave Select Deassert.</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[7:6]</bitRange>
						</field>
						<field>
							<name>MSTIDLE</name>
							<description>Master Idle status flag.</description>
							<bitRange>[8:8]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read value is undefined, only zero should be
								written.</description>
							<bitRange>[31:9]</bitRange>
						</field>
					</fields>
				</register>
			</registers>


		</peripheral>
		<peripheral derivedFrom="SPI0">
			<name>SPI1</name>
			<description>SPI1</description>
			<baseAddress>0x400A8000</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0x1000</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>SPI1</name>
				<value>25</value>
			</interrupt>

		</peripheral>


		<peripheral derivedFrom="CT32B2">
			<name>CT32B0</name>
			<description>Standard counter/timer 0 </description>
			<groupName>CT32B0</groupName>
			<baseAddress>0x400B4000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x1000</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>CT32B0</name>
				<value>11</value>
			</interrupt>

		</peripheral>
		<peripheral derivedFrom="CT32B2">
			<name>CT32B1</name>
			<description>Standard counter/timer 1 </description>
			<baseAddress>0x400B8000</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0x1000</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>CT32B1</name>
				<value>12</value>
			</interrupt>

		</peripheral>
	</peripherals>
</device>
